#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BtlUIColorHuman

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BtlUIColorHuman.ABP_BtlUIColorHuman_C
// 0x0220 (0x04E0 - 0x02C0)
class UABP_BtlUIColorHuman_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x02F8(0x01D8)(ContainsInstancedReference)
	class USkeletalMeshComponent*                 CharacterReference;                                // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_BtlUIColorHuman(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_BtlUIColorHuman_C">();
	}
	static class UABP_BtlUIColorHuman_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BtlUIColorHuman_C>();
	}
};
static_assert(alignof(UABP_BtlUIColorHuman_C) == 0x000010, "Wrong alignment on UABP_BtlUIColorHuman_C");
static_assert(sizeof(UABP_BtlUIColorHuman_C) == 0x0004E0, "Wrong size on UABP_BtlUIColorHuman_C");
static_assert(offsetof(UABP_BtlUIColorHuman_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_BtlUIColorHuman_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_BtlUIColorHuman_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UABP_BtlUIColorHuman_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_BtlUIColorHuman_C, AnimGraphNode_CopyPoseFromMesh) == 0x0002F8, "Member 'UABP_BtlUIColorHuman_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UABP_BtlUIColorHuman_C, CharacterReference) == 0x0004D0, "Member 'UABP_BtlUIColorHuman_C::CharacterReference' has a wrong offset!");

}

