#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Pp2001

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Xrd777_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Pp2001.ABP_Pp2001_C
// 0x0130 (0x0400 - 0x02D0)
class UABP_Pp2001_C final : public UCmpCommuCardAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0308(0x0048)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone;                      // 0x0350(0x00A0)()
	float                                         Pitch;                                             // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Pp2001(int32 EntryPoint);
	void RootYawEvent______0(float RootYaw);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Pp2001_C">();
	}
	static class UABP_Pp2001_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Pp2001_C>();
	}
};
static_assert(alignof(UABP_Pp2001_C) == 0x000010, "Wrong alignment on UABP_Pp2001_C");
static_assert(sizeof(UABP_Pp2001_C) == 0x000400, "Wrong size on UABP_Pp2001_C");
static_assert(offsetof(UABP_Pp2001_C, UberGraphFrame) == 0x0002D0, "Member 'UABP_Pp2001_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Pp2001_C, AnimGraphNode_Root) == 0x0002D8, "Member 'UABP_Pp2001_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Pp2001_C, AnimGraphNode_Slot) == 0x000308, "Member 'UABP_Pp2001_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Pp2001_C, AnimGraphNode_RotateRootBone) == 0x000350, "Member 'UABP_Pp2001_C::AnimGraphNode_RotateRootBone' has a wrong offset!");
static_assert(offsetof(UABP_Pp2001_C, Pitch) == 0x0003F0, "Member 'UABP_Pp2001_C::Pitch' has a wrong offset!");

}

