#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PC0001_AddPocketLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_PC0001_AddPocketLayer.ABP_PC0001_AddPocketLayer_C.ExecuteUbergraph_ABP_PC0001_AddPocketLayer
// 0x0190 (0x0190 - 0x0000)
struct ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Get_PC0001_Variables_C> K2Node_DynamicCast_AsBPI_Get_PC0001_Variables;     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is_EventPlayAndHaveBag_Out_Result;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Get_PC0001_Variables_C> K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_1;   // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_ForceAttachPocket_Out_ForceAttachPocket; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Get_PC0001_Variables_C> K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_2;   // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_IsAttachedBostonBag_Out_IsAttachedBostonBag; // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Get_PC0001_Variables_C> K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_3;   // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_L_Alpha; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_R_Alpha; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Interp_F_InOut_ReturnValue;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Get_PC0001_Variables_C> K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_4;   // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_L_Alpha_1; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_R_Alpha_1; // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Get_PC0001_Variables_C> K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_5;   // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_IsAttachedBostonBag_Out_IsAttachedBostonBag_1; // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer) == 0x000010, "Wrong alignment on ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer");
static_assert(sizeof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer) == 0x000190, "Wrong size on ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, EntryPoint) == 0x000000, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_AsBPI_Get_PC0001_Variables) == 0x000028, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_AsBPI_Get_PC0001_Variables' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_Is_EventPlayAndHaveBag_Out_Result) == 0x000039, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_Is_EventPlayAndHaveBag_Out_Result' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000040, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_Event_DeltaTimeX) == 0x00004C, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_BreakTransform_Location) == 0x000050, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_1) == 0x000078, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_1' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_Get_ForceAttachPocket_Out_ForceAttachPocket) == 0x000089, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_Get_ForceAttachPocket_Out_ForceAttachPocket' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_BreakTransform_Location_1) == 0x00008C, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_BreakTransform_Rotation_1) == 0x000098, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_BreakTransform_Scale_1) == 0x0000A4, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_2) == 0x0000B0, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_2' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_Get_IsAttachedBostonBag_Out_IsAttachedBostonBag) == 0x0000C1, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_Get_IsAttachedBostonBag_Out_IsAttachedBostonBag' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_3) == 0x0000C8, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_3' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_bSuccess_3) == 0x0000D8, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_L_Alpha) == 0x0000DC, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_L_Alpha' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_R_Alpha) == 0x0000E0, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_R_Alpha' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_FClamp_ReturnValue) == 0x0000E4, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_Interp_F_InOut_ReturnValue) == 0x0000E8, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_Interp_F_InOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_FClamp_ReturnValue_1) == 0x0000EC, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_4) == 0x0000F0, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_4' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_bSuccess_4) == 0x000100, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_L_Alpha_1) == 0x000104, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_L_Alpha_1' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_R_Alpha_1) == 0x000108, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_Get_AttachPocketAlpha_Out_AttachPocket_R_Alpha_1' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_5) == 0x000110, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_AsBPI_Get_PC0001_Variables_5' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, K2Node_DynamicCast_bSuccess_5) == 0x000120, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_Get_IsAttachedBostonBag_Out_IsAttachedBostonBag_1) == 0x000121, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_Get_IsAttachedBostonBag_Out_IsAttachedBostonBag_1' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_SelectFloat_ReturnValue) == 0x000124, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_FClamp_ReturnValue_2) == 0x000128, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_IsValid_ReturnValue_2) == 0x00012C, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_BooleanAND_ReturnValue) == 0x00012D, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_GetSocketTransform_ReturnValue) == 0x000130, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer, CallFunc_ComposeTransforms_ReturnValue) == 0x000160, "Member 'ABP_PC0001_AddPocketLayer_C_ExecuteUbergraph_ABP_PC0001_AddPocketLayer::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");

// Function ABP_PC0001_AddPocketLayer.ABP_PC0001_AddPocketLayer_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_PC0001_AddPocketLayer_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PC0001_AddPocketLayer_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_PC0001_AddPocketLayer_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_PC0001_AddPocketLayer_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_PC0001_AddPocketLayer_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_PC0001_AddPocketLayer_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_PC0001_AddPocketLayer.ABP_PC0001_AddPocketLayer_C.Set_IsAttachPocket
// 0x0010 (0x0010 - 0x0000)
struct ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket final
{
public:
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket) == 0x000004, "Wrong alignment on ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket");
static_assert(sizeof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket) == 0x000010, "Wrong size on ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000000, "Member 'ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000008, "Member 'ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000009, "Member 'ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket, CallFunc_BooleanOR_ReturnValue) == 0x00000A, "Member 'ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00000B, "Member 'ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00000C, "Member 'ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket, CallFunc_BooleanAND_ReturnValue_1) == 0x00000F, "Member 'ABP_PC0001_AddPocketLayer_C_Set_IsAttachPocket::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function ABP_PC0001_AddPocketLayer.ABP_PC0001_AddPocketLayer_C.Interp_F_InOut
// 0x0020 (0x0020 - 0x0000)
struct ABP_PC0001_AddPocketLayer_C_Interp_F_InOut final
{
public:
	float                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Increase_Interp;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decrease_Interp;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PC0001_AddPocketLayer_C_Interp_F_InOut) == 0x000004, "Wrong alignment on ABP_PC0001_AddPocketLayer_C_Interp_F_InOut");
static_assert(sizeof(ABP_PC0001_AddPocketLayer_C_Interp_F_InOut) == 0x000020, "Wrong size on ABP_PC0001_AddPocketLayer_C_Interp_F_InOut");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Interp_F_InOut, Current) == 0x000000, "Member 'ABP_PC0001_AddPocketLayer_C_Interp_F_InOut::Current' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Interp_F_InOut, Target) == 0x000004, "Member 'ABP_PC0001_AddPocketLayer_C_Interp_F_InOut::Target' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Interp_F_InOut, Increase_Interp) == 0x000008, "Member 'ABP_PC0001_AddPocketLayer_C_Interp_F_InOut::Increase_Interp' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Interp_F_InOut, Decrease_Interp) == 0x00000C, "Member 'ABP_PC0001_AddPocketLayer_C_Interp_F_InOut::Decrease_Interp' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Interp_F_InOut, ReturnValue) == 0x000010, "Member 'ABP_PC0001_AddPocketLayer_C_Interp_F_InOut::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Interp_F_InOut, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'ABP_PC0001_AddPocketLayer_C_Interp_F_InOut::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Interp_F_InOut, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'ABP_PC0001_AddPocketLayer_C_Interp_F_InOut::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_Interp_F_InOut, CallFunc_FInterpTo_ReturnValue) == 0x00001C, "Member 'ABP_PC0001_AddPocketLayer_C_Interp_F_InOut::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function ABP_PC0001_AddPocketLayer.ABP_PC0001_AddPocketLayer_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PC0001_AddPocketLayer_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PC0001_AddPocketLayer_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_PC0001_AddPocketLayer_C_AnimGraph");
static_assert(sizeof(ABP_PC0001_AddPocketLayer_C_AnimGraph) == 0x000010, "Wrong size on ABP_PC0001_AddPocketLayer_C_AnimGraph");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_PC0001_AddPocketLayer_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_PC0001_AddPocketLayer.ABP_PC0001_AddPocketLayer_C.CustomAdditiveLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_PC0001_AddPocketLayer_C_CustomAdditiveLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CustomAdditiveLayer_0;                             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PC0001_AddPocketLayer_C_CustomAdditiveLayer) == 0x000008, "Wrong alignment on ABP_PC0001_AddPocketLayer_C_CustomAdditiveLayer");
static_assert(sizeof(ABP_PC0001_AddPocketLayer_C_CustomAdditiveLayer) == 0x000020, "Wrong size on ABP_PC0001_AddPocketLayer_C_CustomAdditiveLayer");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_CustomAdditiveLayer, InPose) == 0x000000, "Member 'ABP_PC0001_AddPocketLayer_C_CustomAdditiveLayer::InPose' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_CustomAdditiveLayer, CustomAdditiveLayer_0) == 0x000010, "Member 'ABP_PC0001_AddPocketLayer_C_CustomAdditiveLayer::CustomAdditiveLayer_0' has a wrong offset!");

// Function ABP_PC0001_AddPocketLayer.ABP_PC0001_AddPocketLayer_C.CostumePhysLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_PC0001_AddPocketLayer_C_CostumePhysLayer final
{
public:
	struct FPoseLink                              InPhysicsPose;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CostumePhysLayer_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PC0001_AddPocketLayer_C_CostumePhysLayer) == 0x000008, "Wrong alignment on ABP_PC0001_AddPocketLayer_C_CostumePhysLayer");
static_assert(sizeof(ABP_PC0001_AddPocketLayer_C_CostumePhysLayer) == 0x000020, "Wrong size on ABP_PC0001_AddPocketLayer_C_CostumePhysLayer");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_CostumePhysLayer, InPhysicsPose) == 0x000000, "Member 'ABP_PC0001_AddPocketLayer_C_CostumePhysLayer::InPhysicsPose' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_CostumePhysLayer, CostumePhysLayer_0) == 0x000010, "Member 'ABP_PC0001_AddPocketLayer_C_CostumePhysLayer::CostumePhysLayer_0' has a wrong offset!");

// Function ABP_PC0001_AddPocketLayer.ABP_PC0001_AddPocketLayer_C.CostumeAdjustLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_PC0001_AddPocketLayer_C_CostumeAdjustLayer final
{
public:
	struct FPoseLink                              InMeshPose;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CostumeAdjustLayer_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PC0001_AddPocketLayer_C_CostumeAdjustLayer) == 0x000008, "Wrong alignment on ABP_PC0001_AddPocketLayer_C_CostumeAdjustLayer");
static_assert(sizeof(ABP_PC0001_AddPocketLayer_C_CostumeAdjustLayer) == 0x000020, "Wrong size on ABP_PC0001_AddPocketLayer_C_CostumeAdjustLayer");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_CostumeAdjustLayer, InMeshPose) == 0x000000, "Member 'ABP_PC0001_AddPocketLayer_C_CostumeAdjustLayer::InMeshPose' has a wrong offset!");
static_assert(offsetof(ABP_PC0001_AddPocketLayer_C_CostumeAdjustLayer, CostumeAdjustLayer_0) == 0x000010, "Member 'ABP_PC0001_AddPocketLayer_C_CostumeAdjustLayer::CostumeAdjustLayer_0' has a wrong offset!");

}

