#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPI_HairLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABPI_HairLayer.ABPI_HairLayer_C.HairPhysLayer
// 0x0020 (0x0020 - 0x0000)
struct ABPI_HairLayer_C_HairPhysLayer final
{
public:
	struct FPoseLink                              InPhysPose;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HairPhysLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABPI_HairLayer_C_HairPhysLayer) == 0x000008, "Wrong alignment on ABPI_HairLayer_C_HairPhysLayer");
static_assert(sizeof(ABPI_HairLayer_C_HairPhysLayer) == 0x000020, "Wrong size on ABPI_HairLayer_C_HairPhysLayer");
static_assert(offsetof(ABPI_HairLayer_C_HairPhysLayer, InPhysPose) == 0x000000, "Member 'ABPI_HairLayer_C_HairPhysLayer::InPhysPose' has a wrong offset!");
static_assert(offsetof(ABPI_HairLayer_C_HairPhysLayer, HairPhysLayer_0) == 0x000010, "Member 'ABPI_HairLayer_C_HairPhysLayer::HairPhysLayer_0' has a wrong offset!");

// Function ABPI_HairLayer.ABPI_HairLayer_C.HairAdjustLayer
// 0x0020 (0x0020 - 0x0000)
struct ABPI_HairLayer_C_HairAdjustLayer final
{
public:
	struct FPoseLink                              InMeshPose;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HairAdjustLayer_0;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABPI_HairLayer_C_HairAdjustLayer) == 0x000008, "Wrong alignment on ABPI_HairLayer_C_HairAdjustLayer");
static_assert(sizeof(ABPI_HairLayer_C_HairAdjustLayer) == 0x000020, "Wrong size on ABPI_HairLayer_C_HairAdjustLayer");
static_assert(offsetof(ABPI_HairLayer_C_HairAdjustLayer, InMeshPose) == 0x000000, "Member 'ABPI_HairLayer_C_HairAdjustLayer::InMeshPose' has a wrong offset!");
static_assert(offsetof(ABPI_HairLayer_C_HairAdjustLayer, HairAdjustLayer_0) == 0x000010, "Member 'ABPI_HairLayer_C_HairAdjustLayer::HairAdjustLayer_0' has a wrong offset!");

}

