#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_PlayAtomCue

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_PlayAtomCue.PlayAtomCue_C
// 0x0020 (0x0058 - 0x0038)
class UPlayAtomCue_C final : public UAnimNotify
{
public:
	class USoundAtomCue*                          Sound;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Bone;                                              // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Follow;                                            // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VolumeMultiplier;                                  // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchMultiplier;                                   // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;
	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayAtomCue_C">();
	}
	static class UPlayAtomCue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayAtomCue_C>();
	}
};
static_assert(alignof(UPlayAtomCue_C) == 0x000008, "Wrong alignment on UPlayAtomCue_C");
static_assert(sizeof(UPlayAtomCue_C) == 0x000058, "Wrong size on UPlayAtomCue_C");
static_assert(offsetof(UPlayAtomCue_C, Sound) == 0x000038, "Member 'UPlayAtomCue_C::Sound' has a wrong offset!");
static_assert(offsetof(UPlayAtomCue_C, Bone) == 0x000040, "Member 'UPlayAtomCue_C::Bone' has a wrong offset!");
static_assert(offsetof(UPlayAtomCue_C, Follow) == 0x000048, "Member 'UPlayAtomCue_C::Follow' has a wrong offset!");
static_assert(offsetof(UPlayAtomCue_C, VolumeMultiplier) == 0x00004C, "Member 'UPlayAtomCue_C::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(UPlayAtomCue_C, PitchMultiplier) == 0x000050, "Member 'UPlayAtomCue_C::PitchMultiplier' has a wrong offset!");

}

