#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtlSocketPlugin

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class AtlSocketPlugin.AtlSocketBase
// 0x00A8 (0x00D0 - 0x0028)
class UAtlSocketBase : public UObject
{
public:
	uint8                                         Pad_28[0xA8];                                      // 0x0028(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtlSocketBase">();
	}
	static class UAtlSocketBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtlSocketBase>();
	}
};
static_assert(alignof(UAtlSocketBase) == 0x000008, "Wrong alignment on UAtlSocketBase");
static_assert(sizeof(UAtlSocketBase) == 0x0000D0, "Wrong size on UAtlSocketBase");

// Class AtlSocketPlugin.AtlSocketStringUtils
// 0x0000 (0x0028 - 0x0028)
class UAtlSocketStringUtils final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtlSocketStringUtils">();
	}
	static class UAtlSocketStringUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtlSocketStringUtils>();
	}
};
static_assert(alignof(UAtlSocketStringUtils) == 0x000008, "Wrong alignment on UAtlSocketStringUtils");
static_assert(sizeof(UAtlSocketStringUtils) == 0x000028, "Wrong size on UAtlSocketStringUtils");

// Class AtlSocketPlugin.AtlTcpListener
// 0x0020 (0x00F0 - 0x00D0)
class UAtlTcpListener final : public UAtlSocketBase
{
public:
	TArray<class UAtlTcpSocket*>                  Clients_;                                          // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDisconnectedClient(const class UAtlSocketBase* Socket);
	void OnReceivedFromClient(const class UAtlSocketBase* Socket, const TArray<uint8>& Buffer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtlTcpListener">();
	}
	static class UAtlTcpListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtlTcpListener>();
	}
};
static_assert(alignof(UAtlTcpListener) == 0x000008, "Wrong alignment on UAtlTcpListener");
static_assert(sizeof(UAtlTcpListener) == 0x0000F0, "Wrong size on UAtlTcpListener");
static_assert(offsetof(UAtlTcpListener, Clients_) == 0x0000D0, "Member 'UAtlTcpListener::Clients_' has a wrong offset!");

// Class AtlSocketPlugin.AtlTcpSocket
// 0x0018 (0x00E8 - 0x00D0)
class UAtlTcpSocket final : public UAtlSocketBase
{
public:
	uint8                                         Pad_D0[0x18];                                      // 0x00D0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtlTcpSocket">();
	}
	static class UAtlTcpSocket* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtlTcpSocket>();
	}
};
static_assert(alignof(UAtlTcpSocket) == 0x000008, "Wrong alignment on UAtlTcpSocket");
static_assert(sizeof(UAtlTcpSocket) == 0x0000E8, "Wrong size on UAtlTcpSocket");

}

