#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtlSocketPlugin

#include "Basic.hpp"


namespace SDK::Params
{

// Function AtlSocketPlugin.AtlTcpListener.OnDisconnectedClient
// 0x0008 (0x0008 - 0x0000)
struct AtlTcpListener_OnDisconnectedClient final
{
public:
	const class UAtlSocketBase*                   Socket;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtlTcpListener_OnDisconnectedClient) == 0x000008, "Wrong alignment on AtlTcpListener_OnDisconnectedClient");
static_assert(sizeof(AtlTcpListener_OnDisconnectedClient) == 0x000008, "Wrong size on AtlTcpListener_OnDisconnectedClient");
static_assert(offsetof(AtlTcpListener_OnDisconnectedClient, Socket) == 0x000000, "Member 'AtlTcpListener_OnDisconnectedClient::Socket' has a wrong offset!");

// Function AtlSocketPlugin.AtlTcpListener.OnReceivedFromClient
// 0x0018 (0x0018 - 0x0000)
struct AtlTcpListener_OnReceivedFromClient final
{
public:
	const class UAtlSocketBase*                   Socket;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Buffer;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtlTcpListener_OnReceivedFromClient) == 0x000008, "Wrong alignment on AtlTcpListener_OnReceivedFromClient");
static_assert(sizeof(AtlTcpListener_OnReceivedFromClient) == 0x000018, "Wrong size on AtlTcpListener_OnReceivedFromClient");
static_assert(offsetof(AtlTcpListener_OnReceivedFromClient, Socket) == 0x000000, "Member 'AtlTcpListener_OnReceivedFromClient::Socket' has a wrong offset!");
static_assert(offsetof(AtlTcpListener_OnReceivedFromClient, Buffer) == 0x000008, "Member 'AtlTcpListener_OnReceivedFromClient::Buffer' has a wrong offset!");

}

