#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AugmentedReality

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AugmentedReality_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class AugmentedReality.ARActor
// 0x0000 (0x0220 - 0x0220)
class AARActor final : public AActor
{
public:
	class UARComponent* AddARComponent(TSubclassOf<class UARComponent> InComponentClass, const struct FGuid& NativeID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARActor">();
	}
	static class AARActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AARActor>();
	}
};
static_assert(alignof(AARActor) == 0x000008, "Wrong alignment on AARActor");
static_assert(sizeof(AARActor) == 0x000220, "Wrong size on AARActor");

// Class AugmentedReality.ARBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UARBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool AddManualEnvironmentCaptureProbe(const struct FVector& Location, const struct FVector& Extent);
	static class UARCandidateImage* AddRuntimeCandidateImage(class UARSessionConfig* SessionConfig, class UTexture2D* CandidateTexture, const class FString& FriendlyName, float PhysicalWidth);
	static bool AddTrackedPointWithName(const struct FTransform& WorldTransform, const class FString& PointName, bool bDeletePointsWithSameName);
	static void CalculateAlignmentTransform(const struct FTransform& TransformInFirstCoordinateSystem, const struct FTransform& TransformInSecondCoordinateSystem, struct FTransform* AlignmentTransform);
	static void CalculateClosestIntersection(const TArray<struct FVector>& StartPoints, const TArray<struct FVector>& EndPoints, struct FVector* ClosestIntersection);
	static void DebugDrawPin(class UARPin* ARPin, class UObject* WorldContextObject, const struct FLinearColor& Color, float Scale, float PersistForSeconds);
	static void DebugDrawTrackedGeometry(class UARTrackedGeometry* TrackedGeometry, class UObject* WorldContextObject, const struct FLinearColor& Color, float OutlineThickness, float PersistForSeconds);
	static TArray<class UARTrackedPoint*> FindTrackedPointsByName(const class FString& PointName);
	static struct FTransform GetAlignmentTransform();
	static TArray<class UARTrackedGeometry*> GetAllGeometries();
	static TArray<class UARTrackedGeometry*> GetAllGeometriesByClass(TSubclassOf<class UARTrackedGeometry> GeometryClass);
	static TArray<class UARPin*> GetAllPins();
	static TArray<struct FARPose2D> GetAllTracked2DPoses();
	static TArray<class UAREnvironmentCaptureProbe*> GetAllTrackedEnvironmentCaptureProbes();
	static TArray<class UARTrackedImage*> GetAllTrackedImages();
	static TArray<class UARPlaneGeometry*> GetAllTrackedPlanes();
	static TArray<class UARTrackedPoint*> GetAllTrackedPoints();
	static TArray<class UARTrackedPose*> GetAllTrackedPoses();
	static struct FARSessionStatus GetARSessionStatus();
	static class UARTexture* GetARTexture(EARTextureType TextureType);
	static float GetARWorldScale();
	static class UARTextureCameraDepth* GetCameraDepth();
	static class UARTextureCameraImage* GetCameraImage();
	static bool GetCameraIntrinsics(struct FARCameraIntrinsics* OutCameraIntrinsics);
	static class UARLightEstimate* GetCurrentLightEstimate();
	static int32 GetNumberOfTrackedFacesSupported();
	static bool GetObjectClassificationAtLocation(const struct FVector& InWorldLocation, EARObjectClassification* OutClassification, struct FVector* OutClassificationLocation, float MaxLocationDiff);
	static class UARTexture* GetPersonSegmentationDepthImage();
	static class UARTexture* GetPersonSegmentationImage();
	static TArray<struct FVector> GetPointCloud();
	static class UARSessionConfig* GetSessionConfig();
	static TArray<struct FARVideoFormat> GetSupportedVideoFormats(EARSessionType SessionType);
	static EARTrackingQuality GetTrackingQuality();
	static EARTrackingQualityReason GetTrackingQualityReason();
	static EARWorldMappingState GetWorldMappingStatus();
	static bool IsARPinLocalStoreReady();
	static bool IsARPinLocalStoreSupported();
	static bool IsARSupported();
	static bool IsSceneReconstructionSupported(EARSessionType SessionType, EARSceneReconstruction SceneReconstructionMethod);
	static bool IsSessionTrackingFeatureSupported(EARSessionType SessionType, EARSessionTrackingFeature SessionTrackingFeature);
	static bool IsSessionTypeSupported(EARSessionType SessionType);
	static TArray<struct FARTraceResult> LineTraceTrackedObjects(const struct FVector2D& ScreenCoord, bool bTestFeaturePoints, bool bTestGroundPlane, bool bTestPlaneExtents, bool bTestPlaneBoundaryPolygon);
	static TArray<struct FARTraceResult> LineTraceTrackedObjects3D(const struct FVector& Start, const struct FVector& End, bool bTestFeaturePoints, bool bTestGroundPlane, bool bTestPlaneExtents, bool bTestPlaneBoundaryPolygon);
	static TMap<class FName, class UARPin*> LoadARPinsFromLocalStore();
	static void PauseARSession();
	static class UARPin* PinComponent(class USceneComponent* ComponentToPin, const struct FTransform& PinToWorldTransform, class UARTrackedGeometry* TrackedGeometry, const class FName DebugName);
	static bool PinComponentToARPin(class USceneComponent* ComponentToPin, class UARPin* Pin);
	static class UARPin* PinComponentToTraceResult(class USceneComponent* ComponentToPin, const struct FARTraceResult& TraceResult, const class FName DebugName);
	static void RemoveAllARPinsFromLocalStore();
	static void RemoveARPinFromLocalStore(class FName InSaveName);
	static void RemovePin(class UARPin* PinToRemove);
	static struct FIntPoint ResizeXRCamera(const struct FIntPoint& InSize);
	static bool SaveARPinToLocalStore(class FName InSaveName, class UARPin* InPin);
	static void SetAlignmentTransform(const struct FTransform& InAlignmentTransform);
	static void SetARWorldOriginLocationAndRotation(const struct FVector& OriginLocation, const struct FRotator& OriginRotation, bool bIsTransformInWorldSpace, bool bMaintainUpDirection);
	static void SetARWorldScale(float InWorldScale);
	static void SetEnabledXRCamera(bool bOnOff);
	static void StartARSession(class UARSessionConfig* SessionConfig);
	static void StopARSession();
	static bool ToggleARCapture(const bool bOnOff, const EARCaptureType CaptureType);
	static void UnpinComponent(class USceneComponent* ComponentToUnpin);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARBlueprintLibrary">();
	}
	static class UARBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARBlueprintLibrary>();
	}
};
static_assert(alignof(UARBlueprintLibrary) == 0x000008, "Wrong alignment on UARBlueprintLibrary");
static_assert(sizeof(UARBlueprintLibrary) == 0x000028, "Wrong size on UARBlueprintLibrary");

// Class AugmentedReality.ARTraceResultLibrary
// 0x0000 (0x0028 - 0x0028)
class UARTraceResultLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float GetDistanceFromCamera(const struct FARTraceResult& TraceResult);
	static struct FTransform GetLocalToTrackingTransform(const struct FARTraceResult& TraceResult);
	static struct FTransform GetLocalToWorldTransform(const struct FARTraceResult& TraceResult);
	static struct FTransform GetLocalTransform(const struct FARTraceResult& TraceResult);
	static EARLineTraceChannels GetTraceChannel(const struct FARTraceResult& TraceResult);
	static class UARTrackedGeometry* GetTrackedGeometry(const struct FARTraceResult& TraceResult);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARTraceResultLibrary">();
	}
	static class UARTraceResultLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTraceResultLibrary>();
	}
};
static_assert(alignof(UARTraceResultLibrary) == 0x000008, "Wrong alignment on UARTraceResultLibrary");
static_assert(sizeof(UARTraceResultLibrary) == 0x000028, "Wrong size on UARTraceResultLibrary");

// Class AugmentedReality.ARBaseAsyncTaskBlueprintProxy
// 0x0020 (0x0050 - 0x0030)
class UARBaseAsyncTaskBlueprintProxy : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARBaseAsyncTaskBlueprintProxy">();
	}
	static class UARBaseAsyncTaskBlueprintProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARBaseAsyncTaskBlueprintProxy>();
	}
};
static_assert(alignof(UARBaseAsyncTaskBlueprintProxy) == 0x000008, "Wrong alignment on UARBaseAsyncTaskBlueprintProxy");
static_assert(sizeof(UARBaseAsyncTaskBlueprintProxy) == 0x000050, "Wrong size on UARBaseAsyncTaskBlueprintProxy");

// Class AugmentedReality.ARSaveWorldAsyncTaskBlueprintProxy
// 0x0030 (0x0080 - 0x0050)
class UARSaveWorldAsyncTaskBlueprintProxy final : public UARBaseAsyncTaskBlueprintProxy
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailed;                                          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UARSaveWorldAsyncTaskBlueprintProxy* ARSaveWorld(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARSaveWorldAsyncTaskBlueprintProxy">();
	}
	static class UARSaveWorldAsyncTaskBlueprintProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARSaveWorldAsyncTaskBlueprintProxy>();
	}
};
static_assert(alignof(UARSaveWorldAsyncTaskBlueprintProxy) == 0x000008, "Wrong alignment on UARSaveWorldAsyncTaskBlueprintProxy");
static_assert(sizeof(UARSaveWorldAsyncTaskBlueprintProxy) == 0x000080, "Wrong size on UARSaveWorldAsyncTaskBlueprintProxy");
static_assert(offsetof(UARSaveWorldAsyncTaskBlueprintProxy, OnSuccess) == 0x000050, "Member 'UARSaveWorldAsyncTaskBlueprintProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UARSaveWorldAsyncTaskBlueprintProxy, OnFailed) == 0x000060, "Member 'UARSaveWorldAsyncTaskBlueprintProxy::OnFailed' has a wrong offset!");

// Class AugmentedReality.ARGetCandidateObjectAsyncTaskBlueprintProxy
// 0x0048 (0x0098 - 0x0050)
class UARGetCandidateObjectAsyncTaskBlueprintProxy final : public UARBaseAsyncTaskBlueprintProxy
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailed;                                          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x28];                                      // 0x0070(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UARGetCandidateObjectAsyncTaskBlueprintProxy* ARGetCandidateObject(class UObject* WorldContextObject, const struct FVector& Location, const struct FVector& Extent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARGetCandidateObjectAsyncTaskBlueprintProxy">();
	}
	static class UARGetCandidateObjectAsyncTaskBlueprintProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARGetCandidateObjectAsyncTaskBlueprintProxy>();
	}
};
static_assert(alignof(UARGetCandidateObjectAsyncTaskBlueprintProxy) == 0x000008, "Wrong alignment on UARGetCandidateObjectAsyncTaskBlueprintProxy");
static_assert(sizeof(UARGetCandidateObjectAsyncTaskBlueprintProxy) == 0x000098, "Wrong size on UARGetCandidateObjectAsyncTaskBlueprintProxy");
static_assert(offsetof(UARGetCandidateObjectAsyncTaskBlueprintProxy, OnSuccess) == 0x000050, "Member 'UARGetCandidateObjectAsyncTaskBlueprintProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UARGetCandidateObjectAsyncTaskBlueprintProxy, OnFailed) == 0x000060, "Member 'UARGetCandidateObjectAsyncTaskBlueprintProxy::OnFailed' has a wrong offset!");

// Class AugmentedReality.ARComponent
// 0x0080 (0x0280 - 0x0200)
#pragma pack(push, 0x1)
class alignas(0x10) UARComponent : public USceneComponent
{
public:
	struct FGuid                                  NativeID;                                          // 0x01F8(0x0010)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_208[0x30];                                     // 0x0208(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseDefaultReplication;                            // 0x0238(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     DefaultMeshMaterial;                               // 0x0240(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     DefaultWireframeMeshMaterial;                      // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMRMeshComponent*                       MRMeshComponent;                                   // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UARTrackedGeometry*                     MyTrackedGeometry;                                 // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_260[0x18];                                     // 0x0260(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMRMeshComponent* GetMRMesh();
	void OnRep_Payload();
	void ReceiveRemove();
	void SetNativeID(const struct FGuid& NativeID_0);
	void UpdateVisualization();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARComponent">();
	}
	static class UARComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARComponent>();
	}
};
#pragma pack(pop)
static_assert(alignof(UARComponent) == 0x000010, "Wrong alignment on UARComponent");
static_assert(sizeof(UARComponent) == 0x000280, "Wrong size on UARComponent");
static_assert(offsetof(UARComponent, NativeID) == 0x0001F8, "Member 'UARComponent::NativeID' has a wrong offset!");
static_assert(offsetof(UARComponent, bUseDefaultReplication) == 0x000238, "Member 'UARComponent::bUseDefaultReplication' has a wrong offset!");
static_assert(offsetof(UARComponent, DefaultMeshMaterial) == 0x000240, "Member 'UARComponent::DefaultMeshMaterial' has a wrong offset!");
static_assert(offsetof(UARComponent, DefaultWireframeMeshMaterial) == 0x000248, "Member 'UARComponent::DefaultWireframeMeshMaterial' has a wrong offset!");
static_assert(offsetof(UARComponent, MRMeshComponent) == 0x000250, "Member 'UARComponent::MRMeshComponent' has a wrong offset!");
static_assert(offsetof(UARComponent, MyTrackedGeometry) == 0x000258, "Member 'UARComponent::MyTrackedGeometry' has a wrong offset!");

// Class AugmentedReality.ARPlaneComponent
// 0x0080 (0x0300 - 0x0280)
class UARPlaneComponent final : public UARComponent
{
public:
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FARPlaneUpdatePayload                  ReplicatedPayload;                                 // 0x0280(0x0080)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	static const TMap<EARObjectClassification, struct FLinearColor> GetObjectClassificationDebugColors();
	static void SetObjectClassificationDebugColors(const TMap<EARObjectClassification, struct FLinearColor>& InColors);
	static void SetPlaneComponentDebugMode(EPlaneComponentDebugMode NewDebugMode);

	void ReceiveAdd(const struct FARPlaneUpdatePayload& Payload);
	void ReceiveUpdate(const struct FARPlaneUpdatePayload& Payload);
	void ServerUpdatePayload(const struct FARPlaneUpdatePayload& NewPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARPlaneComponent">();
	}
	static class UARPlaneComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARPlaneComponent>();
	}
};
static_assert(alignof(UARPlaneComponent) == 0x000010, "Wrong alignment on UARPlaneComponent");
static_assert(sizeof(UARPlaneComponent) == 0x000300, "Wrong size on UARPlaneComponent");
static_assert(offsetof(UARPlaneComponent, ReplicatedPayload) == 0x000280, "Member 'UARPlaneComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARPointComponent
// 0x0000 (0x0280 - 0x0280)
class UARPointComponent final : public UARComponent
{
public:
	struct FARPointUpdatePayload                  ReplicatedPayload;                                 // 0x0278(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveAdd(const struct FARPointUpdatePayload& Payload);
	void ReceiveUpdate(const struct FARPointUpdatePayload& Payload);
	void ServerUpdatePayload(const struct FARPointUpdatePayload& NewPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARPointComponent">();
	}
	static class UARPointComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARPointComponent>();
	}
};
static_assert(alignof(UARPointComponent) == 0x000010, "Wrong alignment on UARPointComponent");
static_assert(sizeof(UARPointComponent) == 0x000280, "Wrong size on UARPointComponent");
static_assert(offsetof(UARPointComponent, ReplicatedPayload) == 0x000278, "Member 'UARPointComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARFaceComponent
// 0x0060 (0x02E0 - 0x0280)
class UARFaceComponent final : public UARComponent
{
public:
	EARFaceTransformMixing                        TransformSetting;                                  // 0x0278(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdateVertexNormal;                               // 0x0279(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFaceOutOfScreen;                                  // 0x027A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FARFaceUpdatePayload                   ReplicatedPayload;                                 // 0x0280(0x0040)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C0[0x20];                                     // 0x02C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void SetFaceComponentDebugMode(EFaceComponentDebugMode NewDebugMode);

	void ReceiveAdd(const struct FARFaceUpdatePayload& Payload);
	void ReceiveUpdate(const struct FARFaceUpdatePayload& Payload);
	void ServerUpdatePayload(const struct FARFaceUpdatePayload& NewPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARFaceComponent">();
	}
	static class UARFaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARFaceComponent>();
	}
};
static_assert(alignof(UARFaceComponent) == 0x000010, "Wrong alignment on UARFaceComponent");
static_assert(sizeof(UARFaceComponent) == 0x0002E0, "Wrong size on UARFaceComponent");
static_assert(offsetof(UARFaceComponent, TransformSetting) == 0x000278, "Member 'UARFaceComponent::TransformSetting' has a wrong offset!");
static_assert(offsetof(UARFaceComponent, bUpdateVertexNormal) == 0x000279, "Member 'UARFaceComponent::bUpdateVertexNormal' has a wrong offset!");
static_assert(offsetof(UARFaceComponent, bFaceOutOfScreen) == 0x00027A, "Member 'UARFaceComponent::bFaceOutOfScreen' has a wrong offset!");
static_assert(offsetof(UARFaceComponent, ReplicatedPayload) == 0x000280, "Member 'UARFaceComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARImageComponent
// 0x0060 (0x02E0 - 0x0280)
class UARImageComponent final : public UARComponent
{
public:
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FARImageUpdatePayload                  ReplicatedPayload;                                 // 0x0280(0x0060)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static void SetImageComponentDebugMode(EImageComponentDebugMode NewDebugMode);

	void ReceiveAdd(const struct FARImageUpdatePayload& Payload);
	void ReceiveUpdate(const struct FARImageUpdatePayload& Payload);
	void ServerUpdatePayload(const struct FARImageUpdatePayload& NewPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARImageComponent">();
	}
	static class UARImageComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARImageComponent>();
	}
};
static_assert(alignof(UARImageComponent) == 0x000010, "Wrong alignment on UARImageComponent");
static_assert(sizeof(UARImageComponent) == 0x0002E0, "Wrong size on UARImageComponent");
static_assert(offsetof(UARImageComponent, ReplicatedPayload) == 0x000280, "Member 'UARImageComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARQRCodeComponent
// 0x0070 (0x02F0 - 0x0280)
class UARQRCodeComponent final : public UARComponent
{
public:
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FARQRCodeUpdatePayload                 ReplicatedPayload;                                 // 0x0280(0x0070)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	static void SetQRCodeComponentDebugMode(EQRCodeComponentDebugMode NewDebugMode);

	void ReceiveAdd(const struct FARQRCodeUpdatePayload& Payload);
	void ReceiveUpdate(const struct FARQRCodeUpdatePayload& Payload);
	void ServerUpdatePayload(const struct FARQRCodeUpdatePayload& NewPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARQRCodeComponent">();
	}
	static class UARQRCodeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARQRCodeComponent>();
	}
};
static_assert(alignof(UARQRCodeComponent) == 0x000010, "Wrong alignment on UARQRCodeComponent");
static_assert(sizeof(UARQRCodeComponent) == 0x0002F0, "Wrong size on UARQRCodeComponent");
static_assert(offsetof(UARQRCodeComponent, ReplicatedPayload) == 0x000280, "Member 'UARQRCodeComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARPoseComponent
// 0x0040 (0x02C0 - 0x0280)
class UARPoseComponent final : public UARComponent
{
public:
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FARPoseUpdatePayload                   ReplicatedPayload;                                 // 0x0280(0x0040)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	static void SetPoseComponentDebugMode(EPoseComponentDebugMode NewDebugMode);

	void ReceiveAdd(const struct FARPoseUpdatePayload& Payload);
	void ReceiveUpdate(const struct FARPoseUpdatePayload& Payload);
	void ServerUpdatePayload(const struct FARPoseUpdatePayload& NewPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARPoseComponent">();
	}
	static class UARPoseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARPoseComponent>();
	}
};
static_assert(alignof(UARPoseComponent) == 0x000010, "Wrong alignment on UARPoseComponent");
static_assert(sizeof(UARPoseComponent) == 0x0002C0, "Wrong size on UARPoseComponent");
static_assert(offsetof(UARPoseComponent, ReplicatedPayload) == 0x000280, "Member 'UARPoseComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.AREnvironmentProbeComponent
// 0x0030 (0x02B0 - 0x0280)
class UAREnvironmentProbeComponent final : public UARComponent
{
public:
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAREnvironmentProbeUpdatePayload       ReplicatedPayload;                                 // 0x0280(0x0030)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void ReceiveAdd(const struct FAREnvironmentProbeUpdatePayload& Payload);
	void ReceiveUpdate(const struct FAREnvironmentProbeUpdatePayload& Payload);
	void ServerUpdatePayload(const struct FAREnvironmentProbeUpdatePayload& NewPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AREnvironmentProbeComponent">();
	}
	static class UAREnvironmentProbeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAREnvironmentProbeComponent>();
	}
};
static_assert(alignof(UAREnvironmentProbeComponent) == 0x000010, "Wrong alignment on UAREnvironmentProbeComponent");
static_assert(sizeof(UAREnvironmentProbeComponent) == 0x0002B0, "Wrong size on UAREnvironmentProbeComponent");
static_assert(offsetof(UAREnvironmentProbeComponent, ReplicatedPayload) == 0x000280, "Member 'UAREnvironmentProbeComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARObjectComponent
// 0x0030 (0x02B0 - 0x0280)
class UARObjectComponent final : public UARComponent
{
public:
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FARObjectUpdatePayload                 ReplicatedPayload;                                 // 0x0280(0x0030)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void ReceiveAdd(const struct FARObjectUpdatePayload& Payload);
	void ReceiveUpdate(const struct FARObjectUpdatePayload& Payload);
	void ServerUpdatePayload(const struct FARObjectUpdatePayload& NewPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARObjectComponent">();
	}
	static class UARObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARObjectComponent>();
	}
};
static_assert(alignof(UARObjectComponent) == 0x000010, "Wrong alignment on UARObjectComponent");
static_assert(sizeof(UARObjectComponent) == 0x0002B0, "Wrong size on UARObjectComponent");
static_assert(offsetof(UARObjectComponent, ReplicatedPayload) == 0x000280, "Member 'UARObjectComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARMeshComponent
// 0x0060 (0x02E0 - 0x0280)
class UARMeshComponent final : public UARComponent
{
public:
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FARMeshUpdatePayload                   ReplicatedPayload;                                 // 0x0280(0x0060)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void ReceiveAdd(const struct FARMeshUpdatePayload& Payload);
	void ReceiveUpdate(const struct FARMeshUpdatePayload& Payload);
	void ServerUpdatePayload(const struct FARMeshUpdatePayload& NewPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARMeshComponent">();
	}
	static class UARMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARMeshComponent>();
	}
};
static_assert(alignof(UARMeshComponent) == 0x000010, "Wrong alignment on UARMeshComponent");
static_assert(sizeof(UARMeshComponent) == 0x0002E0, "Wrong size on UARMeshComponent");
static_assert(offsetof(UARMeshComponent, ReplicatedPayload) == 0x000280, "Member 'UARMeshComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARGeoAnchorComponent
// 0x0070 (0x02F0 - 0x0280)
class UARGeoAnchorComponent final : public UARComponent
{
public:
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FARGeoAnchorUpdatePayload              ReplicatedPayload;                                 // 0x0280(0x0070)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	static void SetGeoAnchorComponentDebugMode(EGeoAnchorComponentDebugMode NewDebugMode);

	void ReceiveAdd(const struct FARGeoAnchorUpdatePayload& Payload);
	void ReceiveUpdate(const struct FARGeoAnchorUpdatePayload& Payload);
	void ServerUpdatePayload(const struct FARGeoAnchorUpdatePayload& NewPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARGeoAnchorComponent">();
	}
	static class UARGeoAnchorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARGeoAnchorComponent>();
	}
};
static_assert(alignof(UARGeoAnchorComponent) == 0x000010, "Wrong alignment on UARGeoAnchorComponent");
static_assert(sizeof(UARGeoAnchorComponent) == 0x0002F0, "Wrong size on UARGeoAnchorComponent");
static_assert(offsetof(UARGeoAnchorComponent, ReplicatedPayload) == 0x000280, "Member 'UARGeoAnchorComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARDependencyHandler
// 0x0000 (0x0028 - 0x0028)
class UARDependencyHandler final : public UObject
{
public:
	static class UARDependencyHandler* GetARDependencyHandler();

	void CheckARServiceAvailability(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, EARServiceAvailability* OutAvailability);
	void InstallARService(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, EARServiceInstallRequestResult* OutInstallResult);
	void RequestARSessionPermission(class UObject* WorldContextObject, class UARSessionConfig* SessionConfig, const struct FLatentActionInfo& LatentInfo, EARServicePermissionRequestResult* OutPermissionResult);
	void StartARSessionLatent(class UObject* WorldContextObject, class UARSessionConfig* SessionConfig, const struct FLatentActionInfo& LatentInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARDependencyHandler">();
	}
	static class UARDependencyHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARDependencyHandler>();
	}
};
static_assert(alignof(UARDependencyHandler) == 0x000008, "Wrong alignment on UARDependencyHandler");
static_assert(sizeof(UARDependencyHandler) == 0x000028, "Wrong size on UARDependencyHandler");

// Class AugmentedReality.ARGeoTrackingSupport
// 0x0000 (0x0028 - 0x0028)
class UARGeoTrackingSupport final : public UObject
{
public:
	static class UARGeoTrackingSupport* GetGeoTrackingSupport();

	bool AddGeoAnchorAtLocation(float Longitude, float Latitude, const class FString& OptionalAnchorName);
	bool AddGeoAnchorAtLocationWithAltitude(float Longitude, float Latitude, float AltitudeMeters, const class FString& OptionalAnchorName);

	EARGeoTrackingAccuracy GetGeoTrackingAccuracy() const;
	EARGeoTrackingState GetGeoTrackingState() const;
	EARGeoTrackingStateReason GetGeoTrackingStateReason() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARGeoTrackingSupport">();
	}
	static class UARGeoTrackingSupport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARGeoTrackingSupport>();
	}
};
static_assert(alignof(UARGeoTrackingSupport) == 0x000008, "Wrong alignment on UARGeoTrackingSupport");
static_assert(sizeof(UARGeoTrackingSupport) == 0x000028, "Wrong size on UARGeoTrackingSupport");

// Class AugmentedReality.CheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy
// 0x0050 (0x00A0 - 0x0050)
class UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy final : public UARBaseAsyncTaskBlueprintProxy
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailed;                                          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x30];                                      // 0x0070(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy* CheckGeoTrackingAvailability(class UObject* WorldContextObject);
	static class UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy* CheckGeoTrackingAvailabilityAtLocation(class UObject* WorldContextObject, float Longitude, float Latitude);

	void GeoTrackingAvailabilityDelegate__DelegateSignature(bool bIsAvailable, const class FString& Error);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy">();
	}
	static class UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy>();
	}
};
static_assert(alignof(UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy) == 0x000008, "Wrong alignment on UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy");
static_assert(sizeof(UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy) == 0x0000A0, "Wrong size on UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy");
static_assert(offsetof(UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy, OnSuccess) == 0x000050, "Member 'UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy, OnFailed) == 0x000060, "Member 'UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy::OnFailed' has a wrong offset!");

// Class AugmentedReality.GetGeoLocationAsyncTaskBlueprintProxy
// 0x0050 (0x00A0 - 0x0050)
class UGetGeoLocationAsyncTaskBlueprintProxy final : public UARBaseAsyncTaskBlueprintProxy
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailed;                                          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x30];                                      // 0x0070(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGetGeoLocationAsyncTaskBlueprintProxy* GetGeoLocationAtWorldPosition(class UObject* WorldContextObject, const struct FVector& WorldPosition);

	void GetGeoLocationDelegate__DelegateSignature(float Longitude, float Latitude, float Altitude, const class FString& Error);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GetGeoLocationAsyncTaskBlueprintProxy">();
	}
	static class UGetGeoLocationAsyncTaskBlueprintProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGetGeoLocationAsyncTaskBlueprintProxy>();
	}
};
static_assert(alignof(UGetGeoLocationAsyncTaskBlueprintProxy) == 0x000008, "Wrong alignment on UGetGeoLocationAsyncTaskBlueprintProxy");
static_assert(sizeof(UGetGeoLocationAsyncTaskBlueprintProxy) == 0x0000A0, "Wrong size on UGetGeoLocationAsyncTaskBlueprintProxy");
static_assert(offsetof(UGetGeoLocationAsyncTaskBlueprintProxy, OnSuccess) == 0x000050, "Member 'UGetGeoLocationAsyncTaskBlueprintProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UGetGeoLocationAsyncTaskBlueprintProxy, OnFailed) == 0x000060, "Member 'UGetGeoLocationAsyncTaskBlueprintProxy::OnFailed' has a wrong offset!");

// Class AugmentedReality.ARLifeCycleComponent
// 0x0030 (0x0230 - 0x0200)
class UARLifeCycleComponent final : public USceneComponent
{
public:
	FMulticastInlineDelegateProperty_             OnARActorSpawnedDelegate;                          // 0x01F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnARActorToBeDestroyedDelegate;                    // 0x0208(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_218[0x18];                                     // 0x0218(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InstanceARActorSpawnedDelegate__DelegateSignature(class UClass* ComponentClass, const struct FGuid& NativeID, class AARActor* SpawnedActor);
	void InstanceARActorToBeDestroyedDelegate__DelegateSignature(class AARActor* Actor);
	void ServerDestroyARActor(class AARActor* Actor);
	void ServerSpawnARActor(class UClass* ComponentClass, const struct FGuid& NativeID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARLifeCycleComponent">();
	}
	static class UARLifeCycleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARLifeCycleComponent>();
	}
};
static_assert(alignof(UARLifeCycleComponent) == 0x000010, "Wrong alignment on UARLifeCycleComponent");
static_assert(sizeof(UARLifeCycleComponent) == 0x000230, "Wrong size on UARLifeCycleComponent");
static_assert(offsetof(UARLifeCycleComponent, OnARActorSpawnedDelegate) == 0x0001F8, "Member 'UARLifeCycleComponent::OnARActorSpawnedDelegate' has a wrong offset!");
static_assert(offsetof(UARLifeCycleComponent, OnARActorToBeDestroyedDelegate) == 0x000208, "Member 'UARLifeCycleComponent::OnARActorToBeDestroyedDelegate' has a wrong offset!");

// Class AugmentedReality.ARLightEstimate
// 0x0000 (0x0028 - 0x0028)
class UARLightEstimate : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARLightEstimate">();
	}
	static class UARLightEstimate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARLightEstimate>();
	}
};
static_assert(alignof(UARLightEstimate) == 0x000008, "Wrong alignment on UARLightEstimate");
static_assert(sizeof(UARLightEstimate) == 0x000028, "Wrong size on UARLightEstimate");

// Class AugmentedReality.ARBasicLightEstimate
// 0x0018 (0x0040 - 0x0028)
class UARBasicLightEstimate final : public UARLightEstimate
{
public:
	float                                         AmbientIntensityLumens;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AmbientColorTemperatureKelvin;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           AmbientColor;                                      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FLinearColor GetAmbientColor() const;
	float GetAmbientColorTemperatureKelvin() const;
	float GetAmbientIntensityLumens() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARBasicLightEstimate">();
	}
	static class UARBasicLightEstimate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARBasicLightEstimate>();
	}
};
static_assert(alignof(UARBasicLightEstimate) == 0x000008, "Wrong alignment on UARBasicLightEstimate");
static_assert(sizeof(UARBasicLightEstimate) == 0x000040, "Wrong size on UARBasicLightEstimate");
static_assert(offsetof(UARBasicLightEstimate, AmbientIntensityLumens) == 0x000028, "Member 'UARBasicLightEstimate::AmbientIntensityLumens' has a wrong offset!");
static_assert(offsetof(UARBasicLightEstimate, AmbientColorTemperatureKelvin) == 0x00002C, "Member 'UARBasicLightEstimate::AmbientColorTemperatureKelvin' has a wrong offset!");
static_assert(offsetof(UARBasicLightEstimate, AmbientColor) == 0x000030, "Member 'UARBasicLightEstimate::AmbientColor' has a wrong offset!");

// Class AugmentedReality.AROriginActor
// 0x0000 (0x0220 - 0x0220)
class AAROriginActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AROriginActor">();
	}
	static class AAROriginActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAROriginActor>();
	}
};
static_assert(alignof(AAROriginActor) == 0x000008, "Wrong alignment on AAROriginActor");
static_assert(sizeof(AAROriginActor) == 0x000220, "Wrong size on AAROriginActor");

// Class AugmentedReality.ARPin
// 0x00C8 (0x00F0 - 0x0028)
class UARPin final : public UObject
{
public:
	class UARTrackedGeometry*                     TrackedGeometry;                                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        PinnedComponent;                                   // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalToTrackingTransform;                          // 0x0040(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FTransform                             LocalToAlignedTrackingTransform;                   // 0x0070(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	EARTrackingState                              TrackingState;                                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x1F];                                      // 0x00A1(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnARTrackingStateChanged;                          // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             OnARTransformUpdated;                              // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DebugDraw(class UWorld* World, const struct FLinearColor& Color, float Scale, float PersistForSeconds) const;
	class FName GetDebugName() const;
	struct FTransform GetLocalToTrackingTransform() const;
	struct FTransform GetLocalToWorldTransform() const;
	class USceneComponent* GetPinnedComponent() const;
	class UARTrackedGeometry* GetTrackedGeometry() const;
	EARTrackingState GetTrackingState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARPin">();
	}
	static class UARPin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARPin>();
	}
};
static_assert(alignof(UARPin) == 0x000010, "Wrong alignment on UARPin");
static_assert(sizeof(UARPin) == 0x0000F0, "Wrong size on UARPin");
static_assert(offsetof(UARPin, TrackedGeometry) == 0x000028, "Member 'UARPin::TrackedGeometry' has a wrong offset!");
static_assert(offsetof(UARPin, PinnedComponent) == 0x000030, "Member 'UARPin::PinnedComponent' has a wrong offset!");
static_assert(offsetof(UARPin, LocalToTrackingTransform) == 0x000040, "Member 'UARPin::LocalToTrackingTransform' has a wrong offset!");
static_assert(offsetof(UARPin, LocalToAlignedTrackingTransform) == 0x000070, "Member 'UARPin::LocalToAlignedTrackingTransform' has a wrong offset!");
static_assert(offsetof(UARPin, TrackingState) == 0x0000A0, "Member 'UARPin::TrackingState' has a wrong offset!");
static_assert(offsetof(UARPin, OnARTrackingStateChanged) == 0x0000C0, "Member 'UARPin::OnARTrackingStateChanged' has a wrong offset!");
static_assert(offsetof(UARPin, OnARTransformUpdated) == 0x0000D0, "Member 'UARPin::OnARTransformUpdated' has a wrong offset!");

// Class AugmentedReality.ARSessionConfig
// 0x00E0 (0x0110 - 0x0030)
class UARSessionConfig final : public UDataAsset
{
public:
	bool                                          bGenerateMeshDataFromTrackedGeometry;              // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateCollisionForMeshData;                     // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateNavMeshForMeshData;                       // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMeshDataForOcclusion;                          // 0x0033(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRenderMeshDataInWireframe;                        // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrackSceneObjects;                                // 0x0035(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePersonSegmentationForOcclusion;                // 0x0036(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSceneDepthForOcclusion;                        // 0x0037(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAutomaticImageScaleEstimation;                 // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseStandardOnboardingUX;                          // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EARWorldAlignment                             WorldAlignment;                                    // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARSessionType                                SessionType;                                       // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARPlaneDetectionMode                         PlaneDetectionMode;                                // 0x003C(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHorizontalPlaneDetection;                         // 0x003D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bVerticalPlaneDetection;                           // 0x003E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAutoFocus;                                  // 0x003F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARLightEstimationMode                        LightEstimationMode;                               // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARFrameSyncMode                              FrameSyncMode;                                     // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAutomaticCameraOverlay;                     // 0x0042(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAutomaticCameraTracking;                    // 0x0043(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bResetCameraTracking;                              // 0x0044(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bResetTrackedObjects;                              // 0x0045(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UARCandidateImage*>              CandidateImages;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         MaxNumSimultaneousImagesTracked;                   // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAREnvironmentCaptureProbeType                EnvironmentCaptureProbeType;                       // 0x005C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 WorldMapData;                                      // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class UARCandidateObject*>             CandidateObjects;                                  // 0x0070(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FARVideoFormat                         DesiredVideoFormat;                                // 0x0080(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseOptimalVideoFormat;                            // 0x008C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARFaceTrackingDirection                      FaceTrackingDirection;                             // 0x008D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARFaceTrackingUpdate                         FaceTrackingUpdate;                                // 0x008E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxNumberOfTrackedFaces;                           // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 SerializedARCandidateImageDatabase;                // 0x0098(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	EARSessionTrackingFeature                     EnabledSessionTrackingFeature;                     // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARSceneReconstruction                        SceneReconstructionMethod;                         // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UARPlaneComponent>          PlaneComponentClass;                               // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARPointComponent>          PointComponentClass;                               // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARFaceComponent>           FaceComponentClass;                                // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARImageComponent>          ImageComponentClass;                               // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARQRCodeComponent>         QRCodeComponentClass;                              // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARPoseComponent>           PoseComponentClass;                                // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAREnvironmentProbeComponent> EnvironmentProbeComponentClass;                    // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARObjectComponent>         ObjectComponentClass;                              // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARMeshComponent>           MeshComponentClass;                                // 0x00F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARGeoAnchorComponent>      GeoAnchorComponentClass;                           // 0x00F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     DefaultMeshMaterial;                               // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     DefaultWireframeMeshMaterial;                      // 0x0108(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void AddCandidateImage(class UARCandidateImage* NewCandidateImage);
	void AddCandidateObject(class UARCandidateObject* CandidateObject);
	void SetCandidateObjectList(const TArray<class UARCandidateObject*>& InCandidateObjects);
	void SetDesiredVideoFormat(const struct FARVideoFormat& NewFormat);
	void SetEnableAutoFocus(bool bNewValue);
	void SetFaceTrackingDirection(EARFaceTrackingDirection InDirection);
	void SetFaceTrackingUpdate(EARFaceTrackingUpdate InUpdate);
	void SetResetCameraTracking(bool bNewValue);
	void SetResetTrackedObjects(bool bNewValue);
	void SetSceneReconstructionMethod(EARSceneReconstruction InSceneReconstructionMethod);
	void SetSessionTrackingFeatureToEnable(EARSessionTrackingFeature InSessionTrackingFeature);
	void SetWorldMapData(const TArray<uint8>& WorldMapData_0);

	const TArray<class UARCandidateImage*> GetCandidateImageList() const;
	const TArray<class UARCandidateObject*> GetCandidateObjectList() const;
	struct FARVideoFormat GetDesiredVideoFormat() const;
	EARSessionTrackingFeature GetEnabledSessionTrackingFeature() const;
	EAREnvironmentCaptureProbeType GetEnvironmentCaptureProbeType() const;
	EARFaceTrackingDirection GetFaceTrackingDirection() const;
	EARFaceTrackingUpdate GetFaceTrackingUpdate() const;
	EARFrameSyncMode GetFrameSyncMode() const;
	EARLightEstimationMode GetLightEstimationMode() const;
	int32 GetMaxNumSimultaneousImagesTracked() const;
	EARPlaneDetectionMode GetPlaneDetectionMode() const;
	EARSceneReconstruction GetSceneReconstructionMethod() const;
	EARSessionType GetSessionType() const;
	EARWorldAlignment GetWorldAlignment() const;
	const TArray<uint8> GetWorldMapData() const;
	bool ShouldEnableAutoFocus() const;
	bool ShouldEnableCameraTracking() const;
	bool ShouldRenderCameraOverlay() const;
	bool ShouldResetCameraTracking() const;
	bool ShouldResetTrackedObjects() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ARSessionConfig">();
	}
	static class UARSessionConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARSessionConfig>();
	}
};
static_assert(alignof(UARSessionConfig) == 0x000008, "Wrong alignment on UARSessionConfig");
static_assert(sizeof(UARSessionConfig) == 0x000110, "Wrong size on UARSessionConfig");
static_assert(offsetof(UARSessionConfig, bGenerateMeshDataFromTrackedGeometry) == 0x000030, "Member 'UARSessionConfig::bGenerateMeshDataFromTrackedGeometry' has a wrong offset!");
static_assert(offsetof(UARSessionConfig, bGenerateCollisionForMeshData) == 0x000031, "Member 'UARSessionConfig::bGenerateCollisionForMeshData' has a wrong offset!");
