#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AppCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_MainCharaBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AppCharacter.BP_AppCharacter_C
// 0x0030 (0x0940 - 0x0910)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_AppCharacter_C : public ABP_MainCharaBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AppCharacter_C;                  // 0x0910(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAppCharFootstepsAtom*                  FootstepsAtom;                                     // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharacterSimpleLipsAnimAppComponent*   CharacterSimpleLipsAnimApp;                        // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharacterLipsyncAppComponent*          CharacterLipsyncApp;                               // 0x0928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAppCharacterComp*                      AppCharacterComp;                                  // 0x0930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AppCharacter(int32 EntryPoint);
	void UnlincPhysics_Event();
	void ResetIkDelegate_Event();
	void ReceiveBeginPlay();
	void ResetIK();
	void UnlinkPhysics();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AppCharacter_C">();
	}
	static class ABP_AppCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AppCharacter_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABP_AppCharacter_C) == 0x000010, "Wrong alignment on ABP_AppCharacter_C");
static_assert(sizeof(ABP_AppCharacter_C) == 0x000940, "Wrong size on ABP_AppCharacter_C");
static_assert(offsetof(ABP_AppCharacter_C, UberGraphFrame_BP_AppCharacter_C) == 0x000910, "Member 'ABP_AppCharacter_C::UberGraphFrame_BP_AppCharacter_C' has a wrong offset!");
static_assert(offsetof(ABP_AppCharacter_C, FootstepsAtom) == 0x000918, "Member 'ABP_AppCharacter_C::FootstepsAtom' has a wrong offset!");
static_assert(offsetof(ABP_AppCharacter_C, CharacterSimpleLipsAnimApp) == 0x000920, "Member 'ABP_AppCharacter_C::CharacterSimpleLipsAnimApp' has a wrong offset!");
static_assert(offsetof(ABP_AppCharacter_C, CharacterLipsyncApp) == 0x000928, "Member 'ABP_AppCharacter_C::CharacterLipsyncApp' has a wrong offset!");
static_assert(offsetof(ABP_AppCharacter_C, AppCharacterComp) == 0x000930, "Member 'ABP_AppCharacter_C::AppCharacterComp' has a wrong offset!");

}

