#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiNavigation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BtlGuiBaseActor_classes.hpp"
#include "Xrd777_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlGuiNavigation.BP_BtlGuiNavigation_C
// 0x0020 (0x0370 - 0x0350)
class ABP_BtlGuiNavigation_C final : public ABP_BtlGuiBaseActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BtlGuiNavigation_C;              // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBtlDataBaseComponent*                  BtlDataBase;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      TargetList;                                        // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_BtlGuiNavigation(int32 EntryPoint);
	void CompletedNavigation();
	void GuiActorStateInit(bool Flag, int32 Param);
	void GuiActorBeginPlay();
	void Completed();
	void StartSillhouetteAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlGuiNavigation_C">();
	}
	static class ABP_BtlGuiNavigation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlGuiNavigation_C>();
	}
};
static_assert(alignof(ABP_BtlGuiNavigation_C) == 0x000008, "Wrong alignment on ABP_BtlGuiNavigation_C");
static_assert(sizeof(ABP_BtlGuiNavigation_C) == 0x000370, "Wrong size on ABP_BtlGuiNavigation_C");
static_assert(offsetof(ABP_BtlGuiNavigation_C, UberGraphFrame_BP_BtlGuiNavigation_C) == 0x000350, "Member 'ABP_BtlGuiNavigation_C::UberGraphFrame_BP_BtlGuiNavigation_C' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiNavigation_C, BtlDataBase) == 0x000358, "Member 'ABP_BtlGuiNavigation_C::BtlDataBase' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiNavigation_C, TargetList) == 0x000360, "Member 'ABP_BtlGuiNavigation_C::TargetList' has a wrong offset!");

}

