#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlSimpleTextureDraw

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Xrd777_structs.hpp"
#include "Xrd777_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlSimpleTextureDraw.BP_BtlSimpleTextureDraw_C
// 0x0030 (0x02A8 - 0x0278)
class ABP_BtlSimpleTextureDraw_C final : public AAppActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBtlGuiDrawComponent*                   BtlGuiDraw;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectImage*                 Obj;                                               // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Texture;                                           // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EBtlGuiOT                                     OT;                                                // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BtlSimpleTextureDraw(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlSimpleTextureDraw_C">();
	}
	static class ABP_BtlSimpleTextureDraw_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlSimpleTextureDraw_C>();
	}
};
static_assert(alignof(ABP_BtlSimpleTextureDraw_C) == 0x000008, "Wrong alignment on ABP_BtlSimpleTextureDraw_C");
static_assert(sizeof(ABP_BtlSimpleTextureDraw_C) == 0x0002A8, "Wrong size on ABP_BtlSimpleTextureDraw_C");
static_assert(offsetof(ABP_BtlSimpleTextureDraw_C, UberGraphFrame) == 0x000278, "Member 'ABP_BtlSimpleTextureDraw_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BtlSimpleTextureDraw_C, BtlGuiDraw) == 0x000280, "Member 'ABP_BtlSimpleTextureDraw_C::BtlGuiDraw' has a wrong offset!");
static_assert(offsetof(ABP_BtlSimpleTextureDraw_C, DefaultSceneRoot) == 0x000288, "Member 'ABP_BtlSimpleTextureDraw_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BtlSimpleTextureDraw_C, Obj) == 0x000290, "Member 'ABP_BtlSimpleTextureDraw_C::Obj' has a wrong offset!");
static_assert(offsetof(ABP_BtlSimpleTextureDraw_C, Texture) == 0x000298, "Member 'ABP_BtlSimpleTextureDraw_C::Texture' has a wrong offset!");
static_assert(offsetof(ABP_BtlSimpleTextureDraw_C, OT) == 0x0002A0, "Member 'ABP_BtlSimpleTextureDraw_C::OT' has a wrong offset!");

}

