#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlUIColorModel

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlUIColorModel.BP_BtlUIColorModel_C.ExecuteUbergraph_BP_BtlUIColorModel
// 0x04B0 (0x04B0 - 0x0000)
struct BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    CallFunc_GetAppCharacterActor_Character;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0xA];                                       // 0x0066(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0070(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0100(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_BtlHumanBase_C*                     K2Node_DynamicCast_AsBP_Btl_Human_Base;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetID_ReturnValue;                        // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAppCharacterComp*                      CallFunc_GetAppCharacterComp_App_Character_Comp;   // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    CallFunc_GetAppCharacterActor_Character_1;         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCostumeID_ReturnValue;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexID_ReturnValue;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	EAppCharCategoryType                          CallFunc_GetCategoryID_ReturnValue;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AppKoromaru_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AppCharacter_C*                     CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default_1;                           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x0228(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UAppCharBaseComp*                       K2Node_Select_Default_2;                           // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Visible)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Visible)>                 K2Node_CreateDelegate_OutputDelegate_1;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default_3;                           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F6[0x2];                                      // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppCharBaseComp*                       K2Node_Select_Default_4;                           // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh_ReturnValue;                      // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAppCharBaseComp*                       K2Node_Select_Default_5;                           // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh_ReturnValue_1;                    // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_BtlUIColorHuman_C*                 K2Node_DynamicCast_AsABP_Btl_UIColor_Human;        // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_BtlUIColorAnimal_C*                K2Node_DynamicCast_AsABP_Btl_UIColor_Animal;       // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default_6;                           // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlSummonGun_C*                     K2Node_DynamicCast_AsBP_Btl_Summon_Gun;            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAppPropsCore*>                  CallFunc_GetShowActors_ShowActors;                 // 0x0368(0x0010)(ReferenceParm)
	class AAppPropsCore*                          CallFunc_Array_Get_Item;                           // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAppCharBaseComp*                       K2Node_Select_Default_7;                           // 0x0380(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCostumeChenged_ReturnValue;             // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterial_ReturnValue;                  // 0x0390(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCharacterID_ReturnValue;               // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x03CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x03CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_3;            // 0x03CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D3[0x5];                                      // 0x03D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       K2Node_Select_Default_8;                           // 0x03D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FD[0x3];                                      // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlHumanBase_C*                     K2Node_DynamicCast_AsBP_Btl_Human_Base_1;          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_SearchSkeletalMesh_ReturnValue;           // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetWeaponAttachSocketName_NewParam;       // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlSummonGun_C*                     K2Node_DynamicCast_AsBP_Btl_Summon_Gun_1;          // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppCharBaseComp*                       K2Node_Select_Default_9;                           // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAppCharWeaponBase*>             CallFunc_GetWeapons_ReturnValue;                   // 0x0440(0x0010)(ReferenceParm)
	class AAppCharWeaponBase*                     CallFunc_Array_Get_Item_3;                         // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterial_ReturnValue_1;                // 0x0460(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_4;                         // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x3];                                      // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_SkeletalMesh;             // 0x0498(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_SkeletalMesh_1;           // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel) == 0x000010, "Wrong alignment on BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel");
static_assert(sizeof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel) == 0x0004B0, "Wrong size on BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, EntryPoint) == 0x000000, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetAppCharacterActor_Character) == 0x000008, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetAppCharacterActor_Character' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_BreakVector_X) == 0x00001C, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_BreakVector_Y) == 0x000020, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_BreakVector_Z) == 0x000024, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_int_Loop_Counter_Variable_2) == 0x000048, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_int_Loop_Counter_Variable_3) == 0x000050, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Add_IntInt_ReturnValue_3) == 0x000054, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_int_Array_Index_Variable_2) == 0x000058, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_bool_Variable) == 0x00005C, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_Event_DeltaSeconds) == 0x000060, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_IsValid_ReturnValue) == 0x000064, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_bool_Variable_1) == 0x000065, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetTransform_ReturnValue) == 0x000070, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_BreakTransform_Rotation) == 0x0000AC, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_BreakTransform_Scale) == 0x0000B8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C4, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000100, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_AsBP_Btl_Human_Base) == 0x000188, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_AsBP_Btl_Human_Base' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetID_ReturnValue) == 0x000194, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_bool_Variable_2) == 0x000198, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000199, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_Select_Default) == 0x0001A0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetAppCharacterComp_App_Character_Comp) == 0x0001A8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetAppCharacterComp_App_Character_Comp' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetAppCharacterActor_Character_1) == 0x0001B0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetAppCharacterActor_Character_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetCostumeID_ReturnValue) == 0x0001B8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetCostumeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetIndexID_ReturnValue) == 0x0001BC, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetIndexID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetRelativeTransform_ReturnValue) == 0x0001C0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetCategoryID_ReturnValue) == 0x0001F0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetCategoryID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001F8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000200, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_FinishSpawningActor_ReturnValue) == 0x000208, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000210, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_bool_Variable_3) == 0x000218, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_Select_Default_1) == 0x000220, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x000228, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_Select_Default_2) == 0x0002B0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_CreateDelegate_OutputDelegate) == 0x0002B8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002C8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_int_Loop_Counter_Variable_4) == 0x0002D8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_Select_Default_3) == 0x0002E0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Add_IntInt_ReturnValue_4) == 0x0002E8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_IsValid_ReturnValue_1) == 0x0002EC, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_int_Array_Index_Variable_3) == 0x0002F0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_bool_Variable_4) == 0x0002F4, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_bool_Variable_5) == 0x0002F5, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_Select_Default_4) == 0x0002F8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetMesh_ReturnValue) == 0x000300, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_Select_Default_5) == 0x000308, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetMesh_ReturnValue_1) == 0x000310, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetAnimInstance_ReturnValue) == 0x000318, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_AsABP_Btl_UIColor_Human) == 0x000320, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_AsABP_Btl_UIColor_Human' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_bSuccess_1) == 0x000328, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000330, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_AsABP_Btl_UIColor_Animal) == 0x000338, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_AsABP_Btl_UIColor_Animal' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_bSuccess_2) == 0x000340, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_bool_Variable_6) == 0x000341, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_Select_Default_6) == 0x000348, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_int_Array_Index_Variable_4) == 0x000350, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_AsBP_Btl_Summon_Gun) == 0x000358, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_AsBP_Btl_Summon_Gun' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_bSuccess_3) == 0x000360, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_bool_Variable_7) == 0x000361, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetShowActors_ShowActors) == 0x000368, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetShowActors_ShowActors' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Array_Get_Item) == 0x000378, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_Select_Default_7) == 0x000380, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_IsCostumeChenged_ReturnValue) == 0x000388, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_IsCostumeChenged_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetMaterial_ReturnValue) == 0x000390, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Array_Get_Item_1) == 0x0003A0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Array_Length_ReturnValue) == 0x0003A8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0003B0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Less_IntInt_ReturnValue) == 0x0003B8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Array_Add_ReturnValue) == 0x0003BC, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Array_Length_ReturnValue_1) == 0x0003C0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003C4, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetCharacterID_ReturnValue) == 0x0003C8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0003CC, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0003CD, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x0003CE, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_NotEqual_IntInt_ReturnValue_3) == 0x0003CF, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_NotEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_bool_Variable_8) == 0x0003D0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_BooleanAND_ReturnValue) == 0x0003D1, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_BooleanAND_ReturnValue_1) == 0x0003D2, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_Select_Default_8) == 0x0003D8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_BooleanAND_ReturnValue_2) == 0x0003E8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Array_Get_Item_2) == 0x0003F0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Array_Length_ReturnValue_2) == 0x0003F8, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Less_IntInt_ReturnValue_2) == 0x0003FC, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_AsBP_Btl_Human_Base_1) == 0x000400, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_AsBP_Btl_Human_Base_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_bSuccess_4) == 0x000408, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_SearchSkeletalMesh_ReturnValue) == 0x000410, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_SearchSkeletalMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetWeaponAttachSocketName_NewParam) == 0x000418, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetWeaponAttachSocketName_NewParam' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, Temp_bool_Variable_9) == 0x000420, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_AsBP_Btl_Summon_Gun_1) == 0x000428, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_AsBP_Btl_Summon_Gun_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_bSuccess_5) == 0x000430, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_Select_Default_9) == 0x000438, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetWeapons_ReturnValue) == 0x000440, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetWeapons_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Array_Get_Item_3) == 0x000450, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Array_Length_ReturnValue_3) == 0x000458, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetMaterial_ReturnValue_1) == 0x000460, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Less_IntInt_ReturnValue_3) == 0x000470, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Array_Get_Item_4) == 0x000478, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000480, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, K2Node_DynamicCast_bSuccess_6) == 0x000488, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Array_Length_ReturnValue_4) == 0x00048C, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_Less_IntInt_ReturnValue_4) == 0x000490, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetSkeletalMesh_SkeletalMesh) == 0x000498, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetSkeletalMesh_SkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel, CallFunc_GetSkeletalMesh_SkeletalMesh_1) == 0x0004A0, "Member 'BP_BtlUIColorModel_C_ExecuteUbergraph_BP_BtlUIColorModel::CallFunc_GetSkeletalMesh_SkeletalMesh_1' has a wrong offset!");

// Function BP_BtlUIColorModel.BP_BtlUIColorModel_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlUIColorModel_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlUIColorModel_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BtlUIColorModel_C_ReceiveTick");
static_assert(sizeof(BP_BtlUIColorModel_C_ReceiveTick) == 0x000004, "Wrong size on BP_BtlUIColorModel_C_ReceiveTick");
static_assert(offsetof(BP_BtlUIColorModel_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BtlUIColorModel_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BtlUIColorModel.BP_BtlUIColorModel_C.SetWeaponVisible
// 0x0048 (0x0048 - 0x0000)
struct BP_BtlUIColorModel_C_SetWeaponVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppCharBaseComp*                       K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAppCharWeaponBase*>             CallFunc_GetWeapons_ReturnValue;                   // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppCharWeaponBase*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlUIColorModel_C_SetWeaponVisible) == 0x000008, "Wrong alignment on BP_BtlUIColorModel_C_SetWeaponVisible");
static_assert(sizeof(BP_BtlUIColorModel_C_SetWeaponVisible) == 0x000048, "Wrong size on BP_BtlUIColorModel_C_SetWeaponVisible");
