#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlTargetInfo

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlTargetInfo.BP_BtlTargetInfo_C.ExecuteUbergraph_BP_BtlTargetInfo
// 0x09F8 (0x09F8 - 0x0000)
struct BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState;                   // 0x0006(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_1;                 // 0x000E(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_2;                 // 0x0016(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_3;                 // 0x001E(0x0008)(NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_4;                 // 0x002C(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_5;                 // 0x0034(0x0008)(NoDestructor)
	float                                         Temp_float_Variable_1;                             // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_6;                 // 0x0040(0x0008)(NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_7;                 // 0x004C(0x0008)(NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_8;                 // 0x0058(0x0008)(NoDestructor)
	float                                         Temp_float_Variable_2;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_9;                 // 0x0064(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_10;                // 0x006C(0x0008)(NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_11;                // 0x0075(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_12;                // 0x007D(0x0008)(NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NoAnimation_1;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_upportAnime;                    // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_NoAnimation;                    // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNowSupport_NewParam;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetAllDrawItem_idAry;                     // 0x00F0(0x0010)(ReferenceParm)
	TArray<class UBtlGuiDrawObjectCore*>          CallFunc_GetAllDrawItem_objAry;                    // 0x0100(0x0010)(ReferenceParm)
	float                                         K2Node_Select_Default;                             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectCore*                  CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlpha_ReturnValue;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNowSupport_NewParam_1;                 // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_deltaTime;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SyncRewuestTutorial_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLayoutDebugMenuOpen_ReturnValue;        // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetTargetInfoTextCollision_ReturnValue;   // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetTargetInfoTextCollision_ReturnValue_1; // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_13;                // 0x0174(0x0008)(NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_14;                // 0x0184(0x0008)(NoDestructor)
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_15;                // 0x0190(0x0008)(NoDestructor)
	struct FColor                                 K2Node_MakeStruct_Color_1;                         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetGroupDrawItem_idAry;                   // 0x01A0(0x0010)(ReferenceParm)
	TArray<class UBtlGuiDrawObjectCore*>          CallFunc_GetGroupDrawItem_objAry;                  // 0x01B0(0x0010)(ReferenceParm)
	struct FColor                                 K2Node_MakeStruct_Color_2;                         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_3;                         // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_4;                         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x01CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x01D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetAllDrawItem_idAry_1;                   // 0x01E0(0x0010)(ReferenceParm)
	TArray<class UBtlGuiDrawObjectCore*>          CallFunc_GetAllDrawItem_objAry_1;                  // 0x01F0(0x0010)(ReferenceParm)
	class UBtlGuiDrawObjectCore*                  CallFunc_Array_Get_Item_2;                         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlpha_ReturnValue_1;                   // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPos_ReturnValue;                       // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_3;       // 0x022C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_5;                         // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_4;       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_6;                         // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_7;                         // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_8;                         // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_9;                         // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_5;       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_10;                        // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_11;                        // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_12;                        // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_13;                        // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_14;                        // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0274(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_6;       // 0x027C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_7;       // 0x0284(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_8;       // 0x028C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_9;       // 0x0294(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawText                        K2Node_MakeStruct_BtlGuiDrawText;                  // 0x02A0(0x0058)()
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_10;      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_15;                        // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawText_outID;                     // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectText*                  CallFunc_CreateDrawText_outItem;                   // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_16;                // 0x0310(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_17;                // 0x0318(0x0008)(NoDestructor)
	struct FColor                                 K2Node_MakeStruct_Color_16;                        // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_18;                // 0x0324(0x0008)(NoDestructor)
	struct FBtlGuiDrawPanel                       K2Node_MakeStruct_BtlGuiDrawPanel;                 // 0x032C(0x003C)(NoDestructor)
	class UPlgAsset*                              CallFunc_GetResources_OutResources;                // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USprAsset*                              CallFunc_GetResources_OutResources_1;              // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg;                   // 0x0378(0x0048)(NoDestructor)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite;                // 0x03C0(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawPlg_outID;                      // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem;                    // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID;                   // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem;                 // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_1;              // 0x0438(0x0050)(NoDestructor)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_2;              // 0x0488(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_1;                 // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_1;               // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID_2;                 // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_2;               // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_3;              // 0x0500(0x0050)(NoDestructor)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_4;              // 0x0550(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_3;                 // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_3;               // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID_4;                 // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_4;               // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_5;              // 0x05C8(0x0050)(NoDestructor)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_6;              // 0x0618(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_5;                 // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_5;               // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID_6;                 // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_6;               // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_8;                  // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_9;                  // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_7;              // 0x0690(0x0050)(NoDestructor)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_8;              // 0x06E0(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_7;                 // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_734[0x4];                                      // 0x0734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_7;               // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID_8;                 // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_8;               // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_10;                 // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_11;                 // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_9;              // 0x0758(0x0050)(NoDestructor)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_10;             // 0x07A8(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_9;                 // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FC[0x4];                                      // 0x07FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_9;               // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID_10;                // 0x0808(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80C[0x4];                                      // 0x080C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_10;              // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_12;                 // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_13;                 // 0x081C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_11;             // 0x0820(0x0050)(NoDestructor)
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg_1;                 // 0x0870(0x0048)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_11;                // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BC[0x4];                                      // 0x08BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_11;              // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawPlg_outID_1;                    // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CC[0x4];                                      // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem_1;                  // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_14;                 // 0x08D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DC[0x4];                                      // 0x08DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg_2;                 // 0x08E0(0x0048)(NoDestructor)
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg_3;                 // 0x0928(0x0048)(NoDestructor)
	int32                                         CallFunc_CreateDrawPlg_outID_2;                    // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_974[0x4];                                      // 0x0974(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem_2;                  // 0x0978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawPlg_outID_3;                    // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_984[0x4];                                      // 0x0984(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem_3;                  // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg_4;                 // 0x0990(0x0048)(NoDestructor)
	int32                                         CallFunc_CreateDrawPlg_outID_4;                    // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9DC[0x4];                                      // 0x09DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem_4;                  // 0x09E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawPanel_outID;                    // 0x09E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9EC[0x4];                                      // 0x09EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPanel*                 CallFunc_CreateDrawPanel_outItem;                  // 0x09F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo) == 0x000008, "Wrong alignment on BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo");
static_assert(sizeof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo) == 0x0009F8, "Wrong size on BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, EntryPoint) == 0x000000, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState) == 0x000006, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_1) == 0x00000E, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_2) == 0x000016, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_3) == 0x00001E, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_float_Variable) == 0x000028, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_4) == 0x00002C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_4' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_5) == 0x000034, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_5' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_float_Variable_1) == 0x00003C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_6) == 0x000040, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_6' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_7) == 0x00004C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_7' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_int_Array_Index_Variable_1) == 0x000054, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_8) == 0x000058, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_8' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_float_Variable_2) == 0x000060, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_9) == 0x000064, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_9' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_10) == 0x00006C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_10' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_bool_Variable) == 0x000074, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_11) == 0x000075, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_11' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_12) == 0x00007D, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_12' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_float_Variable_3) == 0x000088, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_int_Loop_Counter_Variable) == 0x00008C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_int_Array_Index_Variable_2) == 0x000094, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_int_Loop_Counter_Variable_1) == 0x000098, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x00009C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_int_Variable) == 0x0000A0, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A4, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000A8, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000B0, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_CustomEvent_NoAnimation_1) == 0x0000B4, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_CustomEvent_NoAnimation_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_CustomEvent_upportAnime) == 0x0000B5, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_CustomEvent_upportAnime' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_CustomEvent_NoAnimation) == 0x0000B6, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_CustomEvent_NoAnimation' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_int_Array_Index_Variable_3) == 0x0000B8, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_GetNowSupport_NewParam) == 0x0000BC, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_GetNowSupport_NewParam' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_int_Loop_Counter_Variable_2) == 0x0000C0, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_int_Loop_Counter_Variable_3) == 0x0000C4, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Add_IntInt_ReturnValue_5) == 0x0000C8, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Add_IntInt_ReturnValue_6) == 0x0000CC, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_int_Loop_Counter_Variable_4) == 0x0000D0, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Not_PreBool_ReturnValue) == 0x0000D4, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Add_IntInt_ReturnValue_7) == 0x0000D8, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_bool_Variable_1) == 0x0000DC, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, Temp_int_Array_Index_Variable_4) == 0x0000E0, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Less_IntInt_ReturnValue) == 0x0000EC, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000ED, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_GetAllDrawItem_idAry) == 0x0000F0, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_GetAllDrawItem_idAry' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_GetAllDrawItem_objAry) == 0x000100, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_GetAllDrawItem_objAry' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_Select_Default) == 0x000110, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Array_Get_Item) == 0x000118, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_GetAlpha_ReturnValue) == 0x000120, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_GetAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Array_Length_ReturnValue_2) == 0x000124, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Array_Add_ReturnValue) == 0x000128, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Less_IntInt_ReturnValue_2) == 0x00012C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_Select_Default_1) == 0x000130, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_GetNowSupport_NewParam_1) == 0x000134, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_GetNowSupport_NewParam_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Array_Get_Item_1) == 0x000135, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Array_Length_ReturnValue_3) == 0x000138, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Less_IntInt_ReturnValue_3) == 0x00013C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_VLerp_ReturnValue) == 0x000140, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x00014C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_Event_deltaTime) == 0x000154, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_Event_deltaTime' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_SyncRewuestTutorial_ReturnValue) == 0x000158, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_SyncRewuestTutorial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_IsLayoutDebugMenuOpen_ReturnValue) == 0x000159, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_IsLayoutDebugMenuOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_GetTargetInfoTextCollision_ReturnValue) == 0x00015C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_GetTargetInfoTextCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_GetTargetInfoTextCollision_ReturnValue_1) == 0x000164, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_GetTargetInfoTextCollision_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x00016C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_13) == 0x000174, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_13' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_BreakVector2D_X) == 0x00017C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_BreakVector2D_Y) == 0x000180, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_14) == 0x000184, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_14' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_Color) == 0x00018C, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_BtlBlendState_15) == 0x000190, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_BtlBlendState_15' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_Color_1) == 0x000198, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_Color_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_GetGroupDrawItem_idAry) == 0x0001A0, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_GetGroupDrawItem_idAry' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, CallFunc_GetGroupDrawItem_objAry) == 0x0001B0, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::CallFunc_GetGroupDrawItem_objAry' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_Color_2) == 0x0001C0, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_Color_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo, K2Node_MakeStruct_Color_3) == 0x0001C4, "Member 'BP_BtlTargetInfo_C_ExecuteUbergraph_BP_BtlTargetInfo::K2Node_MakeStruct_Color_3' has a wrong offset!");
