#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlSkillBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Xrd777_structs.hpp"
#include "Engine_structs.hpp"
#include "FBtlSkillRequest_structs.hpp"
#include "FBtlSkillControl_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlSkillBase.BP_BtlSkillBase_C.ExecuteUbergraph_BP_BtlSkillBase
// 0x01C0 (0x01C0 - 0x0000)
struct BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_BtlCharacterBase_C*>         CallFunc_GetTargets_CharaList;                     // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_BtlCharacterBase_C*>         CallFunc_GetTargets_CharaList_1;                   // 0x0028(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 CallFunc_GetEnchanter_Character;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlTargetManager_C*                 K2Node_CustomEvent_Target_Manager;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlEnvironment_C*                   K2Node_CustomEvent_BtlEnv;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBtlSkillControl                      CallFunc_Array_Get_Item;                           // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlTargetManager_C*                 K2Node_CustomEvent_TargetManager;                  // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFBtlSkillRequest                      CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0070)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0xC];                                      // 0x0124(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFBtlSkillRequest                      K2Node_SetFieldsInStruct_StructOut;                // 0x0130(0x0070)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcOnlyAbsorptionTime_ReturnValue;       // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase) == 0x000010, "Wrong alignment on BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase");
static_assert(sizeof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase) == 0x0001C0, "Wrong size on BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, EntryPoint) == 0x000000, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_GetTargets_CharaList) == 0x000010, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_GetTargets_CharaList' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_GetTargets_CharaList_1) == 0x000028, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_GetTargets_CharaList_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_GetEnchanter_Character) == 0x000048, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_GetEnchanter_Character' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, K2Node_CustomEvent_Target_Manager) == 0x000050, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::K2Node_CustomEvent_Target_Manager' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, K2Node_CustomEvent_BtlEnv) == 0x000058, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::K2Node_CustomEvent_BtlEnv' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, Temp_int_Array_Index_Variable) == 0x000060, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_GetSequencePlayer_ReturnValue) == 0x000068, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_Array_Get_Item) == 0x000074, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000080, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, K2Node_SwitchEnum_CmpSuccess) == 0x000081, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, K2Node_CustomEvent_TargetManager) == 0x000088, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::K2Node_CustomEvent_TargetManager' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A0, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, K2Node_SetFieldsInStruct_StructOut) == 0x000130, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001A0, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_IsValid_ReturnValue) == 0x0001A1, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_IsValid_ReturnValue_1) == 0x0001A2, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001A8, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_CalcOnlyAbsorptionTime_ReturnValue) == 0x0001B0, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_CalcOnlyAbsorptionTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0001B4, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0001B8, "Member 'BP_BtlSkillBase_C_ExecuteUbergraph_BP_BtlSkillBase::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

// Function BP_BtlSkillBase.BP_BtlSkillBase_C.On Skill Play For Test Mode
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlSkillBase_C_On_Skill_Play_For_Test_Mode final
{
public:
	class UBP_BtlTargetManager_C*                 TargetManager;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlSkillBase_C_On_Skill_Play_For_Test_Mode) == 0x000008, "Wrong alignment on BP_BtlSkillBase_C_On_Skill_Play_For_Test_Mode");
static_assert(sizeof(BP_BtlSkillBase_C_On_Skill_Play_For_Test_Mode) == 0x000008, "Wrong size on BP_BtlSkillBase_C_On_Skill_Play_For_Test_Mode");
static_assert(offsetof(BP_BtlSkillBase_C_On_Skill_Play_For_Test_Mode, TargetManager) == 0x000000, "Member 'BP_BtlSkillBase_C_On_Skill_Play_For_Test_Mode::TargetManager' has a wrong offset!");

// Function BP_BtlSkillBase.BP_BtlSkillBase_C.On Skill Play
// 0x0010 (0x0010 - 0x0000)
struct BP_BtlSkillBase_C_On_Skill_Play final
{
public:
	class UBP_BtlTargetManager_C*                 Target_Manager_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlEnvironment_C*                   BtlEnv;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlSkillBase_C_On_Skill_Play) == 0x000008, "Wrong alignment on BP_BtlSkillBase_C_On_Skill_Play");
static_assert(sizeof(BP_BtlSkillBase_C_On_Skill_Play) == 0x000010, "Wrong size on BP_BtlSkillBase_C_On_Skill_Play");
static_assert(offsetof(BP_BtlSkillBase_C_On_Skill_Play, Target_Manager_0) == 0x000000, "Member 'BP_BtlSkillBase_C_On_Skill_Play::Target_Manager_0' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_On_Skill_Play, BtlEnv) == 0x000008, "Member 'BP_BtlSkillBase_C_On_Skill_Play::BtlEnv' has a wrong offset!");

// Function BP_BtlSkillBase.BP_BtlSkillBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlSkillBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlSkillBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BtlSkillBase_C_ReceiveTick");
static_assert(sizeof(BP_BtlSkillBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_BtlSkillBase_C_ReceiveTick");
static_assert(offsetof(BP_BtlSkillBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BtlSkillBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BtlSkillBase.BP_BtlSkillBase_C.UserConstructionScript
// 0x0098 (0x0098 - 0x0000)
struct BP_BtlSkillBase_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBtlSkillControl                      Temp_struct_Variable;                              // 0x000C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBtlSkillControl                      Temp_struct_Variable_1;                            // 0x0018(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraCameraAttachComponent*          K2Node_DynamicCast_AsNiagara_Camera_Attach_Component; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlSkillBase_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_BtlSkillBase_C_UserConstructionScript");
static_assert(sizeof(BP_BtlSkillBase_C_UserConstructionScript) == 0x000098, "Wrong size on BP_BtlSkillBase_C_UserConstructionScript");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_BtlSkillBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_BtlSkillBase_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, Temp_struct_Variable) == 0x00000C, "Member 'BP_BtlSkillBase_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, Temp_struct_Variable_1) == 0x000018, "Member 'BP_BtlSkillBase_C_UserConstructionScript::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_GetChildrenComponents_Children) == 0x000028, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x00003C, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_CreateLevelSequencePlayer_OutActor) == 0x000048, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_CreateLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_CreateLevelSequencePlayer_ReturnValue) == 0x000050, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_CreateLevelSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, Temp_int_Array_Index_Variable_1) == 0x000058, "Member 'BP_BtlSkillBase_C_UserConstructionScript::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_1) == 0x000068, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, K2Node_DynamicCast_AsNiagara_Camera_Attach_Component) == 0x000070, "Member 'BP_BtlSkillBase_C_UserConstructionScript::K2Node_DynamicCast_AsNiagara_Camera_Attach_Component' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_BtlSkillBase_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_GetObjectClass_ReturnValue) == 0x000080, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x000088, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_1) == 0x00008C, "Member 'BP_BtlSkillBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'BP_BtlSkillBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_BtlSkillBase.BP_BtlSkillBase_C.Request VFX to Targets
// 0x01A0 (0x01A0 - 0x0000)
struct BP_BtlSkillBase_C_Request_VFX_to_Targets final
{
public:
	struct FBtlSkillParam                         Skill_Paramater;                                   // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	TArray<class ABtlActor*>                      Targets;                                           // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0050(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         WaitTime;                                          // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcLocation_Location;                    // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_CalcLocation_Rotation;                    // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FFBtlSkillRequest                      Temp_struct_Variable;                              // 0x0120(0x0070)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlSkillBase_C_Request_VFX_to_Targets) == 0x000010, "Wrong alignment on BP_BtlSkillBase_C_Request_VFX_to_Targets");
static_assert(sizeof(BP_BtlSkillBase_C_Request_VFX_to_Targets) == 0x0001A0, "Wrong size on BP_BtlSkillBase_C_Request_VFX_to_Targets");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, Skill_Paramater) == 0x000000, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::Skill_Paramater' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, Targets) == 0x000038, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::Targets' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, Transform) == 0x000050, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::Transform' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, WaitTime) == 0x000080, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::WaitTime' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_Array_Length_ReturnValue_1) == 0x000094, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_Greater_IntInt_ReturnValue) == 0x000098, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_MakeVector_ReturnValue) == 0x00009C, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, Temp_int_Array_Index_Variable) == 0x0000A8, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000B8, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, K2Node_MakeArray_Array) == 0x0000C0, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D0, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_CalcLocation_Location) == 0x0000D4, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_CalcLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_CalcLocation_Rotation) == 0x0000E0, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_CalcLocation_Rotation' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000EC, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, Temp_struct_Variable) == 0x000120, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Targets, CallFunc_Array_Add_ReturnValue) == 0x000190, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Targets::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_BtlSkillBase.BP_BtlSkillBase_C.Request VFX to Enchanter
// 0x0050 (0x0050 - 0x0000)
struct BP_BtlSkillBase_C_Request_VFX_to_Enchanter final
{
public:
	struct FBtlSkillParam                         SkillParameter;                                    // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class ABtlActor*                              Enchanter;                                         // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_BtlSkillBase_C_Request_VFX_to_Enchanter) == 0x000008, "Wrong alignment on BP_BtlSkillBase_C_Request_VFX_to_Enchanter");
static_assert(sizeof(BP_BtlSkillBase_C_Request_VFX_to_Enchanter) == 0x000050, "Wrong size on BP_BtlSkillBase_C_Request_VFX_to_Enchanter");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Enchanter, SkillParameter) == 0x000000, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Enchanter::SkillParameter' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Enchanter, Enchanter) == 0x000038, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Enchanter::Enchanter' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_Enchanter, K2Node_MakeArray_Array) == 0x000040, "Member 'BP_BtlSkillBase_C_Request_VFX_to_Enchanter::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_BtlSkillBase.BP_BtlSkillBase_C.MonitorRequests
// 0x0150 (0x0150 - 0x0000)
struct BP_BtlSkillBase_C_MonitorRequests final
{
public:
	float                                         CamPower;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBtlSkillRequest                      CallFunc_Array_Get_Item;                           // 0x0080(0x0070)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlSkillBase_C_MonitorRequests) == 0x000010, "Wrong alignment on BP_BtlSkillBase_C_MonitorRequests");
static_assert(sizeof(BP_BtlSkillBase_C_MonitorRequests) == 0x000150, "Wrong size on BP_BtlSkillBase_C_MonitorRequests");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CamPower) == 0x000000, "Member 'BP_BtlSkillBase_C_MonitorRequests::CamPower' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_BtlSkillBase_C_MonitorRequests::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_BreakTransform_Location) == 0x000054, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_BreakTransform_Rotation) == 0x000060, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_BreakTransform_Scale) == 0x00006C, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, Temp_int_Array_Index_Variable) == 0x000078, "Member 'BP_BtlSkillBase_C_MonitorRequests::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_Less_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000F1, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_IsValid_ReturnValue) == 0x0000F2, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_BreakTransform_Location_1) == 0x0000F4, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_BreakTransform_Rotation_1) == 0x000100, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_BreakTransform_Scale_1) == 0x00010C, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000118, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000120, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000128, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000138, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_VSize_ReturnValue) == 0x000140, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000144, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_MonitorRequests, CallFunc_FClamp_ReturnValue) == 0x000148, "Member 'BP_BtlSkillBase_C_MonitorRequests::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_BtlSkillBase.BP_BtlSkillBase_C.RefleshRequests
// 0x0090 (0x0090 - 0x0000)
struct BP_BtlSkillBase_C_RefleshRequests final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBtlSkillRequest                      CallFunc_Array_Get_Item;                           // 0x0010(0x0070)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlSkillBase_C_RefleshRequests) == 0x000010, "Wrong alignment on BP_BtlSkillBase_C_RefleshRequests");
static_assert(sizeof(BP_BtlSkillBase_C_RefleshRequests) == 0x000090, "Wrong size on BP_BtlSkillBase_C_RefleshRequests");
static_assert(offsetof(BP_BtlSkillBase_C_RefleshRequests, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_BtlSkillBase_C_RefleshRequests::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_RefleshRequests, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_BtlSkillBase_C_RefleshRequests::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_RefleshRequests, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_BtlSkillBase_C_RefleshRequests::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_RefleshRequests, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_BtlSkillBase_C_RefleshRequests::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_RefleshRequests, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_BtlSkillBase_C_RefleshRequests::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_RefleshRequests, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'BP_BtlSkillBase_C_RefleshRequests::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_RefleshRequests, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000084, "Member 'BP_BtlSkillBase_C_RefleshRequests::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_BtlSkillBase.BP_BtlSkillBase_C.Request VFX to field
// 0x0100 (0x0100 - 0x0000)
struct BP_BtlSkillBase_C_Request_VFX_to_field final
{
public:
	struct FBtlSkillParam                         SkillParameter;                                    // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UBtlTargetsManagerComponent*            TargetsPackage;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBtlSkillRequest                      Temp_struct_Variable;                              // 0x0040(0x0070)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlSkillBase_C_Request_VFX_to_field) == 0x000010, "Wrong alignment on BP_BtlSkillBase_C_Request_VFX_to_field");
static_assert(sizeof(BP_BtlSkillBase_C_Request_VFX_to_field) == 0x000100, "Wrong size on BP_BtlSkillBase_C_Request_VFX_to_field");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_field, SkillParameter) == 0x000000, "Member 'BP_BtlSkillBase_C_Request_VFX_to_field::SkillParameter' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_field, TargetsPackage) == 0x000038, "Member 'BP_BtlSkillBase_C_Request_VFX_to_field::TargetsPackage' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_field, Temp_struct_Variable) == 0x000040, "Member 'BP_BtlSkillBase_C_Request_VFX_to_field::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_field, CallFunc_MakeVector_ReturnValue) == 0x0000B0, "Member 'BP_BtlSkillBase_C_Request_VFX_to_field::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_field, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'BP_BtlSkillBase_C_Request_VFX_to_field::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_field, CallFunc_Array_Add_ReturnValue) == 0x0000F0, "Member 'BP_BtlSkillBase_C_Request_VFX_to_field::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_field, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000F4, "Member 'BP_BtlSkillBase_C_Request_VFX_to_field::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_field, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F8, "Member 'BP_BtlSkillBase_C_Request_VFX_to_field::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlSkillBase_C_Request_VFX_to_field, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000FC, "Member 'BP_BtlSkillBase_C_Request_VFX_to_field::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_BtlSkillBase.BP_BtlSkillBase_C.CalcLocation
// 0x03A0 (0x03A0 - 0x0000)
struct BP_BtlSkillBase_C_CalcLocation final
{
public:
	TArray<class ABtlActor*>                      Btl_Actor;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EBtlSkillTargetType                           Target_Type;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlSkillPositionTargetType                   Position_Type;                                     // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlSkillPositionHeightType                   Position_Height_Type;                              // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlSkillDirectionTargetType                  Direction;                                         // 0x0013(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
