#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlEncountAssistant

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlEncountAssistant.BP_BtlEncountAssistant_C.ExecuteUbergraph_BP_BtlEncountAssistant
// 0x00C0 (0x00C0 - 0x0000)
struct BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABtlActor*                              CallFunc_GetHero_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BtlCharacterContactor_C> K2Node_DynamicCast_AsBPI_Btl_Character_Contactor;  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlCoreComponent*                      K2Node_CustomEvent_BtlCore_2;                      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlCoreComponent*                      K2Node_CustomEvent_BtlCore_1;                      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlCoreComponent*                      K2Node_CustomEvent_BtlCore;                        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CueID;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings; // 0x0044(0x0014)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetEndTime_ReturnValue;                   // 0x0078(0x0010)(NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetStartTime_ReturnValue;                 // 0x0088(0x0010)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEnemyLoadFinished_ReturnValue;       // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant) == 0x000008, "Wrong alignment on BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant");
static_assert(sizeof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant) == 0x0000C0, "Wrong size on BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, EntryPoint) == 0x000000, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_IsValid_ReturnValue_2) == 0x000007, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_GetHero_ReturnValue) == 0x000008, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_GetHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, K2Node_DynamicCast_AsBPI_Btl_Character_Contactor) == 0x000010, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::K2Node_DynamicCast_AsBPI_Btl_Character_Contactor' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_IsValid_ReturnValue_3) == 0x000021, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, K2Node_CustomEvent_BtlCore_2) == 0x000028, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::K2Node_CustomEvent_BtlCore_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, K2Node_CustomEvent_BtlCore_1) == 0x000030, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::K2Node_CustomEvent_BtlCore_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, K2Node_CustomEvent_BtlCore) == 0x000038, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::K2Node_CustomEvent_BtlCore' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, K2Node_CustomEvent_CueID) == 0x000040, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::K2Node_CustomEvent_CueID' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, K2Node_MakeStruct_MovieSceneSequencePlaybackSettings) == 0x000044, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::K2Node_MakeStruct_MovieSceneSequencePlaybackSettings' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_CreateLevelSequencePlayer_OutActor) == 0x000068, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_CreateLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_CreateLevelSequencePlayer_ReturnValue) == 0x000070, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_CreateLevelSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_GetEndTime_ReturnValue) == 0x000078, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_GetStartTime_ReturnValue) == 0x000088, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue) == 0x000098, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1) == 0x00009C, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A0, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000A8, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, Temp_bool_IsClosed_Variable) == 0x0000B1, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_BooleanOR_ReturnValue) == 0x0000B3, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_CheckEnemyLoadFinished_ReturnValue) == 0x0000B4, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_CheckEnemyLoadFinished_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B8, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant, CallFunc_IsValid_ReturnValue_4) == 0x0000BC, "Member 'BP_BtlEncountAssistant_C_ExecuteUbergraph_BP_BtlEncountAssistant::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function BP_BtlEncountAssistant.BP_BtlEncountAssistant_C.PlaySE
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlEncountAssistant_C_PlaySE final
{
public:
	int32                                         CueId;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEncountAssistant_C_PlaySE) == 0x000004, "Wrong alignment on BP_BtlEncountAssistant_C_PlaySE");
static_assert(sizeof(BP_BtlEncountAssistant_C_PlaySE) == 0x000004, "Wrong size on BP_BtlEncountAssistant_C_PlaySE");
static_assert(offsetof(BP_BtlEncountAssistant_C_PlaySE, CueId) == 0x000000, "Member 'BP_BtlEncountAssistant_C_PlaySE::CueId' has a wrong offset!");

// Function BP_BtlEncountAssistant.BP_BtlEncountAssistant_C.StartChanceSequence
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlEncountAssistant_C_StartChanceSequence final
{
public:
	class UBtlCoreComponent*                      BtlCore_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEncountAssistant_C_StartChanceSequence) == 0x000008, "Wrong alignment on BP_BtlEncountAssistant_C_StartChanceSequence");
static_assert(sizeof(BP_BtlEncountAssistant_C_StartChanceSequence) == 0x000008, "Wrong size on BP_BtlEncountAssistant_C_StartChanceSequence");
static_assert(offsetof(BP_BtlEncountAssistant_C_StartChanceSequence, BtlCore_0) == 0x000000, "Member 'BP_BtlEncountAssistant_C_StartChanceSequence::BtlCore_0' has a wrong offset!");

// Function BP_BtlEncountAssistant.BP_BtlEncountAssistant_C.StartFirstSequence
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlEncountAssistant_C_StartFirstSequence final
{
public:
	class UBtlCoreComponent*                      BtlCore_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEncountAssistant_C_StartFirstSequence) == 0x000008, "Wrong alignment on BP_BtlEncountAssistant_C_StartFirstSequence");
static_assert(sizeof(BP_BtlEncountAssistant_C_StartFirstSequence) == 0x000008, "Wrong size on BP_BtlEncountAssistant_C_StartFirstSequence");
static_assert(offsetof(BP_BtlEncountAssistant_C_StartFirstSequence, BtlCore_0) == 0x000000, "Member 'BP_BtlEncountAssistant_C_StartFirstSequence::BtlCore_0' has a wrong offset!");

// Function BP_BtlEncountAssistant.BP_BtlEncountAssistant_C.StartSequence
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlEncountAssistant_C_StartSequence final
{
public:
	class UBtlCoreComponent*                      BtlCore_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEncountAssistant_C_StartSequence) == 0x000008, "Wrong alignment on BP_BtlEncountAssistant_C_StartSequence");
static_assert(sizeof(BP_BtlEncountAssistant_C_StartSequence) == 0x000008, "Wrong size on BP_BtlEncountAssistant_C_StartSequence");
static_assert(offsetof(BP_BtlEncountAssistant_C_StartSequence, BtlCore_0) == 0x000000, "Member 'BP_BtlEncountAssistant_C_StartSequence::BtlCore_0' has a wrong offset!");

// Function BP_BtlEncountAssistant.BP_BtlEncountAssistant_C.CollectWhenBattleCamera
// 0x0030 (0x0030 - 0x0000)
struct BP_BtlEncountAssistant_C_CollectWhenBattleCamera final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera) == 0x000008, "Wrong alignment on BP_BtlEncountAssistant_C_CollectWhenBattleCamera");
static_assert(sizeof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera) == 0x000030, "Wrong size on BP_BtlEncountAssistant_C_CollectWhenBattleCamera");
static_assert(offsetof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_BtlEncountAssistant_C_CollectWhenBattleCamera::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_BtlEncountAssistant_C_CollectWhenBattleCamera::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_BtlEncountAssistant_C_CollectWhenBattleCamera::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_BtlEncountAssistant_C_CollectWhenBattleCamera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera, CallFunc_GetViewTarget_ReturnValue) == 0x000018, "Member 'BP_BtlEncountAssistant_C_CollectWhenBattleCamera::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_BtlEncountAssistant_C_CollectWhenBattleCamera::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_BtlEncountAssistant_C_CollectWhenBattleCamera::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00002C, "Member 'BP_BtlEncountAssistant_C_CollectWhenBattleCamera::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'BP_BtlEncountAssistant_C_CollectWhenBattleCamera::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00002E, "Member 'BP_BtlEncountAssistant_C_CollectWhenBattleCamera::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_CollectWhenBattleCamera, CallFunc_BooleanOR_ReturnValue) == 0x00002F, "Member 'BP_BtlEncountAssistant_C_CollectWhenBattleCamera::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_BtlEncountAssistant.BP_BtlEncountAssistant_C.ReflectBattleCamera
// 0x0010 (0x0010 - 0x0000)
struct BP_BtlEncountAssistant_C_ReflectBattleCamera final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlEncountAssistant_C_ReflectBattleCamera) == 0x000008, "Wrong alignment on BP_BtlEncountAssistant_C_ReflectBattleCamera");
static_assert(sizeof(BP_BtlEncountAssistant_C_ReflectBattleCamera) == 0x000010, "Wrong size on BP_BtlEncountAssistant_C_ReflectBattleCamera");
static_assert(offsetof(BP_BtlEncountAssistant_C_ReflectBattleCamera, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_BtlEncountAssistant_C_ReflectBattleCamera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEncountAssistant_C_ReflectBattleCamera, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_BtlEncountAssistant_C_ReflectBattleCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

