#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiEncountAlert

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_BtlGuiBaseActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlGuiEncountAlert.BP_BtlGuiEncountAlert_C
// 0x0060 (0x03B0 - 0x0350)
class ABP_BtlGuiEncountAlert_C final : public ABP_BtlGuiBaseActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BtlGuiEncountAlert_C;            // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBtlGuiResources*                       BtlGuiResources;                                   // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawComponent*                   BtlGuiDraw;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EncountTimeline_pos_2480F7FC401336A032F69CBD6AA3DC09; // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EncountTimeline_Alpha_2480F7FC401336A032F69CBD6AA3DC09; // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EncountTimeline_Scale_2480F7FC401336A032F69CBD6AA3DC09; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EncountTimeline__Direction_2480F7FC401336A032F69CBD6AA3DC09; // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EncountTimeline;                                   // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectImage*                 Image;                                             // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerAdvantage;                                   // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Pos;                                               // 0x0394(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LifeTime;                                          // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha;                                             // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BtlGuiEncountAlert(int32 EntryPoint);
	void GuiActorUpdate(float DeltaTime);
	void GuiActorBeginPlay();
	void EncountTimeline__UpdateFunc();
	void EncountTimeline__FinishedFunc();
	void SetParam(bool PlayerAdvantage_0, float LifeTime_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlGuiEncountAlert_C">();
	}
	static class ABP_BtlGuiEncountAlert_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlGuiEncountAlert_C>();
	}
};
static_assert(alignof(ABP_BtlGuiEncountAlert_C) == 0x000008, "Wrong alignment on ABP_BtlGuiEncountAlert_C");
static_assert(sizeof(ABP_BtlGuiEncountAlert_C) == 0x0003B0, "Wrong size on ABP_BtlGuiEncountAlert_C");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, UberGraphFrame_BP_BtlGuiEncountAlert_C) == 0x000350, "Member 'ABP_BtlGuiEncountAlert_C::UberGraphFrame_BP_BtlGuiEncountAlert_C' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, BtlGuiResources) == 0x000358, "Member 'ABP_BtlGuiEncountAlert_C::BtlGuiResources' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, BtlGuiDraw) == 0x000360, "Member 'ABP_BtlGuiEncountAlert_C::BtlGuiDraw' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, EncountTimeline_pos_2480F7FC401336A032F69CBD6AA3DC09) == 0x000368, "Member 'ABP_BtlGuiEncountAlert_C::EncountTimeline_pos_2480F7FC401336A032F69CBD6AA3DC09' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, EncountTimeline_Alpha_2480F7FC401336A032F69CBD6AA3DC09) == 0x000374, "Member 'ABP_BtlGuiEncountAlert_C::EncountTimeline_Alpha_2480F7FC401336A032F69CBD6AA3DC09' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, EncountTimeline_Scale_2480F7FC401336A032F69CBD6AA3DC09) == 0x000378, "Member 'ABP_BtlGuiEncountAlert_C::EncountTimeline_Scale_2480F7FC401336A032F69CBD6AA3DC09' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, EncountTimeline__Direction_2480F7FC401336A032F69CBD6AA3DC09) == 0x00037C, "Member 'ABP_BtlGuiEncountAlert_C::EncountTimeline__Direction_2480F7FC401336A032F69CBD6AA3DC09' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, EncountTimeline) == 0x000380, "Member 'ABP_BtlGuiEncountAlert_C::EncountTimeline' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, Image) == 0x000388, "Member 'ABP_BtlGuiEncountAlert_C::Image' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, PlayerAdvantage) == 0x000390, "Member 'ABP_BtlGuiEncountAlert_C::PlayerAdvantage' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, Pos) == 0x000394, "Member 'ABP_BtlGuiEncountAlert_C::Pos' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, LifeTime) == 0x0003A0, "Member 'ABP_BtlGuiEncountAlert_C::LifeTime' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, Scale) == 0x0003A4, "Member 'ABP_BtlGuiEncountAlert_C::Scale' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiEncountAlert_C, Alpha) == 0x0003A8, "Member 'ABP_BtlGuiEncountAlert_C::Alpha' has a wrong offset!");

}

