#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlCharacterTidy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Xrd777_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlCharacterTidy.BP_BtlCharacterTidy_C
// 0x0018 (0x00E0 - 0x00C8)
class UBP_BtlCharacterTidy_C final : public UAppActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveVector*                           CRV_CharaTargetShake;                              // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShake;                                           // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShakeTime;                                         // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BtlCharacterTidy(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void StartTargetShake();
	void GetTargetShakePos(struct FVector* Positon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlCharacterTidy_C">();
	}
	static class UBP_BtlCharacterTidy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BtlCharacterTidy_C>();
	}
};
static_assert(alignof(UBP_BtlCharacterTidy_C) == 0x000008, "Wrong alignment on UBP_BtlCharacterTidy_C");
static_assert(sizeof(UBP_BtlCharacterTidy_C) == 0x0000E0, "Wrong size on UBP_BtlCharacterTidy_C");
static_assert(offsetof(UBP_BtlCharacterTidy_C, UberGraphFrame) == 0x0000C8, "Member 'UBP_BtlCharacterTidy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BtlCharacterTidy_C, CRV_CharaTargetShake) == 0x0000D0, "Member 'UBP_BtlCharacterTidy_C::CRV_CharaTargetShake' has a wrong offset!");
static_assert(offsetof(UBP_BtlCharacterTidy_C, IsShake) == 0x0000D8, "Member 'UBP_BtlCharacterTidy_C::IsShake' has a wrong offset!");
static_assert(offsetof(UBP_BtlCharacterTidy_C, ShakeTime) == 0x0000DC, "Member 'UBP_BtlCharacterTidy_C::ShakeTime' has a wrong offset!");

}

