#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlSummonGun

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BtlSummonGun.BP_BtlSummonGun_C.ExecuteUbergraph_BP_BtlSummonGun
// 0x0028 (0x0028 - 0x0000)
struct BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Pp0901_030_C*                       K2Node_DynamicCast_AsBP_Pp_0901_030;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Pp0901_000_C*                       K2Node_DynamicCast_AsBP_Pp_0901_000;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun) == 0x000008, "Wrong alignment on BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun");
static_assert(sizeof(BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun) == 0x000028, "Wrong size on BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun");
static_assert(offsetof(BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun, EntryPoint) == 0x000000, "Member 'BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun, K2Node_DynamicCast_AsBP_Pp_0901_030) == 0x000008, "Member 'BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun::K2Node_DynamicCast_AsBP_Pp_0901_030' has a wrong offset!");
static_assert(offsetof(BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun, K2Node_DynamicCast_AsBP_Pp_0901_000) == 0x000018, "Member 'BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun::K2Node_DynamicCast_AsBP_Pp_0901_000' has a wrong offset!");
static_assert(offsetof(BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'BP_BtlSummonGun_C_ExecuteUbergraph_BP_BtlSummonGun::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_BtlSummonGun.BP_BtlSummonGun_C.SetVisible
// 0x0001 (0x0001 - 0x0000)
struct BP_BtlSummonGun_C_SetVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlSummonGun_C_SetVisible) == 0x000001, "Wrong alignment on BP_BtlSummonGun_C_SetVisible");
static_assert(sizeof(BP_BtlSummonGun_C_SetVisible) == 0x000001, "Wrong size on BP_BtlSummonGun_C_SetVisible");
static_assert(offsetof(BP_BtlSummonGun_C_SetVisible, Visible) == 0x000000, "Member 'BP_BtlSummonGun_C_SetVisible::Visible' has a wrong offset!");

// Function BP_BtlSummonGun.BP_BtlSummonGun_C.SetTheurgiaMode
// 0x0002 (0x0002 - 0x0000)
struct BP_BtlSummonGun_C_SetTheurgiaMode final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ForceToTurnEnd;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlSummonGun_C_SetTheurgiaMode) == 0x000001, "Wrong alignment on BP_BtlSummonGun_C_SetTheurgiaMode");
static_assert(sizeof(BP_BtlSummonGun_C_SetTheurgiaMode) == 0x000002, "Wrong size on BP_BtlSummonGun_C_SetTheurgiaMode");
static_assert(offsetof(BP_BtlSummonGun_C_SetTheurgiaMode, Enable) == 0x000000, "Member 'BP_BtlSummonGun_C_SetTheurgiaMode::Enable' has a wrong offset!");
static_assert(offsetof(BP_BtlSummonGun_C_SetTheurgiaMode, ForceToTurnEnd) == 0x000001, "Member 'BP_BtlSummonGun_C_SetTheurgiaMode::ForceToTurnEnd' has a wrong offset!");

// Function BP_BtlSummonGun.BP_BtlSummonGun_C.SetGunVisible
// 0x0010 (0x0010 - 0x0000)
struct BP_BtlSummonGun_C_SetGunVisible final
{
public:
	class AAppPropsCore*                          Gun;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlSummonGun_C_SetGunVisible) == 0x000008, "Wrong alignment on BP_BtlSummonGun_C_SetGunVisible");
static_assert(sizeof(BP_BtlSummonGun_C_SetGunVisible) == 0x000010, "Wrong size on BP_BtlSummonGun_C_SetGunVisible");
static_assert(offsetof(BP_BtlSummonGun_C_SetGunVisible, Gun) == 0x000000, "Member 'BP_BtlSummonGun_C_SetGunVisible::Gun' has a wrong offset!");
static_assert(offsetof(BP_BtlSummonGun_C_SetGunVisible, Visible) == 0x000008, "Member 'BP_BtlSummonGun_C_SetGunVisible::Visible' has a wrong offset!");
static_assert(offsetof(BP_BtlSummonGun_C_SetGunVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_BtlSummonGun_C_SetGunVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_BtlSummonGun.BP_BtlSummonGun_C.GetShowActors
// 0x0020 (0x0020 - 0x0000)
struct BP_BtlSummonGun_C_GetShowActors final
{
public:
	TArray<class AAppPropsCore*>                  ShowActors;                                        // 0x0000(0x0010)(Parm, OutParm)
	TArray<class AAppPropsCore*>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_BtlSummonGun_C_GetShowActors) == 0x000008, "Wrong alignment on BP_BtlSummonGun_C_GetShowActors");
static_assert(sizeof(BP_BtlSummonGun_C_GetShowActors) == 0x000020, "Wrong size on BP_BtlSummonGun_C_GetShowActors");
static_assert(offsetof(BP_BtlSummonGun_C_GetShowActors, ShowActors) == 0x000000, "Member 'BP_BtlSummonGun_C_GetShowActors::ShowActors' has a wrong offset!");
static_assert(offsetof(BP_BtlSummonGun_C_GetShowActors, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_BtlSummonGun_C_GetShowActors::K2Node_MakeArray_Array' has a wrong offset!");

}

