#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_BtlGuiBaseActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlGuiCore.BP_BtlGuiCore_C
// 0x00A8 (0x03F8 - 0x0350)
class ABP_BtlGuiCore_C final : public ABP_BtlGuiBaseActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BtlGuiCore_C;                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBtlInputComponent*                     BtlInput;                                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawComponent*                   BtlGuiDraw;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlDataBaseComponent*                  BtlDataBase;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayCameraExParamTimeline___Track_0_0C6C53014A6D486EB6E52EB01CB738CF; // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PlayCameraExParamTimeline__Direction_0C6C53014A6D486EB6E52EB01CB738CF; // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PlayCameraExParamTimeline;                         // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DebugToggle;                                       // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               NewVar_0_0;                                        // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class ABP_BtlGuiIcon_C*                       GuiIcon;                                           // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                CameraExParam;                                     // 0x03B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AttachCompleted;                                   // 0x03BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AsyncLoadMaxCount;                                 // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AsyncloadCount;                                    // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AsyncLoadNum;                                      // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimMontage*>                   ResidentMontage;                                   // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UNiagaraSystem*>                 ResidentNiagara;                                   // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DrawEnable;                                        // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BtlGuiCore(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void StartCameraExParam();
	void GuiActorUpdate(float DeltaTime);
	void GuiActorBeginPlay();
	void PlayCameraExParamTimeline__UpdateFunc();
	void PlayCameraExParamTimeline__FinishedFunc();
	void TopUIBisible(bool Visible);
	void SilhouetteBisible(bool Visible);
	void UpdateDraw(float DeltaTime);
	void UpdateCapture();
	void ClearKeyHelp();
	void PartyPanelVisible(bool Visible);
	void UIPanelVisible(bool Visible);
	void SetCaptureEnable(bool Enable);
	void SetupPartyPanelActiveActor(class ABtlActor* ActiveActor);
	void SetPromiseType(uint8 PromiseTpye);
	void CreateTargetList(TArray<class ABtlActor*>& ActionList, bool IsHPBar, bool IsSillhouetteOnly, bool IsStencilEnemyOnly);
	void UpdateTargetList(TArray<class ABtlActor*>& ActionList);
	void ClearTargetList();
	void UpdateTargetListAnim(TArray<class ABtlActor*>& ActionList, bool SkipMovingAnimation);
	void SwitchUIColorSilluette(bool IsUIColor);
	void SetPartyPanelVisible(bool Vidible);
	void ClearKeyHelpOffset();
	void CreateSkillName(int32 SkillId, bool IsEnemy);
	void CreateCommonText(int32 Key, bool IsEnemy);
	void ClearSkillName();
	void SetItemName(int32 ItemId, bool IsEnemy);
	void CreateSummonText(bool IsEnemy);
	void CallAddLoadPersona();
	void SetTargetInfo(class ABtlActor* Actor, bool NoAnimation);
	void ReleaseTargetInfo(bool NoAnimation);
	void SetRushVisible(bool IsRush, bool PushButton);
	void SupportOffTargetInfo(class ABtlActor* Actor);
	void UpdateParamPartyPanel(class ABtlActor* Action, int32 SkillId);
	void VisibleKeyHelp(bool Visible);
	void ClearDamagePanel();
	void CheckAttachComplered(bool* Completed);
	void CreateSkillNameWithTime(int32 SkillId, bool IsEnemy, float Time);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlGuiCore_C">();
	}
	static class ABP_BtlGuiCore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlGuiCore_C>();
	}
};
static_assert(alignof(ABP_BtlGuiCore_C) == 0x000008, "Wrong alignment on ABP_BtlGuiCore_C");
static_assert(sizeof(ABP_BtlGuiCore_C) == 0x0003F8, "Wrong size on ABP_BtlGuiCore_C");
static_assert(offsetof(ABP_BtlGuiCore_C, UberGraphFrame_BP_BtlGuiCore_C) == 0x000350, "Member 'ABP_BtlGuiCore_C::UberGraphFrame_BP_BtlGuiCore_C' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, BtlInput) == 0x000358, "Member 'ABP_BtlGuiCore_C::BtlInput' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, BtlGuiDraw) == 0x000360, "Member 'ABP_BtlGuiCore_C::BtlGuiDraw' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, BtlDataBase) == 0x000368, "Member 'ABP_BtlGuiCore_C::BtlDataBase' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, PlayCameraExParamTimeline___Track_0_0C6C53014A6D486EB6E52EB01CB738CF) == 0x000370, "Member 'ABP_BtlGuiCore_C::PlayCameraExParamTimeline___Track_0_0C6C53014A6D486EB6E52EB01CB738CF' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, PlayCameraExParamTimeline__Direction_0C6C53014A6D486EB6E52EB01CB738CF) == 0x00037C, "Member 'ABP_BtlGuiCore_C::PlayCameraExParamTimeline__Direction_0C6C53014A6D486EB6E52EB01CB738CF' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, PlayCameraExParamTimeline) == 0x000380, "Member 'ABP_BtlGuiCore_C::PlayCameraExParamTimeline' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, DebugToggle) == 0x000388, "Member 'ABP_BtlGuiCore_C::DebugToggle' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, NewVar_0_0) == 0x000390, "Member 'ABP_BtlGuiCore_C::NewVar_0_0' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, Text) == 0x000398, "Member 'ABP_BtlGuiCore_C::Text' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, GuiIcon) == 0x0003A8, "Member 'ABP_BtlGuiCore_C::GuiIcon' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, CameraExParam) == 0x0003B0, "Member 'ABP_BtlGuiCore_C::CameraExParam' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, AttachCompleted) == 0x0003BC, "Member 'ABP_BtlGuiCore_C::AttachCompleted' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, AsyncLoadMaxCount) == 0x0003C0, "Member 'ABP_BtlGuiCore_C::AsyncLoadMaxCount' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, AsyncloadCount) == 0x0003C4, "Member 'ABP_BtlGuiCore_C::AsyncloadCount' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, AsyncLoadNum) == 0x0003C8, "Member 'ABP_BtlGuiCore_C::AsyncLoadNum' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, ResidentMontage) == 0x0003D0, "Member 'ABP_BtlGuiCore_C::ResidentMontage' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, ResidentNiagara) == 0x0003E0, "Member 'ABP_BtlGuiCore_C::ResidentNiagara' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiCore_C, DrawEnable) == 0x0003F0, "Member 'ABP_BtlGuiCore_C::DrawEnable' has a wrong offset!");

}

