#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiComponent

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlGuiComponent.BP_BtlGuiComponent_C.onCallCutinModde__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_BtlGuiComponent_C_OnCallCutinModde__DelegateSignature final
{
public:
	bool                                          IsCutinMode;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlGuiComponent_C_OnCallCutinModde__DelegateSignature) == 0x000001, "Wrong alignment on BP_BtlGuiComponent_C_OnCallCutinModde__DelegateSignature");
static_assert(sizeof(BP_BtlGuiComponent_C_OnCallCutinModde__DelegateSignature) == 0x000001, "Wrong size on BP_BtlGuiComponent_C_OnCallCutinModde__DelegateSignature");
static_assert(offsetof(BP_BtlGuiComponent_C_OnCallCutinModde__DelegateSignature, IsCutinMode) == 0x000000, "Member 'BP_BtlGuiComponent_C_OnCallCutinModde__DelegateSignature::IsCutinMode' has a wrong offset!");

// Function BP_BtlGuiComponent.BP_BtlGuiComponent_C.ExecuteUbergraph_BP_BtlGuiComponent
// 0x0618 (0x0618 - 0x0000)
struct BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiBaseActor_C*                  CallFunc_FindGuiActorByName_GuiActor;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindGuiActorByName_sucsess;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiShiftSelect_C*                K2Node_DynamicCast_AsBP_Btl_Gui_Shift_Select;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiBaseActor_C*                  CallFunc_FindGuiActorByName_GuiActor_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindGuiActorByName_sucsess_1;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlUIColorModel_C*                  CallFunc_GetUIColorModel_model;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      CallFunc_GetTargets_ReturnValue;                   // 0x0070(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlUIColorModel_C*                  CallFunc_GetUIColorModel_model_1;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue_2;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlUIColorModel_C*                  CallFunc_GetUIColorModel_model_2;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      CallFunc_GetTargets_ReturnValue_1;                 // 0x00A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue_3;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_GetHero_ReturnValue;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue_4;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array_1;                          // 0x00F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      CallFunc_GetTargets_ReturnValue_2;                 // 0x0120(0x0010)(ReferenceParm)
	class ABP_BtlUIColorModel_C*                  CallFunc_GetUIColorModel_model_3;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetAction_ReturnValue;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_1;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetAction_ReturnValue_1;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlCharacterBase_C*                 K2Node_DynamicCast_AsBP_Btl_Character_Base;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      CallFunc_GetTargetEnemyList_ReturnValue;           // 0x0168(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      CallFunc_SortByList_OutList;                       // 0x0180(0x0010)(ReferenceParm)
	TArray<class ABtlActor*>                      CallFunc_GetPlayerList_ReturnValue;                // 0x0190(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      CallFunc_GetEnemyList_ReturnValue;                 // 0x01A8(0x0010)(ReferenceParm)
	class ABtlActor*                              CallFunc_Array_Get_Item_1;                         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue_5;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      CallFunc_GetTargets_ReturnValue_3;                 // 0x01D0(0x0010)(ReferenceParm)
	class ABP_BtlUIColorModel_C*                  CallFunc_GetUIColorModel_model_4;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetAction_ReturnValue_2;                  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemID_ReturnValue;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_2;                    // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue;                      // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FF[0x1];                                      // 0x01FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item_2;                         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetAction_ReturnValue_3;                  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      CallFunc_GetActionTargets_ReturnValue;             // 0x0220(0x0010)(ReferenceParm)
	EBtlDataAttr                                  CallFunc_GetAttackAttr_ReturnValue;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      CallFunc_GetActionTargets_ReturnValue_1;           // 0x0238(0x0010)(ReferenceParm)
	EBtlDataAttr                                  CallFunc_GetAttackAttr_ReturnValue_1;              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      CallFunc_GetActionTargets_ReturnValue_2;           // 0x0250(0x0010)(ReferenceParm)
	EBtlDataAttr                                  CallFunc_GetAttackAttr_ReturnValue_2;              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      CallFunc_GetActionTargets_ReturnValue_3;           // 0x0268(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetActionID_ReturnValue;                  // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlCommandType                               CallFunc_GetActionType_ReturnValue;                // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemy_ReturnValue_3;                    // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27F[0x1];                                      // 0x027F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemID_ReturnValue_1;                  // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSkillID_ReturnValue;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlCommandType                               CallFunc_GetActionType_ReturnValue_1;              // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x028E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckRushDisable_ReturnValue;             // 0x028F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckRequestRushMode_ReturnValue;         // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlGuiState                                  CallFunc_GetState_ReturnValue;                     // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBtlInputKey                           K2Node_CustomEvent_InputKey;                       // 0x0295(0x0030)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlDataAttr                                  CallFunc_GetSkillAttr_ReturnValue;                 // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetAction_ReturnValue_4;                  // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_4;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckRequestRushMode_ReturnValue_1;       // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckRushDisable_ReturnValue_1;           // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlDataAttr                                  CallFunc_GetSkillAttr_ReturnValue_1;               // 0x02DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetAction_ReturnValue_5;                  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_5;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02EC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02FC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x030C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x031C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x032C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x033C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x034C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x035C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x036C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x037C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x038C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue_6;           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      CallFunc_GetTargets_ReturnValue_4;                 // 0x03A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_ChkSpecialSkillID_ReturnValue;            // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlUIColorModel_C*                  CallFunc_GetUIColorModel_model_5;                  // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue_7;           // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      CallFunc_GetTargets_ReturnValue_5;                 // 0x03D8(0x0010)(ReferenceParm)
	class ABtlActor*                              CallFunc_GetAction_ReturnValue_6;                  // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillID_ReturnValue_1;                 // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_6;                    // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlUIColorModel_C*                  CallFunc_GetUIColorModel_model_6;                  // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item_3;                         // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array_2;                          // 0x0430(0x0010)(ReferenceParm)
	bool                                          CallFunc_CheckExistTutorial_ReturnValue;           // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_flag;                           // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442[0x2];                                      // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_number;                         // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlGuiState                                  CallFunc_GetState_ReturnValue_1;                   // 0x0455(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventBattle_ReturnValue;                // 0x0456(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_457[0x1];                                      // 0x0457(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetAction_ReturnValue_7;                  // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPersonaEquipIndex_ReturnValue;         // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckExistTutorial_ReturnValue_1;         // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSkillIsNoPanel_ReturnValue;            // 0x0465(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChkUseAllSkillAgeing_ReturnValue;         // 0x0466(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSkillCost_Sucsess;                     // 0x0467(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlDataCostType                              CallFunc_GetSkillCost_Cost;                        // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSkillCost_ReturnValue;                 // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillName_Sucsess;                     // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSkillName_ReturnValue;                 // 0x0478(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x04AC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetItemSkillID_ReturnValue;               // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlDataAttr                                  CallFunc_GetSkillAttr_ReturnValue_2;               // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2[0x6];                                      // 0x04C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetAction_ReturnValue_8;                  // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FBtlInputKey& InputKey)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x04D0(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_BtlCharacterBase_C*                 K2Node_DynamicCast_AsBP_Btl_Character_Base_1;      // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChkAsyncLoad_Completed;                   // 0x04EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EB[0x1];                                      // 0x04EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x04EC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlUIColorModel_C*                  CallFunc_GetUIColorModel_model_7;                  // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50A[0x6];                                      // 0x050A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      K2Node_Select_Default;                             // 0x0510(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_1;                              // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetTargetIndex_Output_Get;                // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlGuiBaseActor_C*                  CallFunc_FindGUIActor_GuiActor;                    // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindGUIActor_sucsess;                     // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x053C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53D[0x3];                                      // 0x053D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0545(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0546(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0547(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlCommandType                               K2Node_Select_Default_2;                           // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlGuiState                                  CallFunc_GetState_ReturnValue_2;                   // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A[0x6];                                      // 0x054A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetPersonaStockIndexList_ReturnValue;     // 0x0550(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsEventBattle_ReturnValue_1;              // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SyncRewuestTutorial_ReturnValue;          // 0x0561(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_562[0x2];                                      // 0x0562(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetUIColorModelShowActor_ActorList1;      // 0x0578(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      CallFunc_GetCorrespondList_out;                    // 0x0590(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x05A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlDataTargetType                            CallFunc_GetSkillTargetType_ReturnValue;           // 0x05B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x05B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SetTargetIndex_Output_Get_1;              // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_Array_Get_Item_5;                         // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_Array_Get_Item_6;                         // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array_3;                          // 0x05D0(0x0010)(ReferenceParm)
	TArray<class ABtlActor*>                      CallFunc_GetTargetEnemyList_ReturnValue_1;         // 0x05E0(0x0010)(ReferenceParm)
	class ABtlActor*                              CallFunc_Array_Get_Item_7;                         // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array_4;                          // 0x0600(0x0010)(ReferenceParm)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent) == 0x000008, "Wrong alignment on BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent");
static_assert(sizeof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent) == 0x000618, "Wrong size on BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, EntryPoint) == 0x000000, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_FindGuiActorByName_GuiActor) == 0x000008, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_FindGuiActorByName_GuiActor' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_FindGuiActorByName_sucsess) == 0x000010, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_FindGuiActorByName_sucsess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, K2Node_DynamicCast_AsBP_Btl_Gui_Shift_Select) == 0x000018, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::K2Node_DynamicCast_AsBP_Btl_Gui_Shift_Select' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_FindGuiActorByName_GuiActor_1) == 0x000028, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_FindGuiActorByName_GuiActor_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_FindGuiActorByName_sucsess_1) == 0x000030, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_FindGuiActorByName_sucsess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetMainCharacter_ReturnValue) == 0x000040, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetMainCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetUIColorModel_model) == 0x000048, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetUIColorModel_model' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, K2Node_MakeArray_Array) == 0x000058, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetMainCharacter_ReturnValue_1) == 0x000068, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetMainCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetTargets_ReturnValue) == 0x000070, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetTargets_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_IsValid_ReturnValue_2) == 0x000081, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetUIColorModel_model_1) == 0x000088, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetUIColorModel_model_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_IsValid_ReturnValue_3) == 0x000090, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetMainCharacter_ReturnValue_2) == 0x000098, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetMainCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetUIColorModel_model_2) == 0x0000A0, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetUIColorModel_model_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetTargets_ReturnValue_1) == 0x0000A8, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetTargets_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_IsValid_ReturnValue_4) == 0x0000B8, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, Temp_int_Variable) == 0x0000BC, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_IsValid_ReturnValue_5) == 0x0000C0, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C1, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C4, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetMainCharacter_ReturnValue_3) == 0x0000C8, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetMainCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_IsEnemy_ReturnValue) == 0x0000D0, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_IsEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_Array_AddUnique_ReturnValue) == 0x0000D4, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetHero_ReturnValue) == 0x0000D8, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetMainCharacter_ReturnValue_4) == 0x0000E0, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetMainCharacter_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_Array_Add_ReturnValue) == 0x0000E8, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, K2Node_MakeArray_Array_1) == 0x0000F8, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_Array_Find_ReturnValue) == 0x000108, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_Add_IntInt_ReturnValue_2) == 0x00010C, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_Percent_IntInt_ReturnValue) == 0x000114, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_Array_Length_ReturnValue_1) == 0x000118, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_RandomInteger_ReturnValue) == 0x00011C, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetTargets_ReturnValue_2) == 0x000120, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetTargets_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetUIColorModel_model_3) == 0x000130, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetUIColorModel_model_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_IsValid_ReturnValue_6) == 0x000138, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_GetAction_ReturnValue) == 0x000140, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_GetAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent, CallFunc_IsEnemy_ReturnValue_1) == 0x000148, "Member 'BP_BtlGuiComponent_C_ExecuteUbergraph_BP_BtlGuiComponent::CallFunc_IsEnemy_ReturnValue_1' has a wrong offset!");
