#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlSkillNamePanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_BtlGuiBaseActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlSkillNamePanel.BP_BtlSkillNamePanel_C
// 0x00A8 (0x03F8 - 0x0350)
class ABP_BtlSkillNamePanel_C final : public ABP_BtlGuiBaseActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BtlSkillNamePanel_C;             // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBtlGuiResources*                       BtlGuiResources;                                   // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlDataBaseComponent*                  BtlDataBase;                                       // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawComponent*                   BtlGuiDraw;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOutAnimTimeline_alpha_88381D5F4852060E9A6C14AAAD572D33; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOutAnimTimeline_pos_88381D5F4852060E9A6C14AAAD572D33; // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeOutAnimTimeline__Direction_88381D5F4852060E9A6C14AAAD572D33; // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeOutAnimTimeline;                               // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeInAnimTimeline_angle_18891BC84691F4B9E25A09B381C9CA71; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeInAnimTimeline_alpha_18891BC84691F4B9E25A09B381C9CA71; // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeInAnimTimeline_Pos_18891BC84691F4B9E25A09B381C9CA71; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeInAnimTimeline__Direction_18891BC84691F4B9E25A09B381C9CA71; // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeInAnimTimeline;                                // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsEnemy;                                           // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CurrentPos;                                        // 0x03B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStart;                                           // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFadeInEnd;                                       // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C2[0x2];                                      // 0x03C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimPos;                                           // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimAlpha;                                         // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimAngle;                                         // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectPlg*                   Plg1;                                              // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartAngle;                                        // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectRect*                  Rect1;                                             // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectText*                  Text1;                                             // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Skill_ID;                                          // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DebugSkillID;                                      // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BtlSkillNamePanel(int32 EntryPoint);
	void GuiActorUpdate(float DeltaTime);
	void Start();
	void StartFadeOUT();
	void StartFadeIN();
	void FadeOutAnimTimeline__UpdateFunc();
	void FadeOutAnimTimeline__FinishedFunc();
	void FadeInAnimTimeline__UpdateFunc();
	void FadeInAnimTimeline__FinishedFunc();
	void SetSkillID(int32 SkillId, bool IsEnemy_0, float Time_0);
	void SetCommonText(int32 Key, bool IsEnemy_0, float Time_0);
	void SetItemName(int32 ItemId, bool IsEnemy_0, float Time_0);
	void Set_Debug_Param(int32 DebugSkillID_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlSkillNamePanel_C">();
	}
	static class ABP_BtlSkillNamePanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlSkillNamePanel_C>();
	}
};
static_assert(alignof(ABP_BtlSkillNamePanel_C) == 0x000008, "Wrong alignment on ABP_BtlSkillNamePanel_C");
static_assert(sizeof(ABP_BtlSkillNamePanel_C) == 0x0003F8, "Wrong size on ABP_BtlSkillNamePanel_C");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, UberGraphFrame_BP_BtlSkillNamePanel_C) == 0x000350, "Member 'ABP_BtlSkillNamePanel_C::UberGraphFrame_BP_BtlSkillNamePanel_C' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, BtlGuiResources) == 0x000358, "Member 'ABP_BtlSkillNamePanel_C::BtlGuiResources' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, BtlDataBase) == 0x000360, "Member 'ABP_BtlSkillNamePanel_C::BtlDataBase' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, BtlGuiDraw) == 0x000368, "Member 'ABP_BtlSkillNamePanel_C::BtlGuiDraw' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, FadeOutAnimTimeline_alpha_88381D5F4852060E9A6C14AAAD572D33) == 0x000370, "Member 'ABP_BtlSkillNamePanel_C::FadeOutAnimTimeline_alpha_88381D5F4852060E9A6C14AAAD572D33' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, FadeOutAnimTimeline_pos_88381D5F4852060E9A6C14AAAD572D33) == 0x000374, "Member 'ABP_BtlSkillNamePanel_C::FadeOutAnimTimeline_pos_88381D5F4852060E9A6C14AAAD572D33' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, FadeOutAnimTimeline__Direction_88381D5F4852060E9A6C14AAAD572D33) == 0x000378, "Member 'ABP_BtlSkillNamePanel_C::FadeOutAnimTimeline__Direction_88381D5F4852060E9A6C14AAAD572D33' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, FadeOutAnimTimeline) == 0x000380, "Member 'ABP_BtlSkillNamePanel_C::FadeOutAnimTimeline' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, FadeInAnimTimeline_angle_18891BC84691F4B9E25A09B381C9CA71) == 0x000388, "Member 'ABP_BtlSkillNamePanel_C::FadeInAnimTimeline_angle_18891BC84691F4B9E25A09B381C9CA71' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, FadeInAnimTimeline_alpha_18891BC84691F4B9E25A09B381C9CA71) == 0x00038C, "Member 'ABP_BtlSkillNamePanel_C::FadeInAnimTimeline_alpha_18891BC84691F4B9E25A09B381C9CA71' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, FadeInAnimTimeline_Pos_18891BC84691F4B9E25A09B381C9CA71) == 0x000390, "Member 'ABP_BtlSkillNamePanel_C::FadeInAnimTimeline_Pos_18891BC84691F4B9E25A09B381C9CA71' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, FadeInAnimTimeline__Direction_18891BC84691F4B9E25A09B381C9CA71) == 0x000394, "Member 'ABP_BtlSkillNamePanel_C::FadeInAnimTimeline__Direction_18891BC84691F4B9E25A09B381C9CA71' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, FadeInAnimTimeline) == 0x000398, "Member 'ABP_BtlSkillNamePanel_C::FadeInAnimTimeline' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, Text) == 0x0003A0, "Member 'ABP_BtlSkillNamePanel_C::Text' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, IsEnemy) == 0x0003B0, "Member 'ABP_BtlSkillNamePanel_C::IsEnemy' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, CurrentPos) == 0x0003B4, "Member 'ABP_BtlSkillNamePanel_C::CurrentPos' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, Time) == 0x0003BC, "Member 'ABP_BtlSkillNamePanel_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, IsStart) == 0x0003C0, "Member 'ABP_BtlSkillNamePanel_C::IsStart' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, IsFadeInEnd) == 0x0003C1, "Member 'ABP_BtlSkillNamePanel_C::IsFadeInEnd' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, AnimPos) == 0x0003C4, "Member 'ABP_BtlSkillNamePanel_C::AnimPos' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, AnimAlpha) == 0x0003C8, "Member 'ABP_BtlSkillNamePanel_C::AnimAlpha' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, AnimAngle) == 0x0003CC, "Member 'ABP_BtlSkillNamePanel_C::AnimAngle' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, Plg1) == 0x0003D0, "Member 'ABP_BtlSkillNamePanel_C::Plg1' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, StartAngle) == 0x0003D8, "Member 'ABP_BtlSkillNamePanel_C::StartAngle' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, Rect1) == 0x0003E0, "Member 'ABP_BtlSkillNamePanel_C::Rect1' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, Text1) == 0x0003E8, "Member 'ABP_BtlSkillNamePanel_C::Text1' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, Skill_ID) == 0x0003F0, "Member 'ABP_BtlSkillNamePanel_C::Skill_ID' has a wrong offset!");
static_assert(offsetof(ABP_BtlSkillNamePanel_C, DebugSkillID) == 0x0003F4, "Member 'ABP_BtlSkillNamePanel_C::DebugSkillID' has a wrong offset!");

}

