#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiEncountAlert

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlGuiEncountAlert.BP_BtlGuiEncountAlert_C.ExecuteUbergraph_BP_BtlGuiEncountAlert
// 0x0068 (0x0068 - 0x0000)
struct BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState;                   // 0x0018(0x0008)(NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_deltaTime;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawImage_outID;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectImage*                 CallFunc_CreateDrawImage_outItem;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FFloor64_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_Int64ToByte_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert) == 0x000008, "Wrong alignment on BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert");
static_assert(sizeof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert) == 0x000068, "Wrong size on BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, EntryPoint) == 0x000000, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, Temp_bool_Variable) == 0x000004, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, Temp_object_Variable) == 0x000008, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, Temp_object_Variable_1) == 0x000010, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, K2Node_MakeStruct_BtlBlendState) == 0x000018, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::K2Node_MakeStruct_BtlBlendState' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, K2Node_Event_deltaTime) == 0x000024, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::K2Node_Event_deltaTime' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, K2Node_Select_Default) == 0x000028, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, CallFunc_CreateDrawImage_outID) == 0x000030, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::CallFunc_CreateDrawImage_outID' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, CallFunc_CreateDrawImage_outItem) == 0x000038, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::CallFunc_CreateDrawImage_outItem' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000040, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, CallFunc_FFloor64_ReturnValue) == 0x000058, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::CallFunc_FFloor64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, CallFunc_Conv_Int64ToByte_ReturnValue) == 0x000060, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::CallFunc_Conv_Int64ToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert, K2Node_MakeStruct_Color) == 0x000064, "Member 'BP_BtlGuiEncountAlert_C_ExecuteUbergraph_BP_BtlGuiEncountAlert::K2Node_MakeStruct_Color' has a wrong offset!");

// Function BP_BtlGuiEncountAlert.BP_BtlGuiEncountAlert_C.GuiActorUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlGuiEncountAlert_C_GuiActorUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiEncountAlert_C_GuiActorUpdate) == 0x000004, "Wrong alignment on BP_BtlGuiEncountAlert_C_GuiActorUpdate");
static_assert(sizeof(BP_BtlGuiEncountAlert_C_GuiActorUpdate) == 0x000004, "Wrong size on BP_BtlGuiEncountAlert_C_GuiActorUpdate");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_GuiActorUpdate, DeltaTime) == 0x000000, "Member 'BP_BtlGuiEncountAlert_C_GuiActorUpdate::DeltaTime' has a wrong offset!");

// Function BP_BtlGuiEncountAlert.BP_BtlGuiEncountAlert_C.SetParam
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlGuiEncountAlert_C_SetParam final
{
public:
	bool                                          PlayerAdvantage_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LifeTime_0;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiEncountAlert_C_SetParam) == 0x000004, "Wrong alignment on BP_BtlGuiEncountAlert_C_SetParam");
static_assert(sizeof(BP_BtlGuiEncountAlert_C_SetParam) == 0x000008, "Wrong size on BP_BtlGuiEncountAlert_C_SetParam");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_SetParam, PlayerAdvantage_0) == 0x000000, "Member 'BP_BtlGuiEncountAlert_C_SetParam::PlayerAdvantage_0' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiEncountAlert_C_SetParam, LifeTime_0) == 0x000004, "Member 'BP_BtlGuiEncountAlert_C_SetParam::LifeTime_0' has a wrong offset!");

}

