#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlEffectIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlEffectIcon.BP_BtlEffectIcon_C.ExecuteUbergraph_BP_BtlEffectIcon
// 0x0190 (0x0190 - 0x0000)
struct BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0040(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00F4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetOpacity_Opacity;                       // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon) == 0x000010, "Wrong alignment on BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon");
static_assert(sizeof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon) == 0x000190, "Wrong size on BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, EntryPoint) == 0x000000, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, CallFunc_GetSocketTransform_ReturnValue) == 0x000010, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000040, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, K2Node_Event_DeltaSeconds) == 0x0000C8, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, CallFunc_IsValid_ReturnValue) == 0x0000CC, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, CallFunc_IsValid_ReturnValue_1) == 0x0000CD, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, CallFunc_BreakTransform_Location) == 0x0000D0, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, CallFunc_BreakTransform_Rotation) == 0x0000DC, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, CallFunc_BreakTransform_Scale) == 0x0000E8, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000F4, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, CallFunc_IsValid_ReturnValue_2) == 0x00017C, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, CallFunc_GetOpacity_Opacity) == 0x000180, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::CallFunc_GetOpacity_Opacity' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon, CallFunc_IsValid_ReturnValue_3) == 0x000184, "Member 'BP_BtlEffectIcon_C_ExecuteUbergraph_BP_BtlEffectIcon::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_BtlEffectIcon.BP_BtlEffectIcon_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlEffectIcon_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEffectIcon_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BtlEffectIcon_C_ReceiveTick");
static_assert(sizeof(BP_BtlEffectIcon_C_ReceiveTick) == 0x000004, "Wrong size on BP_BtlEffectIcon_C_ReceiveTick");
static_assert(offsetof(BP_BtlEffectIcon_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BtlEffectIcon_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BtlEffectIcon.BP_BtlEffectIcon_C.Setup
// 0x0020 (0x0020 - 0x0000)
struct BP_BtlEffectIcon_C_Setup final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlCharacterBase_C*                 ParentCharacter_0;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName_0;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      VFX;                                               // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEffectIcon_C_Setup) == 0x000008, "Wrong alignment on BP_BtlEffectIcon_C_Setup");
static_assert(sizeof(BP_BtlEffectIcon_C_Setup) == 0x000020, "Wrong size on BP_BtlEffectIcon_C_Setup");
static_assert(offsetof(BP_BtlEffectIcon_C_Setup, Mesh) == 0x000000, "Member 'BP_BtlEffectIcon_C_Setup::Mesh' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_Setup, ParentCharacter_0) == 0x000008, "Member 'BP_BtlEffectIcon_C_Setup::ParentCharacter_0' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_Setup, SocketName_0) == 0x000010, "Member 'BP_BtlEffectIcon_C_Setup::SocketName_0' has a wrong offset!");
static_assert(offsetof(BP_BtlEffectIcon_C_Setup, VFX) == 0x000018, "Member 'BP_BtlEffectIcon_C_Setup::VFX' has a wrong offset!");

}

