#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlPromiseCommon

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlPromiseCommon.BP_BtlPromiseCommon_C.ExecuteUbergraph_BP_BtlPromiseCommon
// 0x0AF0 (0x0AF0 - 0x0000)
struct BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_2;                            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBtlGuiDrawComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UBtlGuiDrawComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawComponent*                   CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Temp_byte_Variable;                                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_flag;                                 // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x1];                                       // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_param;                                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetGroupDrawItem_idAry;                   // 0x00B8(0x0010)(ReferenceParm)
	TArray<class UBtlGuiDrawObjectCore*>          CallFunc_GetGroupDrawItem_objAry;                  // 0x00C8(0x0010)(ReferenceParm)
	class FString                                 K2Node_Select_Default;                             // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectCore*                  CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectText*                  K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Text;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_deltaTime;                            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckMsgStart_ReturnValue;                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBtlGuiDrawComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_2;    // 0x0148(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBtlGuiDrawComponent*                   CallFunc_Array_Get_Item_2;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLayoutDebugMenuOpen_ReturnValue;        // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetWidthHeight_width;                     // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWidthHeight_height;                    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWidthHeight_width_1;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWidthHeight_height_1;                  // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInputDecideKeyCross_ReturnValue;       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawComponent*                   CallFunc_Array_Get_Item_3;                         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWidthHeight_width_2;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWidthHeight_height_2;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWidthHeight_width_3;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWidthHeight_height_3;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWidthHeight_width_4;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWidthHeight_height_4;                  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWidthHeight_width_5;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWidthHeight_height_5;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBtlGuiVertex>                  CallFunc_CreateRectPrimitive_NewParam;             // 0x01D0(0x0010)(ReferenceParm)
	struct FColor                                 K2Node_MakeStruct_Color_1;                         // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive;             // 0x01E8(0x0060)()
	TArray<struct FBtlGuiVertex>                  CallFunc_CreateRectPrimitive_NewParam_1;           // 0x0248(0x0010)(ReferenceParm)
	int32                                         CallFunc_CreateDrawPrimitive_outID;                // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem;              // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive_1;           // 0x0268(0x0060)()
	struct FColor                                 K2Node_MakeStruct_Color_2;                         // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawPrimitive_outID_1;              // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem_1;            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBtlGuiVertex>                  CallFunc_CreateRectPrimitive_NewParam_2;           // 0x02D8(0x0010)(ReferenceParm)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive_2;           // 0x02E8(0x0060)()
	struct FColor                                 K2Node_MakeStruct_Color_3;                         // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawPrimitive_outID_2;              // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem_2;            // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBtlGuiVertex>                  CallFunc_CreateRectPrimitive_NewParam_3;           // 0x0358(0x0010)(ReferenceParm)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive_3;           // 0x0368(0x0060)()
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState;                   // 0x03C8(0x0008)(NoDestructor)
	int32                                         CallFunc_CreateDrawPrimitive_outID_3;              // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem_3;            // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_4;                         // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBtlGuiVertex>                  CallFunc_CreateRectPrimitive_NewParam_4;           // 0x03E8(0x0010)(ReferenceParm)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive_4;           // 0x03F8(0x0060)()
	int32                                         CallFunc_CreateDrawPrimitive_outID_4;              // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem_4;            // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_1;                 // 0x0474(0x0008)(NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_5;                         // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0484(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USprAsset*                              CallFunc_GetResources_OutResources;                // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite;                // 0x0498(0x0050)(NoDestructor)
	struct FColor                                 K2Node_MakeStruct_Color_6;                         // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID;                   // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem;                 // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USprAsset*                              CallFunc_GetResources_OutResources_1;              // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_1;              // 0x0508(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_1;                 // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_1;               // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_2;                 // 0x0568(0x0008)(NoDestructor)
	struct FColor                                 K2Node_MakeStruct_Color_7;                         // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBtlGuiVertex>                  CallFunc_CreateRectPrimitive_NewParam_5;           // 0x0578(0x0010)(ReferenceParm)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_3;                 // 0x0590(0x0008)(NoDestructor)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive_5;           // 0x0598(0x0060)()
	int32                                         CallFunc_CreateDrawPrimitive_outID_5;              // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem_5;            // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USprAsset*                              CallFunc_GetKeyHelpSpr_ReturnValue;                // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USprAsset*                              CallFunc_GetKeyHelpSpr_ReturnValue_1;              // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_1;     // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_2;     // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_4;               // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_3;     // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_4;     // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_5;               // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_6;               // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_5;     // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_6;     // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_7;               // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_7;     // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_3;       // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_4;       // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_5;       // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_6;       // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_8;                         // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_2;              // 0x06C0(0x0050)(NoDestructor)
	struct FColor                                 K2Node_MakeStruct_Color_9;                         // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID_2;                 // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_2;               // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_3;              // 0x0720(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_3;                 // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_3;               // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInputDecideKeyCross_ReturnValue_1;     // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_781[0x3];                                      // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_7;       // 0x0784(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_10;                        // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_8;       // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_9;       // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_11;                        // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A4[0x4];                                      // 0x07A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlgAsset*                              CallFunc_GetResources_OutResources_2;              // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBtlGuiVertex>                  CallFunc_CreateRectPrimitive_NewParam_6;           // 0x07B0(0x0010)(ReferenceParm)
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg;                   // 0x07C0(0x0048)(NoDestructor)
	int32                                         CallFunc_CreateDrawPlg_outID;                      // 0x0808(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80C[0x4];                                      // 0x080C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem;                    // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive_6;           // 0x0818(0x0060)()
	int32                                         CallFunc_CreateDrawPrimitive_outID_6;              // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem_6;            // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_10;      // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_11;      // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_12;                        // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_4;              // 0x08A0(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_4;                 // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F4[0x4];                                      // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_4;               // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_13;                        // 0x0900(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_904[0x4];                                      // 0x0904(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_5;              // 0x0908(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_5;                 // 0x0958(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95C[0x4];                                      // 0x095C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_5;               // 0x0960(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USprAsset*                              CallFunc_GetResources_OutResources_3;              // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_6;              // 0x0970(0x0050)(NoDestructor)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_7;              // 0x09C0(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_6;                 // 0x0A10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A14[0x4];                                      // 0x0A14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_6;               // 0x0A18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID_7;                 // 0x0A20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A24[0x4];                                      // 0x0A24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_7;               // 0x0A28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_8;              // 0x0A30(0x0050)(NoDestructor)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_9;              // 0x0A80(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_8;                 // 0x0AD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD4[0x4];                                      // 0x0AD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_8;               // 0x0AD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID_9;                 // 0x0AE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE4[0x4];                                      // 0x0AE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_9;               // 0x0AE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon) == 0x000008, "Wrong alignment on BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon");
static_assert(sizeof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon) == 0x000AF0, "Wrong size on BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, EntryPoint) == 0x000000, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_string_Variable) == 0x000008, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_string_Variable_1) == 0x000040, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_string_Variable_2) == 0x000060, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000078, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000088, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Array_Length_ReturnValue_1) == 0x00009C, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_int_Array_Index_Variable_2) == 0x0000A0, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B0, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_byte_Variable) == 0x0000B1, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_Event_flag) == 0x0000B2, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_Event_flag' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_Event_param) == 0x0000B4, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_Event_param' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetGroupDrawItem_idAry) == 0x0000B8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetGroupDrawItem_idAry' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetGroupDrawItem_objAry) == 0x0000C8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetGroupDrawItem_objAry' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_Select_Default) == 0x0000D8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Array_Length_ReturnValue_2) == 0x0000F0, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Text) == 0x0000F8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Text' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_int_Loop_Counter_Variable_2) == 0x000104, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Less_IntInt_ReturnValue_1) == 0x000108, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Add_IntInt_ReturnValue_2) == 0x00010C, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_Event_deltaTime) == 0x000110, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_Event_deltaTime' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_CreateDelegate_OutputDelegate_2) == 0x000114, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_int_Loop_Counter_Variable_3) == 0x000124, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_CreateDelegate_OutputDelegate_3) == 0x000128, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Less_IntInt_ReturnValue_2) == 0x000138, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Add_IntInt_ReturnValue_3) == 0x00013C, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Not_PreBool_ReturnValue) == 0x000140, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_CheckMsgStart_ReturnValue) == 0x000141, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_CheckMsgStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_K2_GetComponentsByClass_ReturnValue_2) == 0x000148, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_K2_GetComponentsByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Array_Get_Item_2) == 0x000158, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Not_PreBool_ReturnValue_1) == 0x000160, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_BooleanAND_ReturnValue) == 0x000161, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Array_Length_ReturnValue_3) == 0x000164, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Less_IntInt_ReturnValue_3) == 0x000168, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Not_PreBool_ReturnValue_2) == 0x000169, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Not_PreBool_ReturnValue_3) == 0x00016A, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_BooleanAND_ReturnValue_1) == 0x00016B, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_BooleanAND_ReturnValue_2) == 0x00016C, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_IsLayoutDebugMenuOpen_ReturnValue) == 0x00016D, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_IsLayoutDebugMenuOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_CreateDelegate_OutputDelegate_4) == 0x000170, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_width) == 0x000180, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_width' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_height) == 0x000184, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_height' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_width_1) == 0x000188, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_width_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_height_1) == 0x00018C, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_height_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000190, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000194, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetInputDecideKeyCross_ReturnValue) == 0x000198, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetInputDecideKeyCross_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, Temp_int_Array_Index_Variable_3) == 0x00019C, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_Array_Get_Item_3) == 0x0001A0, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_width_2) == 0x0001A8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_width_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_height_2) == 0x0001AC, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_height_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_width_3) == 0x0001B0, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_width_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_height_3) == 0x0001B4, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_height_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_width_4) == 0x0001B8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_width_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_height_4) == 0x0001BC, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_height_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_width_5) == 0x0001C0, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_width_5' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_GetWidthHeight_height_5) == 0x0001C4, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_GetWidthHeight_height_5' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_MakeStruct_Color) == 0x0001C8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_CreateRectPrimitive_NewParam) == 0x0001D0, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_CreateRectPrimitive_NewParam' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_MakeStruct_Color_1) == 0x0001E0, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_MakeStruct_Color_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_MakeStruct_BtlGuiDrawPrimitive) == 0x0001E8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_MakeStruct_BtlGuiDrawPrimitive' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_CreateRectPrimitive_NewParam_1) == 0x000248, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_CreateRectPrimitive_NewParam_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_CreateDrawPrimitive_outID) == 0x000258, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_CreateDrawPrimitive_outID' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_CreateDrawPrimitive_outItem) == 0x000260, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_CreateDrawPrimitive_outItem' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_MakeStruct_BtlGuiDrawPrimitive_1) == 0x000268, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_MakeStruct_BtlGuiDrawPrimitive_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, K2Node_MakeStruct_Color_2) == 0x0002C8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::K2Node_MakeStruct_Color_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_CreateDrawPrimitive_outID_1) == 0x0002CC, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_CreateDrawPrimitive_outID_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_CreateDrawPrimitive_outItem_1) == 0x0002D0, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_CreateDrawPrimitive_outItem_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon, CallFunc_CreateRectPrimitive_NewParam_2) == 0x0002D8, "Member 'BP_BtlPromiseCommon_C_ExecuteUbergraph_BP_BtlPromiseCommon::CallFunc_CreateRectPrimitive_NewParam_2' has a wrong offset!");
