#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlEffectIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Xrd777_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlEffectIcon.BP_BtlEffectIcon_C
// 0x0068 (0x02E0 - 0x0278)
class ABP_BtlEffectIcon_C final : public AAppActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 TargetMesh;                                        // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Work;                                              // 0x02A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      Effect;                                            // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlCharacterBase_C*                 ParentCharacter;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BtlEffectIcon(int32 EntryPoint);
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void Setup(class USkeletalMeshComponent* Mesh, class ABP_BtlCharacterBase_C* ParentCharacter_0, class FName SocketName_0, class UNiagaraComponent* VFX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlEffectIcon_C">();
	}
	static class ABP_BtlEffectIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlEffectIcon_C>();
	}
};
static_assert(alignof(ABP_BtlEffectIcon_C) == 0x000010, "Wrong alignment on ABP_BtlEffectIcon_C");
static_assert(sizeof(ABP_BtlEffectIcon_C) == 0x0002E0, "Wrong size on ABP_BtlEffectIcon_C");
static_assert(offsetof(ABP_BtlEffectIcon_C, UberGraphFrame) == 0x000278, "Member 'ABP_BtlEffectIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BtlEffectIcon_C, DefaultSceneRoot) == 0x000280, "Member 'ABP_BtlEffectIcon_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BtlEffectIcon_C, TargetMesh) == 0x000288, "Member 'ABP_BtlEffectIcon_C::TargetMesh' has a wrong offset!");
static_assert(offsetof(ABP_BtlEffectIcon_C, SocketName) == 0x000290, "Member 'ABP_BtlEffectIcon_C::SocketName' has a wrong offset!");
static_assert(offsetof(ABP_BtlEffectIcon_C, Work) == 0x0002A0, "Member 'ABP_BtlEffectIcon_C::Work' has a wrong offset!");
static_assert(offsetof(ABP_BtlEffectIcon_C, Effect) == 0x0002D0, "Member 'ABP_BtlEffectIcon_C::Effect' has a wrong offset!");
static_assert(offsetof(ABP_BtlEffectIcon_C, ParentCharacter) == 0x0002D8, "Member 'ABP_BtlEffectIcon_C::ParentCharacter' has a wrong offset!");

}

