#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlEffectUtensil

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Xrd777_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlEffectUtensil.BP_BtlEffectUtensil_C
// 0x0028 (0x02A0 - 0x0278)
class ABP_BtlEffectUtensil_C final : public AAppActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaying;                                         // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      VFX;                                               // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlCoreComponent*                      BtlCore;                                           // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BtlEffectUtensil(int32 EntryPoint);
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void SetEffect(class UNiagaraComponent* Niagara, class UBtlCoreComponent* BtlCore_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlEffectUtensil_C">();
	}
	static class ABP_BtlEffectUtensil_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlEffectUtensil_C>();
	}
};
static_assert(alignof(ABP_BtlEffectUtensil_C) == 0x000008, "Wrong alignment on ABP_BtlEffectUtensil_C");
static_assert(sizeof(ABP_BtlEffectUtensil_C) == 0x0002A0, "Wrong size on ABP_BtlEffectUtensil_C");
static_assert(offsetof(ABP_BtlEffectUtensil_C, UberGraphFrame) == 0x000278, "Member 'ABP_BtlEffectUtensil_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BtlEffectUtensil_C, DefaultSceneRoot) == 0x000280, "Member 'ABP_BtlEffectUtensil_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BtlEffectUtensil_C, IsPlaying) == 0x000288, "Member 'ABP_BtlEffectUtensil_C::IsPlaying' has a wrong offset!");
static_assert(offsetof(ABP_BtlEffectUtensil_C, VFX) == 0x000290, "Member 'ABP_BtlEffectUtensil_C::VFX' has a wrong offset!");
static_assert(offsetof(ABP_BtlEffectUtensil_C, BtlCore) == 0x000298, "Member 'ABP_BtlEffectUtensil_C::BtlCore' has a wrong offset!");

}

