#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Xrd777_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlGuiIcon.BP_BtlGuiIcon_C.ExecuteUbergraph_BP_BtlGuiIcon
// 0x0180 (0x0180 - 0x0000)
struct BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0020(0x0010)(NoDestructor)
	TArray<struct FWeightedBlendable>             K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x0050(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiBaseActor_C*                  CallFunc_AttachChild_Object;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AttachChild_Sucsess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_deltaTime;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlGuiJyokyoHelp_C*                 CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACineCameraActor*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0098(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACineCameraActor*                       CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue_1;                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiBaseActor_C*                  CallFunc_AttachChild_Object_1;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AttachChild_Sucsess_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiRush_C*                       K2Node_DynamicCast_AsBP_Btl_Gui_Rush;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable_1;             // 0x00F8(0x0010)(NoDestructor)
	class ABP_BtlGuiBaseActor_C*                  CallFunc_AttachChild_Object_2;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AttachChild_Sucsess_2;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiDamage2_C*                    K2Node_DynamicCast_AsBP_Btl_Gui_Damage_2;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLayoutDebugMenuOpen_ReturnValue;        // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDebugDamageTextIdx_ReturnValue;        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnDebugRushDraw_ReturnValue;              // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnDebugRushStopMaskVisible_ReturnValue;   // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnDebugRushStopMaskAnimPause_ReturnValue; // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiBaseActor_C*                  CallFunc_AttachChild_Object_3;                     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AttachChild_Sucsess_3;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlSkillNamePanel_C*                K2Node_DynamicCast_AsBP_Btl_Skill_Name_Panel;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiBaseActor_C*                  CallFunc_AttachChild_Object_4;                     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AttachChild_Sucsess_4;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDebugSkillNamePanelID_ReturnValue;     // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlGuiJyokyoHelp_C*                 K2Node_DynamicCast_AsBP_Btl_Gui_Jyokyo_Help;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16B[0x1];                                      // 0x016B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDebugSkillNamePanelID_ReturnValue_1;   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDebugJyokyoHelpID_ReturnValue;         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDebugJyokyoHelpID_ReturnValue_1;       // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon) == 0x000008, "Wrong alignment on BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon");
static_assert(sizeof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon) == 0x000180, "Wrong size on BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, EntryPoint) == 0x000000, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, Temp_bool_IsClosed_Variable) == 0x000014, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, Temp_bool_Has_Been_Initd_Variable) == 0x00001C, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_MakeStruct_WeightedBlendable) == 0x000020, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_MakeStruct_WeightedBlendables) == 0x000050, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_MakeStruct_WeightedBlendables' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_AttachChild_Object) == 0x000078, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_AttachChild_Object' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_AttachChild_Sucsess) == 0x000080, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_AttachChild_Sucsess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_Event_deltaTime) == 0x000084, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_Event_deltaTime' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000090, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, Temp_int_Array_Index_Variable) == 0x000094, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_GetAllActorsOfClass_OutActors) == 0x000098, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, Temp_int_Array_Index_Variable_1) == 0x0000A8, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_ActorHasTag_ReturnValue) == 0x0000B8, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_ActorHasTag_ReturnValue_1) == 0x0000B9, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_ActorHasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_Array_Length_ReturnValue) == 0x0000BC, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_AttachChild_Object_1) == 0x0000C8, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_AttachChild_Object_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_AttachChild_Sucsess_1) == 0x0000D0, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_AttachChild_Sucsess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_DynamicCast_AsBP_Btl_Gui_Rush) == 0x0000D8, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_DynamicCast_AsBP_Btl_Gui_Rush' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_Array_Add_ReturnValue) == 0x0000E4, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_Array_Get_Item_2) == 0x0000E8, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F4, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_IsValid_ReturnValue_2) == 0x0000F5, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_MakeStruct_WeightedBlendable_1) == 0x0000F8, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_MakeStruct_WeightedBlendable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_AttachChild_Object_2) == 0x000108, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_AttachChild_Object_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_AttachChild_Sucsess_2) == 0x000110, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_AttachChild_Sucsess_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_DynamicCast_AsBP_Btl_Gui_Damage_2) == 0x000118, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_DynamicCast_AsBP_Btl_Gui_Damage_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_IsLayoutDebugMenuOpen_ReturnValue) == 0x000121, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_IsLayoutDebugMenuOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_GetDebugDamageTextIdx_ReturnValue) == 0x000124, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_GetDebugDamageTextIdx_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_SwitchInteger_CmpSuccess) == 0x000128, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_IsValid_ReturnValue_3) == 0x000129, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_IsValid_ReturnValue_4) == 0x00012A, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_OnDebugRushDraw_ReturnValue) == 0x00012B, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_OnDebugRushDraw_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_OnDebugRushStopMaskVisible_ReturnValue) == 0x00012C, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_OnDebugRushStopMaskVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_OnDebugRushStopMaskAnimPause_ReturnValue) == 0x00012D, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_OnDebugRushStopMaskAnimPause_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_AttachChild_Object_3) == 0x000130, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_AttachChild_Object_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_AttachChild_Sucsess_3) == 0x000138, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_AttachChild_Sucsess_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_DynamicCast_AsBP_Btl_Skill_Name_Panel) == 0x000140, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_DynamicCast_AsBP_Btl_Skill_Name_Panel' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_DynamicCast_bSuccess_2) == 0x000148, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_AttachChild_Object_4) == 0x000150, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_AttachChild_Object_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_AttachChild_Sucsess_4) == 0x000158, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_AttachChild_Sucsess_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_GetDebugSkillNamePanelID_ReturnValue) == 0x00015C, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_GetDebugSkillNamePanelID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_DynamicCast_AsBP_Btl_Gui_Jyokyo_Help) == 0x000160, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_DynamicCast_AsBP_Btl_Gui_Jyokyo_Help' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, K2Node_DynamicCast_bSuccess_3) == 0x000168, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000169, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_IsValid_ReturnValue_5) == 0x00016A, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_GetDebugSkillNamePanelID_ReturnValue_1) == 0x00016C, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_GetDebugSkillNamePanelID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_GetDebugJyokyoHelpID_ReturnValue) == 0x000170, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_GetDebugJyokyoHelpID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_GetDebugJyokyoHelpID_ReturnValue_1) == 0x000174, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_GetDebugJyokyoHelpID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000178, "Member 'BP_BtlGuiIcon_C_ExecuteUbergraph_BP_BtlGuiIcon::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_BtlGuiIcon.BP_BtlGuiIcon_C.GuiActorUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlGuiIcon_C_GuiActorUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiIcon_C_GuiActorUpdate) == 0x000004, "Wrong alignment on BP_BtlGuiIcon_C_GuiActorUpdate");
static_assert(sizeof(BP_BtlGuiIcon_C_GuiActorUpdate) == 0x000004, "Wrong size on BP_BtlGuiIcon_C_GuiActorUpdate");
static_assert(offsetof(BP_BtlGuiIcon_C_GuiActorUpdate, DeltaTime) == 0x000000, "Member 'BP_BtlGuiIcon_C_GuiActorUpdate::DeltaTime' has a wrong offset!");

// Function BP_BtlGuiIcon.BP_BtlGuiIcon_C.CreateDamage
// 0x02F0 (0x02F0 - 0x0000)
struct BP_BtlGuiIcon_C_CreateDamage final
{
public:
	class ABP_BtlCharacterBase_C*                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageSP;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlGuiIconHit                                Hit;                                               // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlGuiIconDamageType                         DamageType;                                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PortionDamage;                                     // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsBadStatus;                                       // 0x0013(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsBadStatusRecovery;                               // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEndure;                                          // 0x0015(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EndureRadio;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DelayParamHP;                                      // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DelayParamSP;                                      // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalDelayParamSP;                                 // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalDelayParamHP;                                 // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalEndureRadio;                                  // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsAllAddDamage;                               // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsEndure;                                     // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalCheckRecoveryHPSP;                            // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsBadStatusRecovery;                          // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsBadStatus;                                  // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiDamage2_C*                    LocalDamagePanel;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalBool;                                         // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalDamageWork;                                   // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              DamagePos;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalType;                                         // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsDamage;                                     // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalPortionDamage;                                // 0x0055(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlGuiIconDamageType                         LocalDamageType;                                   // 0x0056(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlGuiIconHit                                LocalHit;                                          // 0x0057(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalDamageSP;                                     // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalDamage;                                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlCharacterBase_C*                 LocalTarget;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPartyPanelVisible_ReturnValue;       // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A7[0x1];                                       // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChkPlayerDamageOff_ReturnValue;           // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetID_ReturnValue;                        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetID_ReturnValue_1;                      // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue;                      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemy_ReturnValue_1;                    // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetID_ReturnValue_2;                      // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_2;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetID_ReturnValue_3;                      // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_3;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetID_ReturnValue_4;                      // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_4;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetID_ReturnValue_5;                      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_5;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetID_ReturnValue_6;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_6;                    // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetID_ReturnValue_7;                      // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_7;                    // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_BtlCharacterBase_C* NewParam)> K2Node_CreateDelegate_OutputDelegate;              // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Select_Default_1;                           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberHalfWidth_halfWidth;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberHalfWidth_Scale;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNumberHalfWidth_FlipFlopFlag;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumberHalfWidth_halfWidth_1;           // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberHalfWidth_Scale_1;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNumberHalfWidth_FlipFlopFlag_1;        // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiBaseActor_C*                  CallFunc_AttachChild_Object;                       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AttachChild_Sucsess;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlGuiLifeBar_C*                    K2Node_DynamicCast_AsBP_Btl_Gui_Life_Bar;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPartyPanelVisible_ReturnValue_1;     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUnitMaxSP_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_SkeletalMesh;             // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUnitSP_ReturnValue;                    // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetID_ReturnValue_8;                      // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetID_ReturnValue_9;                      // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUnitMaxHP_ReturnValue;                 // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUnitHP_ReturnValue;                    // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_8;                    // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BtlGuiWorldToScreen_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Contains_ReturnValue_1;               // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
