#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiPersonaStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BtlGuiBaseActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlGuiPersonaStatus.BP_BtlGuiPersonaStatus_C
// 0x0030 (0x0380 - 0x0350)
class ABP_BtlGuiPersonaStatus_C final : public ABP_BtlGuiBaseActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BtlGuiPersonaStatus_C;           // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBtlGuiListComponent*                   BtlGuiList;                                        // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlDataBaseComponent*                  BtlDataBase;                                       // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawComponent*                   BtlGuiDraw;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiPersonaStatusComponent*          BtlGuiPersonaStatus;                               // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCommentaryOpen;                                  // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSkillHelpOpen;                                   // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsStrategy;                                        // 0x037A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsUpdateEnable;                                    // 0x037B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         BindTime;                                          // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BtlGuiPersonaStatus(int32 EntryPoint);
	void GuiActorEncountEnd();
	void GuiActorEncountStart();
	void GuiActorUpdate(float DeltaTime);
	void GuiActorStateExit();
	void GuiActorStateInit(bool Flag, int32 Param);
	void GuiActorBeginDestroy();
	void PushL2();
	void PushR1();
	void PushL1();
	void PushOk();
	void PushRL();
	void PushCancel();
	void GuiActorUnbindAction();
	void GuiActorBindAction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlGuiPersonaStatus_C">();
	}
	static class ABP_BtlGuiPersonaStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlGuiPersonaStatus_C>();
	}
};
static_assert(alignof(ABP_BtlGuiPersonaStatus_C) == 0x000008, "Wrong alignment on ABP_BtlGuiPersonaStatus_C");
static_assert(sizeof(ABP_BtlGuiPersonaStatus_C) == 0x000380, "Wrong size on ABP_BtlGuiPersonaStatus_C");
static_assert(offsetof(ABP_BtlGuiPersonaStatus_C, UberGraphFrame_BP_BtlGuiPersonaStatus_C) == 0x000350, "Member 'ABP_BtlGuiPersonaStatus_C::UberGraphFrame_BP_BtlGuiPersonaStatus_C' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiPersonaStatus_C, BtlGuiList) == 0x000358, "Member 'ABP_BtlGuiPersonaStatus_C::BtlGuiList' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiPersonaStatus_C, BtlDataBase) == 0x000360, "Member 'ABP_BtlGuiPersonaStatus_C::BtlDataBase' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiPersonaStatus_C, BtlGuiDraw) == 0x000368, "Member 'ABP_BtlGuiPersonaStatus_C::BtlGuiDraw' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiPersonaStatus_C, BtlGuiPersonaStatus) == 0x000370, "Member 'ABP_BtlGuiPersonaStatus_C::BtlGuiPersonaStatus' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiPersonaStatus_C, IsCommentaryOpen) == 0x000378, "Member 'ABP_BtlGuiPersonaStatus_C::IsCommentaryOpen' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiPersonaStatus_C, IsSkillHelpOpen) == 0x000379, "Member 'ABP_BtlGuiPersonaStatus_C::IsSkillHelpOpen' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiPersonaStatus_C, IsStrategy) == 0x00037A, "Member 'ABP_BtlGuiPersonaStatus_C::IsStrategy' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiPersonaStatus_C, IsUpdateEnable) == 0x00037B, "Member 'ABP_BtlGuiPersonaStatus_C::IsUpdateEnable' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiPersonaStatus_C, BindTime) == 0x00037C, "Member 'ABP_BtlGuiPersonaStatus_C::BindTime' has a wrong offset!");

}

