#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlPhaseFighting

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlPhaseFighting.BP_BtlPhaseFighting_C.ExecuteUbergraph_BP_BtlPhaseFighting
// 0x02C0 (0x02C0 - 0x0000)
struct BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 CallFunc_GetMainAction_MainCharacter;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlCharacterBase_C*                 CallFunc_GetMainAction_MainCharacter_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebug_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckGeneralAttackAnnihilation_ReturnValue; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckShaffleTimeAllowed_ReturnValue;      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_1;                    // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPlayingEventScript_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInitialTransform_trans;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlEventAlloutShuffleMonitor*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGeneralAttackAnnihilation_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPlayingEventScript_ReturnValue_1;    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 CallFunc_GetMainAction_MainCharacter_2;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebug_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_3;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_4;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetTargetsCylinder_Bottom_Center;         // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTargetsCylinder_Radius;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTargetsCylinder_Height;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetsCylinder_Cylinder_Center;       // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_GetHero_ReturnValue;                      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlCharacterBase_C*                 CallFunc_GetEventMainAction_EventMainChara;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_BtlCharacterBase_C*                 K2Node_DynamicCast_AsBP_Btl_Character_Base;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 CallFunc_GetMainAction_MainCharacter_3;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BtlFadeSync_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetExpireSupportWaitTime_ReturnValue;     // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTurnFromGuardCancel_ReturnValue;     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckRecoveryFromDown_ReturnValue;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 CallFunc_GetMainAction_MainCharacter_4;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRecoveryWaitTime_ReturnValue;          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 CallFunc_GetMainAction_MainCharacter_5;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBadStatusActionWaitTime_ReturnValue;   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBadStatusActionWaitTime_ReturnValue_1; // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoBadStatusAction_ActBadStatusSkillAction; // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoBadStatusAction_NeedToWaitProcess;      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoBadStatusAction_IsOverheatInterrupt;    // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBadStatusAction_ReturnValue;         // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckRecoveryFromBadStatus_ReturnValue;   // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPlayingEventScript_ReturnValue_2;    // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_5;                    // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExpireSupportStatus_ReturnValue;     // 0x017F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_BtlCharacterBase_C*                 CallFunc_GetMainAction_MainCharacter_6;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebug_ReturnValue_6;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_7;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_8;                    // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckKnockedoutHero_ReturnValue;          // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_9;                    // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 CallFunc_GetMainAction_MainCharacter_7;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckKnockedoutHero_ReturnValue_1;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSkipTurn_ReturnValue;                // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_10;                   // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequestEncountProcess_ReturnValue;        // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_11;                   // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBattleInProgress_ReturnValue;        // 0x01AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasEvent_Has_Event;                       // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasEvent_Has_Event_1;                     // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 CallFunc_GetMainAction_MainCharacter_8;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEnableActEndProc_ReturnValue;        // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEnableActEndEvent_ReturnValue;       // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_12;                   // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_13;                   // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckAnyInterruptProcessBetweenTurn_ReturnValue; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_14;                   // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBattleProgressToNextBattle_ReturnValue; // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D3[0x5];                                      // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_1;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebug_ReturnValue_15;                   // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_16;                   // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_6;          // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPlayingEventScript_ReturnValue_3;    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x023C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckInRush_ReturnValue;                  // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_17;                   // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPlayingEventScript_ReturnValue_4;    // 0x025E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25F[0x1];                                      // 0x025F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 CallFunc_GetMainAction_MainCharacter_9;            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsManualOperation_ReturnValue;            // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoSpecificAction_ReturnValue;             // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B[0x1];                                      // 0x026B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x026C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckEventBattleFinish_ReturnValue;       // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckSuspendTurnProgress_ReturnValue;     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0294(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDebug_ReturnValue_18;                   // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInterruptProcessEscape_ReturnValue;  // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A6[0x2];                                      // 0x02A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_12;           // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckEventBattleFinish_ReturnValue_1;     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting) == 0x000010, "Wrong alignment on BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting");
static_assert(sizeof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting) == 0x0002C0, "Wrong size on BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, EntryPoint) == 0x000000, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetMainAction_MainCharacter) == 0x000040, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetMainAction_MainCharacter' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetMainAction_MainCharacter_1) == 0x000048, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetMainAction_MainCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue) == 0x000050, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckGeneralAttackAnnihilation_ReturnValue) == 0x000051, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckGeneralAttackAnnihilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckShaffleTimeAllowed_ReturnValue) == 0x000052, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckShaffleTimeAllowed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_1) == 0x000053, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000054, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckPlayingEventScript_ReturnValue) == 0x000058, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckPlayingEventScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetInitialTransform_trans) == 0x000060, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetInitialTransform_trans' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_FinishSpawningActor_ReturnValue) == 0x000098, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckGeneralAttackAnnihilation_ReturnValue_1) == 0x0000A0, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckGeneralAttackAnnihilation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckPlayingEventScript_ReturnValue_1) == 0x0000A1, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckPlayingEventScript_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetMainAction_MainCharacter_2) == 0x0000A8, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetMainAction_MainCharacter_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_2) == 0x0000B0, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_3) == 0x0000B1, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_4) == 0x0000B2, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsValid_ReturnValue_1) == 0x0000B3, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetTargetsCylinder_Bottom_Center) == 0x0000B4, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetTargetsCylinder_Bottom_Center' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetTargetsCylinder_Radius) == 0x0000C0, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetTargetsCylinder_Radius' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetTargetsCylinder_Height) == 0x0000C4, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetTargetsCylinder_Height' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetTargetsCylinder_Cylinder_Center) == 0x0000C8, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetTargetsCylinder_Cylinder_Center' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_BreakVector_X) == 0x0000D4, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_BreakVector_Y) == 0x0000D8, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_BreakVector_Z) == 0x0000DC, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_MakeVector_ReturnValue) == 0x0000E0, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000F0, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetHero_ReturnValue) == 0x0000F8, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetEventMainAction_EventMainChara) == 0x000100, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetEventMainAction_EventMainChara' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_DynamicCast_AsBP_Btl_Character_Base) == 0x000108, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_DynamicCast_AsBP_Btl_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetMainAction_MainCharacter_3) == 0x000118, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetMainAction_MainCharacter_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_BtlFadeSync_ReturnValue) == 0x000120, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_BtlFadeSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetExpireSupportWaitTime_ReturnValue) == 0x000124, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetExpireSupportWaitTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckTurnFromGuardCancel_ReturnValue) == 0x000128, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckTurnFromGuardCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_Add_FloatFloat_ReturnValue) == 0x00012C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckRecoveryFromDown_ReturnValue) == 0x000130, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckRecoveryFromDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetMainAction_MainCharacter_4) == 0x000138, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetMainAction_MainCharacter_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetRecoveryWaitTime_ReturnValue) == 0x000140, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetRecoveryWaitTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetMainAction_MainCharacter_5) == 0x000148, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetMainAction_MainCharacter_5' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetBadStatusActionWaitTime_ReturnValue) == 0x000150, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetBadStatusActionWaitTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetBadStatusActionWaitTime_ReturnValue_1) == 0x000154, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetBadStatusActionWaitTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_DoBadStatusAction_ActBadStatusSkillAction) == 0x000158, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_DoBadStatusAction_ActBadStatusSkillAction' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_DoBadStatusAction_NeedToWaitProcess) == 0x000159, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_DoBadStatusAction_NeedToWaitProcess' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_DoBadStatusAction_IsOverheatInterrupt) == 0x00015A, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_DoBadStatusAction_IsOverheatInterrupt' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckBadStatusAction_ReturnValue) == 0x00015B, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckBadStatusAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_3) == 0x00015C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_4) == 0x00016C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckRecoveryFromBadStatus_ReturnValue) == 0x00017C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckRecoveryFromBadStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckPlayingEventScript_ReturnValue_2) == 0x00017D, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckPlayingEventScript_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_5) == 0x00017E, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckExpireSupportStatus_ReturnValue) == 0x00017F, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckExpireSupportStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetMainAction_MainCharacter_6) == 0x000180, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetMainAction_MainCharacter_6' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_6) == 0x000188, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_7) == 0x000189, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_8) == 0x00018A, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckKnockedoutHero_ReturnValue) == 0x00018B, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckKnockedoutHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_9) == 0x00018C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetMainAction_MainCharacter_7) == 0x000190, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetMainAction_MainCharacter_7' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckKnockedoutHero_ReturnValue_1) == 0x000198, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckKnockedoutHero_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckSkipTurn_ReturnValue) == 0x000199, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckSkipTurn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_5) == 0x00019C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_10) == 0x0001AC, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_RequestEncountProcess_ReturnValue) == 0x0001AD, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_RequestEncountProcess_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_11) == 0x0001AE, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckBattleInProgress_ReturnValue) == 0x0001AF, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckBattleInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsValid_ReturnValue_2) == 0x0001B0, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_HasEvent_Has_Event) == 0x0001B1, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_HasEvent_Has_Event' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsValid_ReturnValue_3) == 0x0001B2, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_HasEvent_Has_Event_1) == 0x0001B3, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_HasEvent_Has_Event_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetMainAction_MainCharacter_8) == 0x0001B8, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetMainAction_MainCharacter_8' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckEnableActEndProc_ReturnValue) == 0x0001C0, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckEnableActEndProc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckEnableActEndEvent_ReturnValue) == 0x0001C1, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckEnableActEndEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_12) == 0x0001C2, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_13) == 0x0001C3, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_BooleanAND_ReturnValue) == 0x0001C4, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0001C8, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x0001CC, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckAnyInterruptProcessBetweenTurn_ReturnValue) == 0x0001D0, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckAnyInterruptProcessBetweenTurn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_14) == 0x0001D1, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckBattleProgressToNextBattle_ReturnValue) == 0x0001D2, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckBattleProgressToNextBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, Temp_object_Variable) == 0x0001D8, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_DynamicCast_AsNiagara_System) == 0x0001E0, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_DynamicCast_bSuccess_1) == 0x0001E8, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CustomEvent_Loaded) == 0x0001F0, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, Temp_object_Variable_1) == 0x0001F8, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_DynamicCast_AsNiagara_System_1) == 0x000200, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_DynamicCast_AsNiagara_System_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_DynamicCast_bSuccess_2) == 0x000208, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x00020C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CustomEvent_Loaded_1) == 0x000210, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_15) == 0x000218, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_Divide_FloatFloat_ReturnValue_5) == 0x00021C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_Divide_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_6) == 0x000220, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_16) == 0x000230, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_Divide_FloatFloat_ReturnValue_6) == 0x000234, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_Divide_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckPlayingEventScript_ReturnValue_3) == 0x000238, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckPlayingEventScript_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_7) == 0x00023C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_8) == 0x00024C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckInRush_ReturnValue) == 0x00025C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckInRush_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_17) == 0x00025D, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckPlayingEventScript_ReturnValue_4) == 0x00025E, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckPlayingEventScript_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_GetMainAction_MainCharacter_9) == 0x000260, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_GetMainAction_MainCharacter_9' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsEnemy_ReturnValue) == 0x000268, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsManualOperation_ReturnValue) == 0x000269, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsManualOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_DoSpecificAction_ReturnValue) == 0x00026A, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_DoSpecificAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_9) == 0x00026C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckEventBattleFinish_ReturnValue) == 0x00027C, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckEventBattleFinish_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_10) == 0x000280, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckSuspendTurnProgress_ReturnValue) == 0x000290, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckSuspendTurnProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_11) == 0x000294, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_IsDebug_ReturnValue_18) == 0x0002A4, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_IsDebug_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckInterruptProcessEscape_ReturnValue) == 0x0002A5, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckInterruptProcessEscape_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, K2Node_CreateDelegate_OutputDelegate_12) == 0x0002A8, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting, CallFunc_CheckEventBattleFinish_ReturnValue_1) == 0x0002B8, "Member 'BP_BtlPhaseFighting_C_ExecuteUbergraph_BP_BtlPhaseFighting::CallFunc_CheckEventBattleFinish_ReturnValue_1' has a wrong offset!");

// Function BP_BtlPhaseFighting.BP_BtlPhaseFighting_C.OnLoaded_BEF8F5C44FEAA533FABD21BFFF755582
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlPhaseFighting_C_OnLoaded_BEF8F5C44FEAA533FABD21BFFF755582 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPhaseFighting_C_OnLoaded_BEF8F5C44FEAA533FABD21BFFF755582) == 0x000008, "Wrong alignment on BP_BtlPhaseFighting_C_OnLoaded_BEF8F5C44FEAA533FABD21BFFF755582");
static_assert(sizeof(BP_BtlPhaseFighting_C_OnLoaded_BEF8F5C44FEAA533FABD21BFFF755582) == 0x000008, "Wrong size on BP_BtlPhaseFighting_C_OnLoaded_BEF8F5C44FEAA533FABD21BFFF755582");
static_assert(offsetof(BP_BtlPhaseFighting_C_OnLoaded_BEF8F5C44FEAA533FABD21BFFF755582, Loaded) == 0x000000, "Member 'BP_BtlPhaseFighting_C_OnLoaded_BEF8F5C44FEAA533FABD21BFFF755582::Loaded' has a wrong offset!");

// Function BP_BtlPhaseFighting.BP_BtlPhaseFighting_C.OnLoaded_89C338DF41743B3A060FCBAB8ED6F29A
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlPhaseFighting_C_OnLoaded_89C338DF41743B3A060FCBAB8ED6F29A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPhaseFighting_C_OnLoaded_89C338DF41743B3A060FCBAB8ED6F29A) == 0x000008, "Wrong alignment on BP_BtlPhaseFighting_C_OnLoaded_89C338DF41743B3A060FCBAB8ED6F29A");
static_assert(sizeof(BP_BtlPhaseFighting_C_OnLoaded_89C338DF41743B3A060FCBAB8ED6F29A) == 0x000008, "Wrong size on BP_BtlPhaseFighting_C_OnLoaded_89C338DF41743B3A060FCBAB8ED6F29A");
static_assert(offsetof(BP_BtlPhaseFighting_C_OnLoaded_89C338DF41743B3A060FCBAB8ED6F29A, Loaded) == 0x000000, "Member 'BP_BtlPhaseFighting_C_OnLoaded_89C338DF41743B3A060FCBAB8ED6F29A::Loaded' has a wrong offset!");

// Function BP_BtlPhaseFighting.BP_BtlPhaseFighting_C.GetNextPhaseInBP
// 0x0100 (0x0100 - 0x0000)
struct BP_BtlPhaseFighting_C_GetNextPhaseInBP final
{
public:
	class ABtlPhase*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlPhase*                              Actor;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSubLevelActor_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
