#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlResources

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FBtlGuiResourcesItem_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlResources.BP_BtlResources_C.ExecuteUbergraph_BP_BtlResources
// 0x03B0 (0x03B0 - 0x0000)
struct BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_MathExpression_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_name;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_object;                         // 0x0020(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x00C8(0x0010)(ReferenceParm)
	class ABP_BtlGuiCore_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue_1;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetResources_ReturnValue;                 // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetResources_ReturnValue_1;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_1;                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetResources_ReturnValue_2;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_2;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_3;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0148(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFBtlGuiResourcesItem                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0160(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetResources_ReturnValue_3;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_4;                 // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x01B8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class FName                                   CallFunc_Map_Find_Value;                           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0214(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UDataTable>              CallFunc_Map_Find_Value_1;                         // 0x0220(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetResources_ReturnValue_4;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_5;                 // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetResources_ReturnValue_5;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_6;                 // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetResources_ReturnValue_6;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_7;                 // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetResources_ReturnValue_7;               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_8;                 // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetResources_ReturnValue_8;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetResources_ReturnValue_9;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_9;                 // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_10;                // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB[0x5];                                      // 0x02DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetResources_ReturnValue_10;              // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetResources_ReturnValue_11;              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_11;                // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_12;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B[0x1];                                      // 0x030B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetResources_ReturnValue_12;              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_13;                // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_323[0x1];                                      // 0x0323(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetResources_ReturnValue_13;              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_14;                // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A[0x2];                                      // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x033C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetResources_ReturnValue_14;              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_15;                // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetResources_ReturnValue_15;              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetResources_ReturnValue_16;              // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_16;                // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_17;                // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_393[0x5];                                      // 0x0393(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetResources_ReturnValue_17;              // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table_18;                // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources) == 0x000010, "Wrong alignment on BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources");
static_assert(sizeof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources) == 0x0003B0, "Wrong size on BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, EntryPoint) == 0x000000, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_MathExpression_ReturnValue) == 0x000014, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_CustomEvent_name) == 0x000018, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_CustomEvent_name' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_CustomEvent_object) == 0x000020, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_CustomEvent_object' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Conv_NameToString_ReturnValue) == 0x000050, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, Temp_object_Variable) == 0x000070, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Map_Length_ReturnValue) == 0x000078, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00007C, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_Event_DeltaSeconds) == 0x000080, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Map_Keys_Keys) == 0x0000C8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Map_Length_ReturnValue_1) == 0x0000E4, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Map_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_CustomEvent_Loaded_1) == 0x0000E8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue) == 0x0000F0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_1) == 0x0000F8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table) == 0x000100, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_1) == 0x000110, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue) == 0x000119, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_1) == 0x00011A, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_2) == 0x000120, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_2) == 0x000128, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_2' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_3) == 0x000138, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_3' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_3) == 0x000140, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000148, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Array_Length_ReturnValue_1) == 0x000158, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetDataTableRowFromName_OutRow) == 0x000160, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000188, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_2) == 0x000189, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_CustomEvent_Loaded) == 0x000190, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_3) == 0x000198, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, Temp_object_Variable_1) == 0x0001A0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_4) == 0x0001A8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_4' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_4) == 0x0001B0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0001B8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Map_Find_Value) == 0x0001E0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Map_Find_ReturnValue) == 0x0001E8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_3) == 0x0001E9, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0001F0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000200, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, Temp_int_Array_Index_Variable) == 0x000210, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Array_Get_Item) == 0x000214, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Map_Find_Value_1) == 0x000220, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Map_Find_ReturnValue_1) == 0x000248, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_4) == 0x000250, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_5) == 0x000258, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_5' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_5) == 0x000260, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_4) == 0x000261, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_5) == 0x000268, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_6) == 0x000270, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_6' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_6) == 0x000278, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_5) == 0x000279, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_6) == 0x000280, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_7) == 0x000288, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_7' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_7) == 0x000290, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_6) == 0x000291, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_7) == 0x000298, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_8) == 0x0002A0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_8' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_8) == 0x0002A8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_7) == 0x0002A9, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_8) == 0x0002B0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_9) == 0x0002B8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_9) == 0x0002C0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_9' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_9) == 0x0002C8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_10) == 0x0002D0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_10' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_10) == 0x0002D8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_8) == 0x0002D9, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_9) == 0x0002DA, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_10) == 0x0002E0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_11) == 0x0002E8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_11) == 0x0002F0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_11' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_11) == 0x0002F8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_12) == 0x000300, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_12' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_12) == 0x000308, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_10) == 0x000309, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_11) == 0x00030A, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, Temp_int_Loop_Counter_Variable) == 0x00030C, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_12) == 0x000310, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_13) == 0x000318, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_13' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_13) == 0x000320, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_12) == 0x000321, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Less_IntInt_ReturnValue_1) == 0x000322, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_Add_IntInt_ReturnValue) == 0x000324, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_13) == 0x000328, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_14) == 0x000330, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_14' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_14) == 0x000338, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_13) == 0x000339, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_CreateDelegate_OutputDelegate_1) == 0x00033C, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_14) == 0x000350, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_15) == 0x000358, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_15' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_15) == 0x000360, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_14) == 0x000361, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_15) == 0x000368, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_16) == 0x000370, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_16) == 0x000378, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_16' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_16) == 0x000380, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_17) == 0x000388, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_17' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_17) == 0x000390, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_15) == 0x000391, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_16) == 0x000392, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_GetResources_ReturnValue_17) == 0x000398, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_GetResources_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_AsData_Table_18) == 0x0003A0, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_AsData_Table_18' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, K2Node_DynamicCast_bSuccess_18) == 0x0003A8, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources, CallFunc_IsValid_ReturnValue_17) == 0x0003A9, "Member 'BP_BtlResources_C_ExecuteUbergraph_BP_BtlResources::CallFunc_IsValid_ReturnValue_17' has a wrong offset!");

// Function BP_BtlResources.BP_BtlResources_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlResources_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResources_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BtlResources_C_ReceiveTick");
static_assert(sizeof(BP_BtlResources_C_ReceiveTick) == 0x000004, "Wrong size on BP_BtlResources_C_ReceiveTick");
static_assert(offsetof(BP_BtlResources_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BtlResources_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BtlResources.BP_BtlResources_C.StartAsyncLoad
// 0x0030 (0x0030 - 0x0000)
struct BP_BtlResources_C_StartAsyncLoad final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Object;                                            // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResources_C_StartAsyncLoad) == 0x000008, "Wrong alignment on BP_BtlResources_C_StartAsyncLoad");
static_assert(sizeof(BP_BtlResources_C_StartAsyncLoad) == 0x000030, "Wrong size on BP_BtlResources_C_StartAsyncLoad");
static_assert(offsetof(BP_BtlResources_C_StartAsyncLoad, Name_0) == 0x000000, "Member 'BP_BtlResources_C_StartAsyncLoad::Name_0' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_StartAsyncLoad, Object) == 0x000008, "Member 'BP_BtlResources_C_StartAsyncLoad::Object' has a wrong offset!");

// Function BP_BtlResources.BP_BtlResources_C.OnLoaded_6DFADC06409FB0418EC1A895E4E1917B
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResources_C_OnLoaded_6DFADC06409FB0418EC1A895E4E1917B final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResources_C_OnLoaded_6DFADC06409FB0418EC1A895E4E1917B) == 0x000008, "Wrong alignment on BP_BtlResources_C_OnLoaded_6DFADC06409FB0418EC1A895E4E1917B");
static_assert(sizeof(BP_BtlResources_C_OnLoaded_6DFADC06409FB0418EC1A895E4E1917B) == 0x000008, "Wrong size on BP_BtlResources_C_OnLoaded_6DFADC06409FB0418EC1A895E4E1917B");
static_assert(offsetof(BP_BtlResources_C_OnLoaded_6DFADC06409FB0418EC1A895E4E1917B, Loaded) == 0x000000, "Member 'BP_BtlResources_C_OnLoaded_6DFADC06409FB0418EC1A895E4E1917B::Loaded' has a wrong offset!");

// Function BP_BtlResources.BP_BtlResources_C.OnLoaded_273DF4C1444957F20AC0F98FF3B04DC0
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResources_C_OnLoaded_273DF4C1444957F20AC0F98FF3B04DC0 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResources_C_OnLoaded_273DF4C1444957F20AC0F98FF3B04DC0) == 0x000008, "Wrong alignment on BP_BtlResources_C_OnLoaded_273DF4C1444957F20AC0F98FF3B04DC0");
static_assert(sizeof(BP_BtlResources_C_OnLoaded_273DF4C1444957F20AC0F98FF3B04DC0) == 0x000008, "Wrong size on BP_BtlResources_C_OnLoaded_273DF4C1444957F20AC0F98FF3B04DC0");
static_assert(offsetof(BP_BtlResources_C_OnLoaded_273DF4C1444957F20AC0F98FF3B04DC0, Loaded) == 0x000000, "Member 'BP_BtlResources_C_OnLoaded_273DF4C1444957F20AC0F98FF3B04DC0::Loaded' has a wrong offset!");

// Function BP_BtlResources.BP_BtlResources_C.GetResources
// 0x0048 (0x0048 - 0x0000)
struct BP_BtlResources_C_GetResources final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                NULLL;                                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlResources_C_GetResources) == 0x000008, "Wrong alignment on BP_BtlResources_C_GetResources");
static_assert(sizeof(BP_BtlResources_C_GetResources) == 0x000048, "Wrong size on BP_BtlResources_C_GetResources");
static_assert(offsetof(BP_BtlResources_C_GetResources, Name_0) == 0x000000, "Member 'BP_BtlResources_C_GetResources::Name_0' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_GetResources, ReturnValue) == 0x000008, "Member 'BP_BtlResources_C_GetResources::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_GetResources, NULLL) == 0x000010, "Member 'BP_BtlResources_C_GetResources::NULLL' has a wrong offset!");
static_assert(offsetof(BP_BtlResources_C_GetResources, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BP_BtlResources_C_GetResources::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
