#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlResidentDataComp

#include "Basic.hpp"

#include "Xrd777_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.ExecuteUbergraph_BP_BtlResidentDataComp
// 0x0298 (0x0298 - 0x0000)
struct BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_12;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_11;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_10;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_2;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_9;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_3;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_8;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_4;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_7;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_5;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_5;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_6;                       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_6;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_6;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_7;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_7;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_137[0x1];                                      // 0x0137(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_8;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_8;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_9;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_9;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_10;                           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_10;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_11;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_11;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_12;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_12;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x01DC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x01EC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x01FC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x020C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x0224(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x0234(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_9;            // 0x0254(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_10;           // 0x0264(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_11;           // 0x0274(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_12;           // 0x0284(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp");
static_assert(sizeof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp) == 0x000298, "Wrong size on BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, EntryPoint) == 0x000000, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_12) == 0x000018, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_12' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable) == 0x000020, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System) == 0x000028, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_11) == 0x000038, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_11' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_1) == 0x000040, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_1) == 0x000048, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_10) == 0x000058, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_10' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_2) == 0x000060, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_2) == 0x000068, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_2' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_9) == 0x000078, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_9' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_3) == 0x000080, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_3) == 0x000088, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_3' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_8) == 0x000098, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_8' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_4) == 0x0000A0, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_4) == 0x0000A8, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_4' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_4) == 0x0000B0, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_7) == 0x0000B8, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_7' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_5) == 0x0000C0, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_5) == 0x0000C8, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_5' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_5) == 0x0000D0, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_6) == 0x0000D8, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_6' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_6) == 0x0000E0, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_6) == 0x0000E8, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_6' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_6) == 0x0000F0, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_5) == 0x0000F8, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_7) == 0x000100, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_7) == 0x000108, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_7' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_7) == 0x000110, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_1) == 0x000114, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_int_Variable) == 0x000124, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, CallFunc_Conv_IntToByte_ReturnValue) == 0x000128, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, CallFunc_GetValidValue_ReturnValue) == 0x000129, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_int_Variable_1) == 0x00012C, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, CallFunc_Add_IntInt_ReturnValue) == 0x000130, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_SwitchEnum_CmpSuccess) == 0x000134, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000135, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000136, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_4) == 0x000138, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000140, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_8) == 0x000148, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_8) == 0x000150, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_8' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_8) == 0x000158, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_3) == 0x000160, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_9) == 0x000168, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_9) == 0x000170, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_9' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_9) == 0x000178, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_2) == 0x000180, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_10) == 0x000188, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_10) == 0x000190, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_10' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_10) == 0x000198, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded_1) == 0x0001A0, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_11) == 0x0001A8, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_11) == 0x0001B0, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_11' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_11) == 0x0001B8, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CustomEvent_Loaded) == 0x0001C0, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, Temp_object_Variable_12) == 0x0001C8, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_AsNiagara_System_12) == 0x0001D0, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_AsNiagara_System_12' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_DynamicCast_bSuccess_12) == 0x0001D8, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001DC, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001EC, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001FC, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_5) == 0x00020C, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, CallFunc_MakeLiteralInt_ReturnValue) == 0x00021C, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, CallFunc_Less_IntInt_ReturnValue) == 0x000220, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_6) == 0x000224, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_7) == 0x000234, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_8) == 0x000244, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_9) == 0x000254, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_10) == 0x000264, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_11) == 0x000274, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp, K2Node_CreateDelegate_OutputDelegate_12) == 0x000284, "Member 'BP_BtlResidentDataComp_C_ExecuteUbergraph_BP_BtlResidentDataComp::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B9442142DF0
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9442142DF0 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9442142DF0) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9442142DF0");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9442142DF0) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9442142DF0");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9442142DF0, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9442142DF0::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B9491BD2D61
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9491BD2D61 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9491BD2D61) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9491BD2D61");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9491BD2D61) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9491BD2D61");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9491BD2D61, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9491BD2D61::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B94ECB4AD37
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94ECB4AD37 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94ECB4AD37) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94ECB4AD37");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94ECB4AD37) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94ECB4AD37");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94ECB4AD37, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94ECB4AD37::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B94E0CFAA77
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94E0CFAA77 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94E0CFAA77) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94E0CFAA77");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94E0CFAA77) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94E0CFAA77");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94E0CFAA77, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94E0CFAA77::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B943C8EF7D3
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B943C8EF7D3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B943C8EF7D3) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B943C8EF7D3");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B943C8EF7D3) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B943C8EF7D3");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B943C8EF7D3, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B943C8EF7D3::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B941C796B3E
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B941C796B3E final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B941C796B3E) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B941C796B3E");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B941C796B3E) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B941C796B3E");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B941C796B3E, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B941C796B3E::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B94343FC687
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94343FC687 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94343FC687) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94343FC687");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94343FC687) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94343FC687");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94343FC687, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94343FC687::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B94393B7AFD
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94393B7AFD final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94393B7AFD) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94393B7AFD");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94393B7AFD) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94393B7AFD");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94393B7AFD, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94393B7AFD::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B9451E033A8
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9451E033A8 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9451E033A8) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9451E033A8");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9451E033A8) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9451E033A8");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9451E033A8, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9451E033A8::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B94F82B107D
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94F82B107D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94F82B107D) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94F82B107D");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94F82B107D) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94F82B107D");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94F82B107D, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94F82B107D::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B94846FB045
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94846FB045 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94846FB045) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94846FB045");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94846FB045) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94846FB045");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94846FB045, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94846FB045::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B94547F5CA5
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94547F5CA5 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94547F5CA5) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94547F5CA5");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94547F5CA5) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94547F5CA5");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94547F5CA5, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B94547F5CA5::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.OnLoaded_8537D89D49349AFF693E8B9422923015
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9422923015 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9422923015) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9422923015");
static_assert(sizeof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9422923015) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9422923015");
static_assert(offsetof(BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9422923015, Loaded) == 0x000000, "Member 'BP_BtlResidentDataComp_C_OnLoaded_8537D89D49349AFF693E8B9422923015::Loaded' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.GetSummonFX
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlResidentDataComp_C_GetSummonFX final
{
public:
	class UNiagaraSystem*                         SummonFX;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_GetSummonFX) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_GetSummonFX");
static_assert(sizeof(BP_BtlResidentDataComp_C_GetSummonFX) == 0x000008, "Wrong size on BP_BtlResidentDataComp_C_GetSummonFX");
static_assert(offsetof(BP_BtlResidentDataComp_C_GetSummonFX, SummonFX) == 0x000000, "Member 'BP_BtlResidentDataComp_C_GetSummonFX::SummonFX' has a wrong offset!");

// Function BP_BtlResidentDataComp.BP_BtlResidentDataComp_C.GetStatusEffect
// 0x00A0 (0x00A0 - 0x0000)
struct BP_BtlResidentDataComp_C_GetStatusEffect final
{
public:
	EBtlBadStatusIcon                             Index_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          SoftObj;                                           // 0x0008(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	EBtlBadStatusIcon                             Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          CallFunc_Array_Get_Item;                           // 0x0078(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlResidentDataComp_C_GetStatusEffect) == 0x000008, "Wrong alignment on BP_BtlResidentDataComp_C_GetStatusEffect");
static_assert(sizeof(BP_BtlResidentDataComp_C_GetStatusEffect) == 0x0000A0, "Wrong size on BP_BtlResidentDataComp_C_GetStatusEffect");
static_assert(offsetof(BP_BtlResidentDataComp_C_GetStatusEffect, Index_0) == 0x000000, "Member 'BP_BtlResidentDataComp_C_GetStatusEffect::Index_0' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_GetStatusEffect, SoftObj) == 0x000008, "Member 'BP_BtlResidentDataComp_C_GetStatusEffect::SoftObj' has a wrong offset!");
static_assert(offsetof(BP_BtlResidentDataComp_C_GetStatusEffect, Temp_byte_Variable) == 0x000030, "Member 'BP_BtlResidentDataComp_C_GetStatusEffect::Temp_byte_Variable' has a wrong offset!");
