#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiCapture

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlGuiCapture.BP_BtlGuiCapture_C.ExecuteUbergraph_BP_BtlGuiCapture
// 0x0130 (0x0130 - 0x0000)
struct BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetAppRenderTarget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetInitialTransform_trans;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_deltaTime;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0xC];                                       // 0x00D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlGuiSceneCapture2D_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture) == 0x000010, "Wrong alignment on BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture");
static_assert(sizeof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture) == 0x000130, "Wrong size on BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, EntryPoint) == 0x000000, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_GetAppRenderTarget_ReturnValue) == 0x000008, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_GetAppRenderTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_GetInitialTransform_trans) == 0x000010, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_GetInitialTransform_trans' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, K2Node_Event_deltaTime) == 0x000054, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::K2Node_Event_deltaTime' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_BreakTransform_Location) == 0x000090, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_BreakTransform_Rotation) == 0x00009C, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_BreakTransform_Scale) == 0x0000A8, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_IsValid_ReturnValue_1) == 0x0000B4, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000B5, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000B6, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x0000B7, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_BooleanAND_ReturnValue) == 0x0000B8, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x0000B9, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_BooleanAND_ReturnValue_1) == 0x0000BA, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_BooleanAND_ReturnValue_2) == 0x0000BB, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_SelectVector_ReturnValue) == 0x0000BC, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C8, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_BooleanAND_ReturnValue_3) == 0x000110, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_IsValid_ReturnValue_2) == 0x000111, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000118, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture, CallFunc_FinishSpawningActor_ReturnValue) == 0x000120, "Member 'BP_BtlGuiCapture_C_ExecuteUbergraph_BP_BtlGuiCapture::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_BtlGuiCapture.BP_BtlGuiCapture_C.GuiActorUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlGuiCapture_C_GuiActorUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiCapture_C_GuiActorUpdate) == 0x000004, "Wrong alignment on BP_BtlGuiCapture_C_GuiActorUpdate");
static_assert(sizeof(BP_BtlGuiCapture_C_GuiActorUpdate) == 0x000004, "Wrong size on BP_BtlGuiCapture_C_GuiActorUpdate");
static_assert(offsetof(BP_BtlGuiCapture_C_GuiActorUpdate, DeltaTime) == 0x000000, "Member 'BP_BtlGuiCapture_C_GuiActorUpdate::DeltaTime' has a wrong offset!");

// Function BP_BtlGuiCapture.BP_BtlGuiCapture_C.SetCaptureEnable
// 0x0001 (0x0001 - 0x0000)
struct BP_BtlGuiCapture_C_SetCaptureEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlGuiCapture_C_SetCaptureEnable) == 0x000001, "Wrong alignment on BP_BtlGuiCapture_C_SetCaptureEnable");
static_assert(sizeof(BP_BtlGuiCapture_C_SetCaptureEnable) == 0x000001, "Wrong size on BP_BtlGuiCapture_C_SetCaptureEnable");
static_assert(offsetof(BP_BtlGuiCapture_C_SetCaptureEnable, Enable) == 0x000000, "Member 'BP_BtlGuiCapture_C_SetCaptureEnable::Enable' has a wrong offset!");

}

