#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlStatusEffectCoordinator

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BtlStatusEffectCoordinator.BP_BtlStatusEffectCoordinator_C.ExecuteUbergraph_BP_BtlStatusEffectCoordinator
// 0x0098 (0x0098 - 0x0000)
struct BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          CallFunc_GetStatusEffect_SoftObj;                  // 0x0038(0x0028)(HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBadStatusSocket_SocketName;            // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlEffectIcon_C*                    CallFunc_CreateEffectAtSocket_Parent;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_CreateEffectAtSocket_NiagaraEffect;       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExistStatusEffectRequestList_ReturnValue; // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator) == 0x000008, "Wrong alignment on BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator");
static_assert(sizeof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator) == 0x000098, "Wrong size on BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, EntryPoint) == 0x000000, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, Temp_object_Variable) == 0x000008, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, K2Node_DynamicCast_AsNiagara_System) == 0x000018, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, K2Node_CustomEvent_Loaded) == 0x000028, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000031, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, CallFunc_IsValid_ReturnValue_2) == 0x000032, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, CallFunc_GetStatusEffect_SoftObj) == 0x000038, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::CallFunc_GetStatusEffect_SoftObj' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000070, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, Temp_bool_IsClosed_Variable) == 0x000071, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, CallFunc_GetBadStatusSocket_SocketName) == 0x000074, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::CallFunc_GetBadStatusSocket_SocketName' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, CallFunc_CreateEffectAtSocket_Parent) == 0x000080, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::CallFunc_CreateEffectAtSocket_Parent' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, CallFunc_CreateEffectAtSocket_NiagaraEffect) == 0x000088, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::CallFunc_CreateEffectAtSocket_NiagaraEffect' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, CallFunc_IsValid_ReturnValue_3) == 0x000090, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator, CallFunc_CheckExistStatusEffectRequestList_ReturnValue) == 0x000091, "Member 'BP_BtlStatusEffectCoordinator_C_ExecuteUbergraph_BP_BtlStatusEffectCoordinator::CallFunc_CheckExistStatusEffectRequestList_ReturnValue' has a wrong offset!");

// Function BP_BtlStatusEffectCoordinator.BP_BtlStatusEffectCoordinator_C.OnLoaded_997451214973A26A4BC6A996F64D8421
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlStatusEffectCoordinator_C_OnLoaded_997451214973A26A4BC6A996F64D8421 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlStatusEffectCoordinator_C_OnLoaded_997451214973A26A4BC6A996F64D8421) == 0x000008, "Wrong alignment on BP_BtlStatusEffectCoordinator_C_OnLoaded_997451214973A26A4BC6A996F64D8421");
static_assert(sizeof(BP_BtlStatusEffectCoordinator_C_OnLoaded_997451214973A26A4BC6A996F64D8421) == 0x000008, "Wrong size on BP_BtlStatusEffectCoordinator_C_OnLoaded_997451214973A26A4BC6A996F64D8421");
static_assert(offsetof(BP_BtlStatusEffectCoordinator_C_OnLoaded_997451214973A26A4BC6A996F64D8421, Loaded) == 0x000000, "Member 'BP_BtlStatusEffectCoordinator_C_OnLoaded_997451214973A26A4BC6A996F64D8421::Loaded' has a wrong offset!");

}

