#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_BtlGuiBaseActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlGuard.BP_BtlGuard_C
// 0x0130 (0x0480 - 0x0350)
class ABP_BtlGuard_C final : public ABP_BtlGuiBaseActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BtlGuard_C;                      // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBtlGuiDrawComponent*                   BtlGuiDraw1;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiResources*                       BtlGuiResources;                                   // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlDataBaseComponent*                  BtlDataBase;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawComponent*                   BtlGuiDraw;                                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         EndTimeline_butonScale_585C45794638CE0A0C72A88BDF1B757B; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndTimeline_Rate_585C45794638CE0A0C72A88BDF1B757B; // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EndTimeline__Direction_585C45794638CE0A0C72A88BDF1B757B; // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EndTimeline;                                       // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartTimeline_TextSpeed_085BD9854548134D1EA41C80FDBE783E; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartTimeline_Rate_085BD9854548134D1EA41C80FDBE783E; // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            StartTimeline__Direction_085BD9854548134D1EA41C80FDBE783E; // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     StartTimeline;                                     // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              B;                                                 // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              A;                                                 // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Caustics;                                          // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      LeftUpList;                                        // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      RightDownList;                                     // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Rate;                                              // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBtlGuiDrawObjectCore*>          Triangle1ObjList;                                  // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UBtlGuiDrawObjectCore*>          Triangle2ObjList;                                  // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Float;                                             // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Triangle1Rate;                                     // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 Triangle2Rate;                                     // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Normal;                                            // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Buton_Scale;                                       // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DecideKeyCross;                                    // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CrossObj;                                          // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectSprite*                CircleObj;                                         // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOK;                                              // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Text_Speed;                                        // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GebugType;                                         // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBtlGuiDrawObjectCore*>          Triangle1ObjListask;                               // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UBtlGuiDrawObjectCore*>          Triangle2ObjListMask;                              // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_BtlGuard(int32 EntryPoint);
	void GuiActorUpdate(float DeltaTime);
	void GuiActorStateInit(bool Flag, int32 Param);
	void GuiActorBeginPlay();
	void GuiActorUnbindAction();
	void GuiActorBindAction();
	void CallCANCEL();
	void CallOK();
	void CallEndTimeline();
	void CallStartTimeline();
	void EndTimeline__UpdateFunc();
	void EndTimeline__FinishedFunc();
	void StartTimeline__UpdateFunc();
	void StartTimeline__FinishedFunc();
	void UnbindAllAction();
	void CalcTriangle1OffsetVec(struct FVector2D* Vec);
	void CalcTriangle2OffsetVec(struct FVector2D* Vec);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlGuard_C">();
	}
	static class ABP_BtlGuard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlGuard_C>();
	}
};
static_assert(alignof(ABP_BtlGuard_C) == 0x000008, "Wrong alignment on ABP_BtlGuard_C");
static_assert(sizeof(ABP_BtlGuard_C) == 0x000480, "Wrong size on ABP_BtlGuard_C");
static_assert(offsetof(ABP_BtlGuard_C, UberGraphFrame_BP_BtlGuard_C) == 0x000350, "Member 'ABP_BtlGuard_C::UberGraphFrame_BP_BtlGuard_C' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, BtlGuiDraw1) == 0x000358, "Member 'ABP_BtlGuard_C::BtlGuiDraw1' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, BtlGuiResources) == 0x000360, "Member 'ABP_BtlGuard_C::BtlGuiResources' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, BtlDataBase) == 0x000368, "Member 'ABP_BtlGuard_C::BtlDataBase' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, BtlGuiDraw) == 0x000370, "Member 'ABP_BtlGuard_C::BtlGuiDraw' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, EndTimeline_butonScale_585C45794638CE0A0C72A88BDF1B757B) == 0x000378, "Member 'ABP_BtlGuard_C::EndTimeline_butonScale_585C45794638CE0A0C72A88BDF1B757B' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, EndTimeline_Rate_585C45794638CE0A0C72A88BDF1B757B) == 0x00037C, "Member 'ABP_BtlGuard_C::EndTimeline_Rate_585C45794638CE0A0C72A88BDF1B757B' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, EndTimeline__Direction_585C45794638CE0A0C72A88BDF1B757B) == 0x000380, "Member 'ABP_BtlGuard_C::EndTimeline__Direction_585C45794638CE0A0C72A88BDF1B757B' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, EndTimeline) == 0x000388, "Member 'ABP_BtlGuard_C::EndTimeline' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, StartTimeline_TextSpeed_085BD9854548134D1EA41C80FDBE783E) == 0x000390, "Member 'ABP_BtlGuard_C::StartTimeline_TextSpeed_085BD9854548134D1EA41C80FDBE783E' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, StartTimeline_Rate_085BD9854548134D1EA41C80FDBE783E) == 0x000394, "Member 'ABP_BtlGuard_C::StartTimeline_Rate_085BD9854548134D1EA41C80FDBE783E' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, StartTimeline__Direction_085BD9854548134D1EA41C80FDBE783E) == 0x000398, "Member 'ABP_BtlGuard_C::StartTimeline__Direction_085BD9854548134D1EA41C80FDBE783E' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, StartTimeline) == 0x0003A0, "Member 'ABP_BtlGuard_C::StartTimeline' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, B) == 0x0003A8, "Member 'ABP_BtlGuard_C::B' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, A) == 0x0003B0, "Member 'ABP_BtlGuard_C::A' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Caustics) == 0x0003B8, "Member 'ABP_BtlGuard_C::Caustics' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, LeftUpList) == 0x0003C0, "Member 'ABP_BtlGuard_C::LeftUpList' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, RightDownList) == 0x0003D0, "Member 'ABP_BtlGuard_C::RightDownList' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Rate) == 0x0003E0, "Member 'ABP_BtlGuard_C::Rate' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Triangle1ObjList) == 0x0003E8, "Member 'ABP_BtlGuard_C::Triangle1ObjList' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Triangle2ObjList) == 0x0003F8, "Member 'ABP_BtlGuard_C::Triangle2ObjList' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Float) == 0x000408, "Member 'ABP_BtlGuard_C::Float' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Triangle1Rate) == 0x000410, "Member 'ABP_BtlGuard_C::Triangle1Rate' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Triangle2Rate) == 0x000420, "Member 'ABP_BtlGuard_C::Triangle2Rate' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Normal) == 0x000430, "Member 'ABP_BtlGuard_C::Normal' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Buton_Scale) == 0x000434, "Member 'ABP_BtlGuard_C::Buton_Scale' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, DecideKeyCross) == 0x000438, "Member 'ABP_BtlGuard_C::DecideKeyCross' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, CrossObj) == 0x000440, "Member 'ABP_BtlGuard_C::CrossObj' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, CircleObj) == 0x000448, "Member 'ABP_BtlGuard_C::CircleObj' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, IsOK) == 0x000450, "Member 'ABP_BtlGuard_C::IsOK' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Text_Speed) == 0x000454, "Member 'ABP_BtlGuard_C::Text_Speed' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, GebugType) == 0x000458, "Member 'ABP_BtlGuard_C::GebugType' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Triangle1ObjListask) == 0x000460, "Member 'ABP_BtlGuard_C::Triangle1ObjListask' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuard_C, Triangle2ObjListMask) == 0x000470, "Member 'ABP_BtlGuard_C::Triangle2ObjListMask' has a wrong offset!");

}

