#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiOneMore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_BtlGuiBaseActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlGuiOneMore.BP_BtlGuiOneMore_C
// 0x00E0 (0x0430 - 0x0350)
class ABP_BtlGuiOneMore_C final : public ABP_BtlGuiBaseActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BtlGuiOneMore_C;                 // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBtlGuiResources*                       BtlGuiResources;                                   // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawComponent*                   BtlGuiDraw;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OnemoreTimeline_Triangle4_183F66EE4C9887FB0BA401B86442E94A; // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OnemoreTimeline_Triangle5_183F66EE4C9887FB0BA401B86442E94A; // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnemoreTimeline_Line_183F66EE4C9887FB0BA401B86442E94A; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnemoreTimeline_Text_183F66EE4C9887FB0BA401B86442E94A; // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnemoreTimeline_riangle6_183F66EE4C9887FB0BA401B86442E94A; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnemoreTimeline_PointB_183F66EE4C9887FB0BA401B86442E94A; // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OnemoreTimeline__Direction_183F66EE4C9887FB0BA401B86442E94A; // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OnemoreTimeline;                                   // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnemy;                                           // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LifeTime;                                          // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PointA;                                            // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PointB;                                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Triangle6;                                         // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectPlg*                   Obj5;                                              // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Triangle5;                                         // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectPlg*                   Obj4;                                              // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Point_B;                                           // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Riangle_6;                                         // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Triangle_5;                                        // 0x03E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Triangle_4;                                        // 0x03EC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectPlg*                   Obj3;                                              // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectPlg*                   Obj2;                                              // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Text;                                              // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPanel*                 Obj1;                                              // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Line;                                              // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TextSize;                                          // 0x041C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Triangle5Size;                                     // 0x0424(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BtlGuiOneMore(int32 EntryPoint);
	void GuiActorUpdate(float DeltaTime);
	void GuiActorBeginPlay();
	void TimelineStart();
	void OnemoreTimeline__UpdateFunc();
	void OnemoreTimeline__FinishedFunc();
	void SetParam(bool IsEnemy_0, float LifeTime_0);
	void UpdatePointB(float Rate);
	void UpdateTriangle6(float Rate);
	void UpdateTriangle5Scale(float Rate);
	void UpdateTriangle5Angle(float Rate);
	void UpdateTriangle4Scale(float Rate);
	void UpdateTriangle4Angle(float Rate);
	void UpdateTriangle4Pos(float Rate);
	void UpdateTTextScale(float Rate);
	void UpdateLine(float Rate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlGuiOneMore_C">();
	}
	static class ABP_BtlGuiOneMore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlGuiOneMore_C>();
	}
};
static_assert(alignof(ABP_BtlGuiOneMore_C) == 0x000008, "Wrong alignment on ABP_BtlGuiOneMore_C");
static_assert(sizeof(ABP_BtlGuiOneMore_C) == 0x000430, "Wrong size on ABP_BtlGuiOneMore_C");
static_assert(offsetof(ABP_BtlGuiOneMore_C, UberGraphFrame_BP_BtlGuiOneMore_C) == 0x000350, "Member 'ABP_BtlGuiOneMore_C::UberGraphFrame_BP_BtlGuiOneMore_C' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, BtlGuiResources) == 0x000358, "Member 'ABP_BtlGuiOneMore_C::BtlGuiResources' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, BtlGuiDraw) == 0x000360, "Member 'ABP_BtlGuiOneMore_C::BtlGuiDraw' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, OnemoreTimeline_Triangle4_183F66EE4C9887FB0BA401B86442E94A) == 0x000368, "Member 'ABP_BtlGuiOneMore_C::OnemoreTimeline_Triangle4_183F66EE4C9887FB0BA401B86442E94A' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, OnemoreTimeline_Triangle5_183F66EE4C9887FB0BA401B86442E94A) == 0x000374, "Member 'ABP_BtlGuiOneMore_C::OnemoreTimeline_Triangle5_183F66EE4C9887FB0BA401B86442E94A' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, OnemoreTimeline_Line_183F66EE4C9887FB0BA401B86442E94A) == 0x000380, "Member 'ABP_BtlGuiOneMore_C::OnemoreTimeline_Line_183F66EE4C9887FB0BA401B86442E94A' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, OnemoreTimeline_Text_183F66EE4C9887FB0BA401B86442E94A) == 0x000384, "Member 'ABP_BtlGuiOneMore_C::OnemoreTimeline_Text_183F66EE4C9887FB0BA401B86442E94A' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, OnemoreTimeline_riangle6_183F66EE4C9887FB0BA401B86442E94A) == 0x000388, "Member 'ABP_BtlGuiOneMore_C::OnemoreTimeline_riangle6_183F66EE4C9887FB0BA401B86442E94A' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, OnemoreTimeline_PointB_183F66EE4C9887FB0BA401B86442E94A) == 0x00038C, "Member 'ABP_BtlGuiOneMore_C::OnemoreTimeline_PointB_183F66EE4C9887FB0BA401B86442E94A' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, OnemoreTimeline__Direction_183F66EE4C9887FB0BA401B86442E94A) == 0x000390, "Member 'ABP_BtlGuiOneMore_C::OnemoreTimeline__Direction_183F66EE4C9887FB0BA401B86442E94A' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, OnemoreTimeline) == 0x000398, "Member 'ABP_BtlGuiOneMore_C::OnemoreTimeline' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, IsEnemy) == 0x0003A0, "Member 'ABP_BtlGuiOneMore_C::IsEnemy' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, LifeTime) == 0x0003A4, "Member 'ABP_BtlGuiOneMore_C::LifeTime' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, PointA) == 0x0003A8, "Member 'ABP_BtlGuiOneMore_C::PointA' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, PointB) == 0x0003B0, "Member 'ABP_BtlGuiOneMore_C::PointB' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Triangle6) == 0x0003B8, "Member 'ABP_BtlGuiOneMore_C::Triangle6' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Obj5) == 0x0003C0, "Member 'ABP_BtlGuiOneMore_C::Obj5' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Triangle5) == 0x0003C8, "Member 'ABP_BtlGuiOneMore_C::Triangle5' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Obj4) == 0x0003D0, "Member 'ABP_BtlGuiOneMore_C::Obj4' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Point_B) == 0x0003D8, "Member 'ABP_BtlGuiOneMore_C::Point_B' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Riangle_6) == 0x0003DC, "Member 'ABP_BtlGuiOneMore_C::Riangle_6' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Triangle_5) == 0x0003E0, "Member 'ABP_BtlGuiOneMore_C::Triangle_5' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Triangle_4) == 0x0003EC, "Member 'ABP_BtlGuiOneMore_C::Triangle_4' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Obj3) == 0x0003F8, "Member 'ABP_BtlGuiOneMore_C::Obj3' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Obj2) == 0x000400, "Member 'ABP_BtlGuiOneMore_C::Obj2' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Text) == 0x000408, "Member 'ABP_BtlGuiOneMore_C::Text' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Obj1) == 0x000410, "Member 'ABP_BtlGuiOneMore_C::Obj1' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Line) == 0x000418, "Member 'ABP_BtlGuiOneMore_C::Line' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, TextSize) == 0x00041C, "Member 'ABP_BtlGuiOneMore_C::TextSize' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiOneMore_C, Triangle5Size) == 0x000424, "Member 'ABP_BtlGuiOneMore_C::Triangle5Size' has a wrong offset!");

}

