#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlCalc

#include "Basic.hpp"

#include "FBtlCalcParam_structs.hpp"
#include "FBtlCalcRatio_structs.hpp"
#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlCalc.BP_BtlCalc_C.CalcMagicDamage
// 0x00E4 (0x00E4 - 0x0000)
struct BP_BtlCalc_C_CalcMagicDamage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         N;                                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         C;                                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         B;                                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         A;                                                 // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckAttackerIsEnemy_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetParam_ReturnValue_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_3;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_4;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_5;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_6;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_7;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_8;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_9;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetParam_ReturnValue_10;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_11;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_10;       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_11;       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_12;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_12;       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue_1;                       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_13;       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_14;       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_15;       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlCalc_C_CalcMagicDamage) == 0x000004, "Wrong alignment on BP_BtlCalc_C_CalcMagicDamage");
static_assert(sizeof(BP_BtlCalc_C_CalcMagicDamage) == 0x0000E4, "Wrong size on BP_BtlCalc_C_CalcMagicDamage");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, ReturnValue) == 0x000000, "Member 'BP_BtlCalc_C_CalcMagicDamage::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, N) == 0x000004, "Member 'BP_BtlCalc_C_CalcMagicDamage::N' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, C) == 0x000008, "Member 'BP_BtlCalc_C_CalcMagicDamage::C' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, B) == 0x00000C, "Member 'BP_BtlCalc_C_CalcMagicDamage::B' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, A) == 0x000010, "Member 'BP_BtlCalc_C_CalcMagicDamage::A' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue) == 0x000014, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_CheckAttackerIsEnemy_ReturnValue) == 0x000018, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_CheckAttackerIsEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_1) == 0x00001C, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_2) == 0x000028, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_3) == 0x00002C, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_4) == 0x000030, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000034, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_5) == 0x000038, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_6) == 0x00003C, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_7) == 0x000040, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000048, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_MakeLiteralByte_ReturnValue) == 0x00004C, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000050, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000054, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_8) == 0x000058, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00005C, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000060, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Add_FloatFloat_ReturnValue) == 0x000064, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000068, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x00006C, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_9) == 0x000070, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000074, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000078, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00007C, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000080, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000084, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_10) == 0x000088, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x00008C, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000090, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x000094, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_11) == 0x000098, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Sqrt_ReturnValue) == 0x00009C, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000A0, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x0000A4, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_9) == 0x0000A8, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_10) == 0x0000AC, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_11) == 0x0000B0, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000B4, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x0000B8, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0000BC, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x0000C0, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_GetParam_ReturnValue_12) == 0x0000C4, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_GetParam_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Divide_FloatFloat_ReturnValue_5) == 0x0000C8, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Divide_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_12) == 0x0000CC, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Sqrt_ReturnValue_1) == 0x0000D0, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Sqrt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_13) == 0x0000D4, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_14) == 0x0000D8, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x0000DC, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcMagicDamage, CallFunc_Multiply_FloatFloat_ReturnValue_15) == 0x0000E0, "Member 'BP_BtlCalc_C_CalcMagicDamage::CallFunc_Multiply_FloatFloat_ReturnValue_15' has a wrong offset!");

// Function BP_BtlCalc.BP_BtlCalc_C.CalcPhysicalDamage
// 0x0190 (0x0190 - 0x0000)
struct BP_BtlCalc_C_CalcPhysicalDamage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         C;                                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         B;                                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         A;                                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         N;                                                 // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckAttackerIsEnemy_ReturnValue;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetParam_ReturnValue_3;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSkillIsAttack_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetParam_ReturnValue_4;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_5;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_6;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_7;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_8;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_9;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckAttackerIsEnemy_ReturnValue_1;       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_10;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_11;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_12;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_10;       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue_1;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_11;       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_12;       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_13;       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_14;       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_6;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetParam_ReturnValue_13;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_7;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_14;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_8;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_9;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_15;       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue_2;                       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_16;       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_17;       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_18;       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_15;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_19;       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_20;       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_16;                  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_21;       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_10;         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_22;       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_17;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_23;       // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_18;                  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_24;       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_25;       // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_19;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_11;         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_26;       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue_3;                       // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_27;       // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_20;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_28;       // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_29;       // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_30;       // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_31;       // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_12;         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetParam_ReturnValue_21;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_32;       // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_33;       // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlCalc_C_CalcPhysicalDamage) == 0x000004, "Wrong alignment on BP_BtlCalc_C_CalcPhysicalDamage");
static_assert(sizeof(BP_BtlCalc_C_CalcPhysicalDamage) == 0x000190, "Wrong size on BP_BtlCalc_C_CalcPhysicalDamage");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, ReturnValue) == 0x000000, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, C) == 0x000004, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::C' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, B) == 0x000008, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::B' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, A) == 0x00000C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::A' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, N) == 0x000010, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::N' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue) == 0x000014, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_1) == 0x000018, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_2) == 0x00001C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_CheckAttackerIsEnemy_ReturnValue) == 0x000024, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_CheckAttackerIsEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Not_PreBool_ReturnValue) == 0x00002C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_3) == 0x000030, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_CheckSkillIsAttack_ReturnValue) == 0x000034, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_CheckSkillIsAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_4) == 0x000038, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_5) == 0x00003C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000040, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000044, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000048, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_6) == 0x00004C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_7) == 0x000050, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_8) == 0x000054, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_9) == 0x000058, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00005C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000060, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_CheckAttackerIsEnemy_ReturnValue_1) == 0x000064, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_CheckAttackerIsEnemy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000068, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Not_PreBool_ReturnValue_1) == 0x00006C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_MakeLiteralByte_ReturnValue) == 0x00006D, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000070, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000074, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_10) == 0x000078, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_11) == 0x00007C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000080, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x000084, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000088, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x00008C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000090, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Sqrt_ReturnValue) == 0x000094, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_12) == 0x000098, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x00009C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Divide_FloatFloat_ReturnValue_5) == 0x0000A0, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Divide_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x0000A4, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_9) == 0x0000A8, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_10) == 0x0000AC, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Sqrt_ReturnValue_1) == 0x0000B0, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Sqrt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_11) == 0x0000B4, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_12) == 0x0000B8, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_13) == 0x0000BC, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_14) == 0x0000C0, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Divide_FloatFloat_ReturnValue_6) == 0x0000C4, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Divide_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0000C8, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_13) == 0x0000CC, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Divide_FloatFloat_ReturnValue_7) == 0x0000D0, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Divide_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x0000D4, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_14) == 0x0000D8, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Divide_FloatFloat_ReturnValue_8) == 0x0000DC, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Divide_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Divide_FloatFloat_ReturnValue_9) == 0x0000E0, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Divide_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_15) == 0x0000E4, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Sqrt_ReturnValue_2) == 0x0000E8, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Sqrt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_16) == 0x0000EC, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_17) == 0x0000F0, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_18) == 0x0000F4, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_15) == 0x0000F8, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_19) == 0x0000FC, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_20) == 0x000100, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_GetParam_ReturnValue_16) == 0x000104, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_GetParam_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_21) == 0x000108, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00010C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Divide_FloatFloat_ReturnValue_10) == 0x000110, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Divide_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Multiply_FloatFloat_ReturnValue_22) == 0x000114, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Multiply_FloatFloat_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000118, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000119, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlCalc_C_CalcPhysicalDamage, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00011C, "Member 'BP_BtlCalc_C_CalcPhysicalDamage::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
