#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiOneMore

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlGuiOneMore.BP_BtlGuiOneMore_C.ExecuteUbergraph_BP_BtlGuiOneMore
// 0x0308 (0x0308 - 0x0000)
struct BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState;                   // 0x0005(0x0008)(NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_1;                 // 0x0018(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_2;                 // 0x0020(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_3;                 // 0x0028(0x0008)(NoDestructor)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_1;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_4;                 // 0x0039(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_5;                 // 0x0041(0x0008)(NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_deltaTime;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_1;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_6;                 // 0x0058(0x0008)(NoDestructor)
	struct FColor                                 K2Node_MakeStruct_Color_2;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlgAsset*                              CallFunc_GetResources_OutResources;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_3;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg;                   // 0x0078(0x0048)(NoDestructor)
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg_1;                 // 0x00C0(0x0048)(NoDestructor)
	struct FColor                                 K2Node_MakeStruct_Color_4;                         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawPanel                       K2Node_MakeStruct_BtlGuiDrawPanel;                 // 0x010C(0x003C)(NoDestructor)
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg_2;                 // 0x0148(0x0048)(NoDestructor)
	int32                                         CallFunc_CreateDrawPanel_outID;                    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPanel*                 CallFunc_CreateDrawPanel_outItem;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawPlg_outID;                      // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawPlg_outID_1;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem_1;                  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawPlg_outID_2;                    // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem_2;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default_1;                           // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg_3;                 // 0x01D8(0x0048)(NoDestructor)
	int32                                         CallFunc_CreateDrawPlg_outID_3;                    // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem_3;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_5;                         // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_6;                         // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default_2;                           // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg_4;                 // 0x0240(0x0048)(NoDestructor)
	struct FBtlGuiDrawPlg                         K2Node_MakeStruct_BtlGuiDrawPlg_5;                 // 0x0288(0x0048)(NoDestructor)
	int32                                         CallFunc_CreateDrawPlg_outID_4;                    // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem_4;                  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawPlg_outID_5;                    // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPlg*                   CallFunc_CreateDrawPlg_outItem_5;                  // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore) == 0x000008, "Wrong alignment on BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore");
static_assert(sizeof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore) == 0x000308, "Wrong size on BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, EntryPoint) == 0x000000, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, Temp_bool_Variable) == 0x000004, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlBlendState) == 0x000005, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlBlendState' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_GetSize_ReturnValue) == 0x000010, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlBlendState_1) == 0x000018, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlBlendState_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlBlendState_2) == 0x000020, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlBlendState_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlBlendState_3) == 0x000028, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlBlendState_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_GetSize_ReturnValue_1) == 0x000030, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_GetSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, Temp_bool_Variable_1) == 0x000038, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlBlendState_4) == 0x000039, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlBlendState_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlBlendState_5) == 0x000041, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlBlendState_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, Temp_bool_Variable_2) == 0x000049, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_Event_deltaTime) == 0x00004C, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_Event_deltaTime' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_Color) == 0x000050, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_Color_1) == 0x000054, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_Color_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlBlendState_6) == 0x000058, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlBlendState_6' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_Color_2) == 0x000060, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_Color_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_GetResources_OutResources) == 0x000068, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_GetResources_OutResources' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_Color_3) == 0x000070, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_Color_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_Select_Default) == 0x000074, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlGuiDrawPlg) == 0x000078, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlGuiDrawPlg' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlGuiDrawPlg_1) == 0x0000C0, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlGuiDrawPlg_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_Color_4) == 0x000108, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_Color_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlGuiDrawPanel) == 0x00010C, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlGuiDrawPanel' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlGuiDrawPlg_2) == 0x000148, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlGuiDrawPlg_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPanel_outID) == 0x000190, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPanel_outID' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPanel_outItem) == 0x000198, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPanel_outItem' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outID) == 0x0001A0, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outID' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outItem) == 0x0001A8, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outItem' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outID_1) == 0x0001B0, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outID_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outItem_1) == 0x0001B8, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outItem_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outID_2) == 0x0001C0, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outID_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outItem_2) == 0x0001C8, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outItem_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_Select_Default_1) == 0x0001D0, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlGuiDrawPlg_3) == 0x0001D8, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlGuiDrawPlg_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outID_3) == 0x000220, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outID_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outItem_3) == 0x000228, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outItem_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_Color_5) == 0x000230, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_Color_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_Color_6) == 0x000234, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_Color_6' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_Select_Default_2) == 0x000238, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlGuiDrawPlg_4) == 0x000240, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlGuiDrawPlg_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, K2Node_MakeStruct_BtlGuiDrawPlg_5) == 0x000288, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::K2Node_MakeStruct_BtlGuiDrawPlg_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outID_4) == 0x0002D0, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outID_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outItem_4) == 0x0002D8, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outItem_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outID_5) == 0x0002E0, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outID_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_CreateDrawPlg_outItem_5) == 0x0002E8, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_CreateDrawPlg_outItem_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_BreakVector_X) == 0x0002F0, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_BreakVector_Y) == 0x0002F4, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_BreakVector_Z) == 0x0002F8, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_BreakVector_X_1) == 0x0002FC, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_BreakVector_Y_1) == 0x000300, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore, CallFunc_BreakVector_Z_1) == 0x000304, "Member 'BP_BtlGuiOneMore_C_ExecuteUbergraph_BP_BtlGuiOneMore::CallFunc_BreakVector_Z_1' has a wrong offset!");

// Function BP_BtlGuiOneMore.BP_BtlGuiOneMore_C.GuiActorUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlGuiOneMore_C_GuiActorUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiOneMore_C_GuiActorUpdate) == 0x000004, "Wrong alignment on BP_BtlGuiOneMore_C_GuiActorUpdate");
static_assert(sizeof(BP_BtlGuiOneMore_C_GuiActorUpdate) == 0x000004, "Wrong size on BP_BtlGuiOneMore_C_GuiActorUpdate");
static_assert(offsetof(BP_BtlGuiOneMore_C_GuiActorUpdate, DeltaTime) == 0x000000, "Member 'BP_BtlGuiOneMore_C_GuiActorUpdate::DeltaTime' has a wrong offset!");

// Function BP_BtlGuiOneMore.BP_BtlGuiOneMore_C.SetParam
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlGuiOneMore_C_SetParam final
{
public:
	bool                                          IsEnemy_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LifeTime_0;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiOneMore_C_SetParam) == 0x000004, "Wrong alignment on BP_BtlGuiOneMore_C_SetParam");
static_assert(sizeof(BP_BtlGuiOneMore_C_SetParam) == 0x000008, "Wrong size on BP_BtlGuiOneMore_C_SetParam");
static_assert(offsetof(BP_BtlGuiOneMore_C_SetParam, IsEnemy_0) == 0x000000, "Member 'BP_BtlGuiOneMore_C_SetParam::IsEnemy_0' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_SetParam, LifeTime_0) == 0x000004, "Member 'BP_BtlGuiOneMore_C_SetParam::LifeTime_0' has a wrong offset!");

// Function BP_BtlGuiOneMore.BP_BtlGuiOneMore_C.UpdatePointB
// 0x0138 (0x0138 - 0x0000)
struct BP_BtlGuiOneMore_C_UpdatePointB final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameRowk;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FrameMax;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Frame;                                             // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         ValueTemp;                                         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainderTemp;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Pos4;                                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Pos3;                                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Pos2;                                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Pos1;                                              // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_1;      // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_2;      // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_3;      // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_4;      // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_5;      // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiOneMore_C_UpdatePointB) == 0x000008, "Wrong alignment on BP_BtlGuiOneMore_C_UpdatePointB");
static_assert(sizeof(BP_BtlGuiOneMore_C_UpdatePointB) == 0x000138, "Wrong size on BP_BtlGuiOneMore_C_UpdatePointB");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, Rate) == 0x000000, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::Rate' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, FrameRowk) == 0x000004, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::FrameRowk' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, FrameMax) == 0x000008, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::FrameMax' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, Frame) == 0x000010, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::Frame' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, ValueTemp) == 0x000020, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::ValueTemp' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, RemainderTemp) == 0x000024, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::RemainderTemp' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, Pos4) == 0x000028, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::Pos4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, Pos3) == 0x000030, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::Pos3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, Pos2) == 0x000038, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::Pos2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, Pos1) == 0x000040, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::Pos1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, Temp_int_Array_Index_Variable_1) == 0x000058, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, K2Node_MakeArray_Array) == 0x000060, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, Temp_int_Loop_Counter_Variable_1) == 0x000070, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, Temp_bool_True_if_break_was_hit_Variable) == 0x000078, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Array_Get_Item) == 0x00007C, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000080, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000084, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000088, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00008C, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_BooleanAND_ReturnValue) == 0x000099, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Array_Get_Item_1) == 0x00009C, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, K2Node_SwitchInteger_CmpSuccess) == 0x0000A0, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A4, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000AC, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x0000B0, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Conv_Vector2DToVector_ReturnValue_1) == 0x0000BC, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Conv_Vector2DToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_VLerp_ReturnValue) == 0x0000C8, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000D4, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Conv_Vector2DToVector_ReturnValue_2) == 0x0000DC, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Conv_Vector2DToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Conv_Vector2DToVector_ReturnValue_3) == 0x0000E8, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Conv_Vector2DToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_VLerp_ReturnValue_1) == 0x0000F4, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Conv_Vector2DToVector_ReturnValue_4) == 0x000100, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Conv_Vector2DToVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x00010C, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Conv_Vector2DToVector_ReturnValue_5) == 0x000114, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Conv_Vector2DToVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_VLerp_ReturnValue_2) == 0x000120, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdatePointB, CallFunc_Conv_VectorToVector2D_ReturnValue_2) == 0x00012C, "Member 'BP_BtlGuiOneMore_C_UpdatePointB::CallFunc_Conv_VectorToVector2D_ReturnValue_2' has a wrong offset!");

// Function BP_BtlGuiOneMore.BP_BtlGuiOneMore_C.UpdateTriangle6
// 0x01A8 (0x01A8 - 0x0000)
struct BP_BtlGuiOneMore_C_UpdateTriangle6 final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Scale;                                             // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameRowk;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FrameMax;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Frame;                                             // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         ValueTemp;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainderTemp;                                     // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Pos4;                                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Pos3;                                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Pos2;                                              // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Pos1;                                              // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetGroupDrawItem_idAry;                   // 0x0088(0x0010)(ReferenceParm)
	TArray<class UBtlGuiDrawObjectCore*>          CallFunc_GetGroupDrawItem_objAry;                  // 0x0098(0x0010)(ReferenceParm)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectCore*                  CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectPlg*                   K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Plg;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_2;                         // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_1;      // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_2;      // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_3;      // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_4;      // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_5;      // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiOneMore_C_UpdateTriangle6) == 0x000008, "Wrong alignment on BP_BtlGuiOneMore_C_UpdateTriangle6");
static_assert(sizeof(BP_BtlGuiOneMore_C_UpdateTriangle6) == 0x0001A8, "Wrong size on BP_BtlGuiOneMore_C_UpdateTriangle6");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, Rate) == 0x000000, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::Rate' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, Scale) == 0x000004, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::Scale' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, FrameRowk) == 0x00000C, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::FrameRowk' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, FrameMax) == 0x000010, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::FrameMax' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, Frame) == 0x000018, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::Frame' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, ValueTemp) == 0x000028, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::ValueTemp' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, RemainderTemp) == 0x00002C, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::RemainderTemp' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, Pos4) == 0x000030, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::Pos4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, Pos3) == 0x000038, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::Pos3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, Pos2) == 0x000040, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::Pos2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, Pos1) == 0x000048, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::Pos1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiOneMore_C_UpdateTriangle6, CallFunc_FClamp_ReturnValue) == 0x000050, "Member 'BP_BtlGuiOneMore_C_UpdateTriangle6::CallFunc_FClamp_ReturnValue' has a wrong offset!");
