#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlTacticsCheck

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlTacticsCheck.BP_BtlTacticsCheck_C.ExecuteUbergraph_BP_BtlTacticsCheck
// 0x07A0 (0x07A0 - 0x0000)
struct BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_FrameBufferCapture_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlGuiBaseActor_C*                  CallFunc_FindGUIActor_GuiActor;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindGUIActor_sucsess;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiCapture_C*                    K2Node_DynamicCast_AsBP_Btl_Gui_Capture;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiBaseActor_C*                  CallFunc_FindGUIActor_GuiActor_1;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindGUIActor_sucsess_1;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiCapture_C*                    K2Node_DynamicCast_AsBP_Btl_Gui_Capture_1;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlGuiIconKeyHelp                            Temp_byte_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlGuiIconKeyHelp                            Temp_byte_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex;                    // 0x0094(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_1;                  // 0x00A8(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_2;                  // 0x00BC(0x0014)(NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBtlGuiVertex>                  K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_3;                  // 0x00E8(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_4;                  // 0x00FC(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_5;                  // 0x0110(0x0014)(NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBtlGuiVertex>                  K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ReferenceParm)
	EBtlGuiIconKeyHelp                            Temp_byte_Variable_2;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlGuiIconKeyHelp                            Temp_byte_Variable_3;                              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cal_MovePosOffsetVec_Start;               // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cal_MovePosOffsetVec_End;                 // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_FrameBufferCapture_ReturnValue_1;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlSimpleTextureDraw_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlSimpleTextureDraw_C*             CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x022C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x023C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x025C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiBaseActor_C*                  CallFunc_FindGUIActor_GuiActor_2;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindGUIActor_sucsess_2;                   // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiAnalyze_C*                    K2Node_DynamicCast_AsBP_Btl_Gui_Analyze;           // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckTargetInTopUI_bool;                  // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      CallFunc_GetEnemyList_ReturnValue;                 // 0x0290(0x0010)(ReferenceParm)
	class ABtlActor*                              CallFunc_Array_Get_Item;                           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array_2;                          // 0x02A8(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class ABtlActor*>                      CallFunc_GetPlayerList_ReturnValue;                // 0x02C8(0x0010)(ReferenceParm)
	TArray<bool>                                  CallFunc_GetKeyControl_ReturnValue;                // 0x02D8(0x0010)(ReferenceParm)
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue;             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetSpecialSkillList_ReturnValue;          // 0x02F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item_1;                         // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array_3;                          // 0x0310(0x0010)(ReferenceParm)
	class ABtlActor*                              CallFunc_Array_Get_Item_2;                         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue;                      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item_3;                         // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartTheugiaWindow_ReturnValue;           // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemy_ReturnValue_1;                    // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      CallFunc_MakePosCursor_out;                        // 0x0340(0x0010)(ReferenceParm)
	TArray<struct FVector2D>                      CallFunc_MakePosCursor_out_1;                      // 0x0350(0x0010)(ReferenceParm)
	TArray<struct FVector2D>                      CallFunc_MakePosCursor_out_2;                      // 0x0360(0x0010)(ReferenceParm)
	TArray<struct FVector2D>                      CallFunc_MakePosCursor_out_3;                      // 0x0370(0x0010)(ReferenceParm)
	class UDataTable*                             CallFunc_GetBossCameraTable_ReturnValue;           // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetBossCameraTable_ReturnValue_1;         // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_MoveCursorTactics_ReturnValue;            // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_MoveCursorTactics_ReturnValue_1;          // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetBossCameraTable_ReturnValue_2;         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetBossCameraTable_ReturnValue_3;         // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CA[0x6];                                      // 0x03CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_MoveCursorTactics_ReturnValue_2;          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_MoveCursorTactics_ReturnValue_3;          // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E2[0x2];                                      // 0x03E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FBtlInputKey& InputKey)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x03E4(0x0010)(ZeroConstructor, NoDestructor)
	struct FBtlInputKey                           K2Node_CustomEvent_InputKey;                       // 0x03F4(0x0030)(NoDestructor)
	bool                                          CallFunc_ChecPushkCursor_out;                      // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChecPushkCursor_out_1;                    // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChecPushkCursor_out_2;                    // 0x0426(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChecPushkCursor_out_3;                    // 0x0427(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABtlActor*                              CallFunc_MoveCursorTacticsSimple_ReturnValue;      // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_MoveCursorTacticsSimple_ReturnValue_1;    // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_MoveCursorTacticsSimple_ReturnValue_2;    // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_MoveCursorTacticsSimple_ReturnValue_3;    // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_flag;                                 // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_param;                                // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_deltaTime;                            // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      CallFunc_GetTargets_ReturnValue;                   // 0x0468(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable_4;                               // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_Select_Default;                             // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue_1;           // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SyncTheugiaWindowEnd_IsEnd;               // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_SyncTheugiaWindowEnd_ReturnValue;         // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      CallFunc_GetTargets_ReturnValue_1;                 // 0x04A0(0x0010)(ReferenceParm)
	class ABtlActor*                              CallFunc_Array_Get_Item_4;                         // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlGuiIconKeyHelp                            K2Node_Select_Default_1;                           // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item_5;                         // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_2;                    // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlGuiIconKeyHelp                            K2Node_Select_Default_2;                           // 0x04CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_3;                           // 0x04CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x04CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array_4;                          // 0x04D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item_6;                         // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array_5;                          // 0x0500(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable_5;                               // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_Select_Default_4;                           // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventBattle_ReturnValue;                // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_5;                           // 0x0524(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetGroupDrawItem_idAry;                   // 0x0530(0x0010)(ReferenceParm)
	TArray<class UBtlGuiDrawObjectCore*>          CallFunc_GetGroupDrawItem_objAry;                  // 0x0540(0x0010)(ReferenceParm)
	class UBtlGuiDrawObjectCore*                  CallFunc_Array_Get_Item_7;                         // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPos_ReturnValue;                       // 0x055C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0564(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_565[0x3];                                      // 0x0565(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetGroupDrawItem_idAry_1;                 // 0x0570(0x0010)(ReferenceParm)
	TArray<class UBtlGuiDrawObjectCore*>          CallFunc_GetGroupDrawItem_objAry_1;                // 0x0580(0x0010)(ReferenceParm)
	class UBtlGuiDrawObjectCore*                  CallFunc_Array_Get_Item_8;                         // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive;             // 0x0598(0x0060)()
	struct FVector2D                              CallFunc_GetPos_ReturnValue_1;                     // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive_1;           // 0x0610(0x0060)()
	int32                                         CallFunc_CreateDrawPrimitive_outID;                // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem;              // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawPrimitive_outID_1;              // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem_1;            // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlgAsset*                              CallFunc_GetResources_OutResources;                // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USprAsset*                              CallFunc_GetResources_OutResources_1;              // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_9;                         // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x06AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AD[0x3];                                      // 0x06AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x06B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x06C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_Select_Default_6;                           // 0x06D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectPlg*                   CallFunc_Array_Get_Item_10;                        // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x06E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x06F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x06FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0704(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x070C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_714[0x4];                                      // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetGroupDrawItem_idAry_2;                 // 0x0718(0x0010)(ReferenceParm)
	TArray<class UBtlGuiDrawObjectCore*>          CallFunc_GetGroupDrawItem_objAry_2;                // 0x0728(0x0010)(ReferenceParm)
	class UBtlGuiDrawObjectCore*                  CallFunc_Array_Get_Item_11;                        // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0744(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_745[0x3];                                      // 0x0745(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetGroupDrawItem_idAry_3;                 // 0x0748(0x0010)(ReferenceParm)
	TArray<class UBtlGuiDrawObjectCore*>          CallFunc_GetGroupDrawItem_objAry_3;                // 0x0758(0x0010)(ReferenceParm)
	class UBtlGuiDrawObjectCore*                  CallFunc_Array_Get_Item_12;                        // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0774(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_775[0x3];                                      // 0x0775(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0778(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x0784(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_3;       // 0x078C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck) == 0x000010, "Wrong alignment on BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck");
static_assert(sizeof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck) == 0x0007A0, "Wrong size on BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, EntryPoint) == 0x000000, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_struct_Variable) == 0x000008, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_FrameBufferCapture_ReturnValue) == 0x000010, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_FrameBufferCapture_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_FindGUIActor_GuiActor) == 0x000018, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_FindGUIActor_GuiActor' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_FindGUIActor_sucsess) == 0x000020, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_FindGUIActor_sucsess' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_DynamicCast_AsBP_Btl_Gui_Capture) == 0x000028, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_DynamicCast_AsBP_Btl_Gui_Capture' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_struct_Variable_1) == 0x000034, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_bool_IsClosed_Variable) == 0x00003C, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_bool_Has_Been_Initd_Variable) == 0x00003D, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_bool_Variable) == 0x00003E, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_FindGUIActor_GuiActor_1) == 0x000040, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_FindGUIActor_GuiActor_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_FindGUIActor_sucsess_1) == 0x000048, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_FindGUIActor_sucsess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_DynamicCast_AsBP_Btl_Gui_Capture_1) == 0x000050, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_DynamicCast_AsBP_Btl_Gui_Capture_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_int_Variable) == 0x00005C, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_byte_Variable) == 0x000060, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_int_Array_Index_Variable) == 0x00007C, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_byte_Variable_1) == 0x000080, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_bool_Variable_1) == 0x000081, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_int_Loop_Counter_Variable_1) == 0x000084, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_Add_IntInt_ReturnValue_1) == 0x000088, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_int_Array_Index_Variable_1) == 0x00008C, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_bool_Variable_2) == 0x000091, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_MakeStruct_BtlGuiVertex) == 0x000094, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_MakeStruct_BtlGuiVertex' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_MakeStruct_BtlGuiVertex_1) == 0x0000A8, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_MakeStruct_BtlGuiVertex_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_MakeStruct_BtlGuiVertex_2) == 0x0000BC, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_MakeStruct_BtlGuiVertex_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_bool_Variable_3) == 0x0000D0, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_MakeArray_Array) == 0x0000D8, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_MakeStruct_BtlGuiVertex_3) == 0x0000E8, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_MakeStruct_BtlGuiVertex_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_MakeStruct_BtlGuiVertex_4) == 0x0000FC, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_MakeStruct_BtlGuiVertex_4' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_MakeStruct_BtlGuiVertex_5) == 0x000110, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_MakeStruct_BtlGuiVertex_5' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_bool_Variable_4) == 0x000124, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, K2Node_MakeArray_Array_1) == 0x000128, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_byte_Variable_2) == 0x000138, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_byte_Variable_3) == 0x000139, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_Cal_MovePosOffsetVec_Start) == 0x00013C, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_Cal_MovePosOffsetVec_Start' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_Cal_MovePosOffsetVec_End) == 0x000148, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_Cal_MovePosOffsetVec_End' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_bool_Variable_5) == 0x000154, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_int_Loop_Counter_Variable_2) == 0x000158, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_Add_IntInt_ReturnValue_2) == 0x00015C, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_int_Array_Index_Variable_2) == 0x000160, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_FrameBufferCapture_ReturnValue_1) == 0x000168, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_FrameBufferCapture_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_int_Loop_Counter_Variable_3) == 0x000170, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_Add_IntInt_ReturnValue_3) == 0x000174, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_int_Array_Index_Variable_3) == 0x000178, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_MakeTransform_ReturnValue) == 0x000180, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B0, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001B8, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_IsValid_ReturnValue_2) == 0x0001C0, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_IsValid_ReturnValue_3) == 0x0001C1, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_int_Loop_Counter_Variable_4) == 0x0001C4, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001C8, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, Temp_int_Array_Index_Variable_4) == 0x0001CC, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_MakeTransform_ReturnValue_1) == 0x0001D0, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000200, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000208, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck, CallFunc_IsPlaying_ReturnValue) == 0x000210, "Member 'BP_BtlTacticsCheck_C_ExecuteUbergraph_BP_BtlTacticsCheck::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
