#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlShadowBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_BtlCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlShadowBase.BP_BtlShadowBase_C
// 0x00F0 (0x10DC0 - 0x10CD0)
class ABP_BtlShadowBase_C final : public ABP_BtlCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BtlShadowBase_C;                 // 0x10CD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ShadowCharaBP;                                     // 0x10CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_HideCurrentToComplete_Power_2F3904D947272065EFD0D09B8DC45827; // 0x10CE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_HideCurrentToComplete__Direction_2F3904D947272065EFD0D09B8DC45827; // 0x10CE4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10CE5[0x3];                                    // 0x10CE5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_HideCurrentToComplete;                    // 0x10CE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TL_RunAway_RunVec_2234AC0448FCBB8630FFA68B847A99FF; // 0x10CF0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_RunAway__Direction_2234AC0448FCBB8630FFA68B847A99FF; // 0x10CFC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10CFD[0x3];                                    // 0x10CFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_RunAway;                                        // 0x10D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_EscapeFadeout_Ratio_97058E864087A87725A7D7AB82EE81F9; // 0x10D08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_EscapeFadeout__Direction_97058E864087A87725A7D7AB82EE81F9; // 0x10D0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D0D[0x3];                                    // 0x10D0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_EscapeFadeout;                                  // 0x10D10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Power_51DF8F87491797F6ADF13893774D68BA; // 0x10D18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_51DF8F87491797F6ADF13893774D68BA; // 0x10D1C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D1D[0x3];                                    // 0x10D1D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x10D20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Hide_Power_6F2EFCA74A2F8947D54C8D8935A5202B; // 0x10D28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Hide__Direction_6F2EFCA74A2F8947D54C8D8935A5202B; // 0x10D2C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D2D[0x3];                                    // 0x10D2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Hide;                                     // 0x10D30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_DeadPerformance_Power_8F80E7DB4B27129A155BFDBA21F3A200; // 0x10D38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_DeadPerformance__Direction_8F80E7DB4B27129A155BFDBA21F3A200; // 0x10D3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D3D[0x3];                                    // 0x10D3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_DeadPerformance;                          // 0x10D40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlSizeCategoryType                          Size_Category;                                     // 0x10D48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D49[0x7];                                    // 0x10D49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ShadowBase_C*                       EnemyCharaBP;                                      // 0x10D50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CharacterLoaded;                                   // 0x10D58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D59[0x7];                                    // 0x10D59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       EnemyMID;                                          // 0x10D60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveFloat*                            CrvEnemyDead;                                      // 0x10D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hiding;                                            // 0x10D78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          StrongHiding;                                      // 0x10D79(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D7A[0x6];                                    // 0x10D7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CrvEnemyDeadShort;                                 // 0x10D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DeadEffect;                                        // 0x10D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Opacity;                                           // 0x10D90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D94[0x4];                                    // 0x10D94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         LS_Cut1;                                           // 0x10D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Chant_Seq_Actor;                                   // 0x10DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         LS_Skill_Shot_EX;                                  // 0x10DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SkillShotCamActor;                                 // 0x10DB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmerge;                                          // 0x10DB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FinishedSummonFadein;                              // 0x10DB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BtlShadowBase(int32 EntryPoint);
	void On_Force_Finalize_Summon_Fadein();
	void On_Show_from_Hiding_From_Fortune_Invisible_Mode();
	void On_Emerge_Effect_Play(class UNiagaraSystem* Effect);
	void On_Emerge_Shadow();
	void On_Play_Dead_Effect(bool IsDown_0);
	void On_Ready_to_Destroy();
	void Show_Summon_Fadein();
	void ShowFromHiding();
	void HideForOtherAction(bool CriticalHindrance, bool Rapid, bool HalfMode);
	void On_Play_Dead_Performance(bool ShortMode);
	void ReceiveDestroyed();
	void SpawnCharacterBP(bool InitialHiding);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void On_Summon_Emerge_With_Index(int32 EmergeIndex);
	void On_Play_Chant_Camera_Sequence();
	void PlayEnemySummonEffect();
	void On_Summon_Emerge();
	void Has_Notified_Summon();
	void Has_Notified_Play_Summon_Camera_();
	void Has_Finished_Summon_Data_Load();
	void Has_Finished_Skill_Load();
	void On_Character_Escaping();
	void OnLoaded_323D325F4FDCD44EFD2EFBB62B30685F(class UObject* Loaded);
	void Timeline_HideCurrentToComplete__UpdateFunc();
	void Timeline_HideCurrentToComplete__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Timeline_Hide__UpdateFunc();
	void Timeline_Hide__FinishedFunc();
	void Timeline_DeadPerformance__UpdateFunc();
	void Timeline_DeadPerformance__FinishedFunc();
	void TL_RunAway__UpdateFunc();
	void TL_RunAway__FinishedFunc();
	void TL_EscapeFadeout__UpdateFunc();
	void TL_EscapeFadeout__FinishedFunc();
	void UserConstructionScript();
	void CreateCharacter();
	void GetCharacterRoot(class USceneComponent** Scene);
	void GetShowActor(class AActor** Showing_Actor);
	void GetSkeletalMesh(class USkeletalMeshComponent** SkeletalMesh);
	bool CheckReadyCharacterBP();
	void GetAttackMontageName(class FName* Attack);
	void CreateMID();
	void SetDeadBubblePower(float Power);
	void BeginDeadPhase(bool IsDown_0);
	void Shift_Skill_Phase();
	void PlaySkillEnchantAnim();
	void Finalize_Skill_Phase();
	void SetOpacity(float Power, bool ControlWithVisible);
	void GetCharacterScale(struct FVector* Scale);
	void Shift_Summon_Skill_Phase();
	void Set_Color(const struct FColor& Color, float Power);
	void GetMaterials(TArray<class UMaterialInstanceDynamic*>* MaterialInstance);
	float GetDeadCurveValue(float InTime, bool ShortMode);
	void SetCharacterEffectOpacity(float Opacity_0);
	void SetVisible(bool Visible, bool KeepAnim);
	void GetOpacity(float* Opacity_0);
	void PlaySkillShotCam();
	void SetupEventAnimation(bool Enable);
	void GetSummonEmergeEffect(TSoftObjectPtr<class UNiagaraSystem>* SummonEmergeEffect);
	void GetDeadFloorEffectScale(struct FVector* Scale);
	void TellEnemySpawnedToFadeManager();
	void DisableLOD();
	void RestoreLOD();
	void SaveLODParam();
	void MarkAsVanished();

	EBtlSizeCategoryType GetSizeCategory() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlShadowBase_C">();
	}
	static class ABP_BtlShadowBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlShadowBase_C>();
	}
};
static_assert(alignof(ABP_BtlShadowBase_C) == 0x000010, "Wrong alignment on ABP_BtlShadowBase_C");
static_assert(sizeof(ABP_BtlShadowBase_C) == 0x010DC0, "Wrong size on ABP_BtlShadowBase_C");
static_assert(offsetof(ABP_BtlShadowBase_C, UberGraphFrame_BP_BtlShadowBase_C) == 0x010CD0, "Member 'ABP_BtlShadowBase_C::UberGraphFrame_BP_BtlShadowBase_C' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, ShadowCharaBP) == 0x010CD8, "Member 'ABP_BtlShadowBase_C::ShadowCharaBP' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_HideCurrentToComplete_Power_2F3904D947272065EFD0D09B8DC45827) == 0x010CE0, "Member 'ABP_BtlShadowBase_C::Timeline_HideCurrentToComplete_Power_2F3904D947272065EFD0D09B8DC45827' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_HideCurrentToComplete__Direction_2F3904D947272065EFD0D09B8DC45827) == 0x010CE4, "Member 'ABP_BtlShadowBase_C::Timeline_HideCurrentToComplete__Direction_2F3904D947272065EFD0D09B8DC45827' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_HideCurrentToComplete) == 0x010CE8, "Member 'ABP_BtlShadowBase_C::Timeline_HideCurrentToComplete' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, TL_RunAway_RunVec_2234AC0448FCBB8630FFA68B847A99FF) == 0x010CF0, "Member 'ABP_BtlShadowBase_C::TL_RunAway_RunVec_2234AC0448FCBB8630FFA68B847A99FF' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, TL_RunAway__Direction_2234AC0448FCBB8630FFA68B847A99FF) == 0x010CFC, "Member 'ABP_BtlShadowBase_C::TL_RunAway__Direction_2234AC0448FCBB8630FFA68B847A99FF' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, TL_RunAway) == 0x010D00, "Member 'ABP_BtlShadowBase_C::TL_RunAway' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, TL_EscapeFadeout_Ratio_97058E864087A87725A7D7AB82EE81F9) == 0x010D08, "Member 'ABP_BtlShadowBase_C::TL_EscapeFadeout_Ratio_97058E864087A87725A7D7AB82EE81F9' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, TL_EscapeFadeout__Direction_97058E864087A87725A7D7AB82EE81F9) == 0x010D0C, "Member 'ABP_BtlShadowBase_C::TL_EscapeFadeout__Direction_97058E864087A87725A7D7AB82EE81F9' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, TL_EscapeFadeout) == 0x010D10, "Member 'ABP_BtlShadowBase_C::TL_EscapeFadeout' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_0_Power_51DF8F87491797F6ADF13893774D68BA) == 0x010D18, "Member 'ABP_BtlShadowBase_C::Timeline_0_Power_51DF8F87491797F6ADF13893774D68BA' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_0__Direction_51DF8F87491797F6ADF13893774D68BA) == 0x010D1C, "Member 'ABP_BtlShadowBase_C::Timeline_0__Direction_51DF8F87491797F6ADF13893774D68BA' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_0) == 0x010D20, "Member 'ABP_BtlShadowBase_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_Hide_Power_6F2EFCA74A2F8947D54C8D8935A5202B) == 0x010D28, "Member 'ABP_BtlShadowBase_C::Timeline_Hide_Power_6F2EFCA74A2F8947D54C8D8935A5202B' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_Hide__Direction_6F2EFCA74A2F8947D54C8D8935A5202B) == 0x010D2C, "Member 'ABP_BtlShadowBase_C::Timeline_Hide__Direction_6F2EFCA74A2F8947D54C8D8935A5202B' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_Hide) == 0x010D30, "Member 'ABP_BtlShadowBase_C::Timeline_Hide' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_DeadPerformance_Power_8F80E7DB4B27129A155BFDBA21F3A200) == 0x010D38, "Member 'ABP_BtlShadowBase_C::Timeline_DeadPerformance_Power_8F80E7DB4B27129A155BFDBA21F3A200' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_DeadPerformance__Direction_8F80E7DB4B27129A155BFDBA21F3A200) == 0x010D3C, "Member 'ABP_BtlShadowBase_C::Timeline_DeadPerformance__Direction_8F80E7DB4B27129A155BFDBA21F3A200' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Timeline_DeadPerformance) == 0x010D40, "Member 'ABP_BtlShadowBase_C::Timeline_DeadPerformance' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Size_Category) == 0x010D48, "Member 'ABP_BtlShadowBase_C::Size_Category' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, EnemyCharaBP) == 0x010D50, "Member 'ABP_BtlShadowBase_C::EnemyCharaBP' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, CharacterLoaded) == 0x010D58, "Member 'ABP_BtlShadowBase_C::CharacterLoaded' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, EnemyMID) == 0x010D60, "Member 'ABP_BtlShadowBase_C::EnemyMID' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, CrvEnemyDead) == 0x010D70, "Member 'ABP_BtlShadowBase_C::CrvEnemyDead' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Hiding) == 0x010D78, "Member 'ABP_BtlShadowBase_C::Hiding' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, StrongHiding) == 0x010D79, "Member 'ABP_BtlShadowBase_C::StrongHiding' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, CrvEnemyDeadShort) == 0x010D80, "Member 'ABP_BtlShadowBase_C::CrvEnemyDeadShort' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, DeadEffect) == 0x010D88, "Member 'ABP_BtlShadowBase_C::DeadEffect' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Opacity) == 0x010D90, "Member 'ABP_BtlShadowBase_C::Opacity' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, LS_Cut1) == 0x010D98, "Member 'ABP_BtlShadowBase_C::LS_Cut1' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, Chant_Seq_Actor) == 0x010DA0, "Member 'ABP_BtlShadowBase_C::Chant_Seq_Actor' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, LS_Skill_Shot_EX) == 0x010DA8, "Member 'ABP_BtlShadowBase_C::LS_Skill_Shot_EX' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, SkillShotCamActor) == 0x010DB0, "Member 'ABP_BtlShadowBase_C::SkillShotCamActor' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, IsEmerge) == 0x010DB8, "Member 'ABP_BtlShadowBase_C::IsEmerge' has a wrong offset!");
static_assert(offsetof(ABP_BtlShadowBase_C, FinishedSummonFadein) == 0x010DB9, "Member 'ABP_BtlShadowBase_C::FinishedSummonFadein' has a wrong offset!");

}

