#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlPersonaBase

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.ExecuteUbergraph_BP_BtlPersonaBase
// 0x0298 (0x0298 - 0x0000)
struct BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_SkeletalMesh;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_SkeletalMesh_1;           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_GetEffect_ReturnValue;                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckLoaded_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_SkeletalMesh_2;           // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x0174(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x017C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_LoopEffectOnly;                 // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlHumanBase_C*                     K2Node_DynamicCast_AsBP_Btl_Human_Base;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_GetEffect_ReturnValue_1;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x01AC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckLoaded_ReturnValue_1;                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BF[0x1];                                      // 0x01BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHidingPersonaForSkillScene_ReturnValue; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlPersonaAnimationType                      K2Node_CustomEvent_type_1;                         // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_UseCustomBlend_1;               // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Blend_1;                        // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsAfterCutin_1;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x01E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x01EC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_IsAfterCutin;                   // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPersonaStartWithoutEmergePerformance_ReturnValue; // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBtlPersonaSceneAnimationType                 K2Node_CustomEvent_type;                           // 0x01FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_UseCustomBlend;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Blend;                          // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Get_Persona_Notify_Notify_Name;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x0214(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              K2Node_Event_PersonaOwner;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 K2Node_DynamicCast_AsBP_Btl_Character_Base;        // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckHidingPersonaForSkillScene_ReturnValue_1; // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24B[0x1];                                      // 0x024B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x024C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x025C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcSkillAnimStartingPosition_Position;   // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_276[0x2];                                      // 0x0276(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_SkeletalMesh_3;           // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemainingTimeFromCurrentSection_ReturnValue; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckNeedToShowPersonaAtSummonShot_Show;  // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase) == 0x000008, "Wrong alignment on BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase");
static_assert(sizeof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase) == 0x000298, "Wrong size on BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, EntryPoint) == 0x000000, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_6) == 0x000004, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_5) == 0x00001C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, Temp_name_Variable) == 0x000034, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00004C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00004D, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_4) == 0x000050, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_3) == 0x000058, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_2) == 0x000070, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x000078, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_1) == 0x000088, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_5) == 0x000090, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName) == 0x0000A0, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000A8, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, Temp_name_Variable_1) == 0x0000B8, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_9) == 0x0000C0, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_GetSkeletalMesh_SkeletalMesh) == 0x0000C8, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_GetSkeletalMesh_SkeletalMesh' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000D0, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000E0, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000E9, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_GetSkeletalMesh_SkeletalMesh_1) == 0x0000F0, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_GetSkeletalMesh_SkeletalMesh_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x0000F8, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_IsValid_ReturnValue_1) == 0x000100, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, Temp_name_Variable_2) == 0x000104, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_10) == 0x00010C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_8) == 0x000114, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_GetEffect_ReturnValue) == 0x000128, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_GetEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_7) == 0x000130, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_CheckLoaded_ReturnValue) == 0x000138, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_CheckLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_GetSkeletalMesh_SkeletalMesh_2) == 0x000140, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_GetSkeletalMesh_SkeletalMesh_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_IsValid_ReturnValue_2) == 0x000148, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2) == 0x000150, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_IsValid_ReturnValue_3) == 0x000158, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_11) == 0x00015C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_9) == 0x000164, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_12) == 0x000174, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_10) == 0x00017C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_LoopEffectOnly) == 0x00018C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_LoopEffectOnly' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_DynamicCast_AsBP_Btl_Human_Base) == 0x000190, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_DynamicCast_AsBP_Btl_Human_Base' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_GetEffect_ReturnValue_1) == 0x0001A0, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_GetEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_IsValid_ReturnValue_4) == 0x0001A8, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_11) == 0x0001AC, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_CheckLoaded_ReturnValue_1) == 0x0001BC, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_CheckLoaded_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_IsValid_ReturnValue_5) == 0x0001BD, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_IsValid_ReturnValue_6) == 0x0001BE, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_GetFloatValue_ReturnValue) == 0x0001C0, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_GetFloatValue_ReturnValue_1) == 0x0001C4, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_CheckHidingPersonaForSkillScene_ReturnValue) == 0x0001C8, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_CheckHidingPersonaForSkillScene_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_Event_DeltaSeconds) == 0x0001CC, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_type_1) == 0x0001D0, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_type_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_UseCustomBlend_1) == 0x0001D1, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_UseCustomBlend_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_Blend_1) == 0x0001D4, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_Blend_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_IsAfterCutin_1) == 0x0001D8, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_IsAfterCutin_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_SwitchEnum_CmpSuccess) == 0x0001D9, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_8) == 0x0001DC, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_13) == 0x0001E4, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_12) == 0x0001EC, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_IsAfterCutin) == 0x0001FC, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_IsAfterCutin' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001FD, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_CheckPersonaStartWithoutEmergePerformance_ReturnValue) == 0x0001FE, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_CheckPersonaStartWithoutEmergePerformance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_type) == 0x0001FF, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_type' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_UseCustomBlend) == 0x000200, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_UseCustomBlend' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_Blend) == 0x000204, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_Blend' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Get_Persona_Notify_Notify_Name) == 0x000208, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Get_Persona_Notify_Notify_Name' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000210, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_SwitchEnum_CmpSuccess_2) == 0x000211, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CustomEvent_NotifyName_14) == 0x000214, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00021C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000220, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_FClamp_ReturnValue) == 0x000224, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000228, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x00022C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_Event_PersonaOwner) == 0x000230, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_Event_PersonaOwner' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_IsValid_ReturnValue_7) == 0x000238, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_DynamicCast_AsBP_Btl_Character_Base) == 0x000240, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_DynamicCast_AsBP_Btl_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_DynamicCast_bSuccess_1) == 0x000248, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_CheckHidingPersonaForSkillScene_ReturnValue_1) == 0x000249, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_CheckHidingPersonaForSkillScene_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_IsValid_ReturnValue_8) == 0x00024A, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_13) == 0x00024C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, K2Node_CreateDelegate_OutputDelegate_14) == 0x00025C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00026C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_CalcSkillAnimStartingPosition_Position) == 0x000270, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_CalcSkillAnimStartingPosition_Position' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x000274, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x000275, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000278, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_GetSkeletalMesh_SkeletalMesh_3) == 0x000280, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_GetSkeletalMesh_SkeletalMesh_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_GetRemainingTimeFromCurrentSection_ReturnValue) == 0x000288, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_GetRemainingTimeFromCurrentSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Less_FloatFloat_ReturnValue) == 0x00028C, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000290, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_IsValid_ReturnValue_9) == 0x000294, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase, CallFunc_CheckNeedToShowPersonaAtSummonShot_Show) == 0x000295, "Member 'BP_BtlPersonaBase_C_ExecuteUbergraph_BP_BtlPersonaBase::CallFunc_CheckNeedToShowPersonaAtSummonShot_Show' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.SetPersonaOwner
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlPersonaBase_C_SetPersonaOwner final
{
public:
	class ABtlActor*                              PersonaOwner_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPersonaBase_C_SetPersonaOwner) == 0x000008, "Wrong alignment on BP_BtlPersonaBase_C_SetPersonaOwner");
static_assert(sizeof(BP_BtlPersonaBase_C_SetPersonaOwner) == 0x000008, "Wrong size on BP_BtlPersonaBase_C_SetPersonaOwner");
static_assert(offsetof(BP_BtlPersonaBase_C_SetPersonaOwner, PersonaOwner_0) == 0x000000, "Member 'BP_BtlPersonaBase_C_SetPersonaOwner::PersonaOwner_0' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.Request Persona Scene Animation
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlPersonaBase_C_Request_Persona_Scene_Animation final
{
public:
	EBtlPersonaSceneAnimationType                 Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomBlend;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Blend;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPersonaBase_C_Request_Persona_Scene_Animation) == 0x000004, "Wrong alignment on BP_BtlPersonaBase_C_Request_Persona_Scene_Animation");
static_assert(sizeof(BP_BtlPersonaBase_C_Request_Persona_Scene_Animation) == 0x000008, "Wrong size on BP_BtlPersonaBase_C_Request_Persona_Scene_Animation");
static_assert(offsetof(BP_BtlPersonaBase_C_Request_Persona_Scene_Animation, Type) == 0x000000, "Member 'BP_BtlPersonaBase_C_Request_Persona_Scene_Animation::Type' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_Request_Persona_Scene_Animation, UseCustomBlend) == 0x000001, "Member 'BP_BtlPersonaBase_C_Request_Persona_Scene_Animation::UseCustomBlend' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_Request_Persona_Scene_Animation, Blend) == 0x000004, "Member 'BP_BtlPersonaBase_C_Request_Persona_Scene_Animation::Blend' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.Request Phisical Skill Animation
// 0x0001 (0x0001 - 0x0000)
struct BP_BtlPersonaBase_C_Request_Phisical_Skill_Animation final
{
public:
	bool                                          IsAfterCutin;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlPersonaBase_C_Request_Phisical_Skill_Animation) == 0x000001, "Wrong alignment on BP_BtlPersonaBase_C_Request_Phisical_Skill_Animation");
static_assert(sizeof(BP_BtlPersonaBase_C_Request_Phisical_Skill_Animation) == 0x000001, "Wrong size on BP_BtlPersonaBase_C_Request_Phisical_Skill_Animation");
static_assert(offsetof(BP_BtlPersonaBase_C_Request_Phisical_Skill_Animation, IsAfterCutin) == 0x000000, "Member 'BP_BtlPersonaBase_C_Request_Phisical_Skill_Animation::IsAfterCutin' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.Request Magic Skill Animation
// 0x0001 (0x0001 - 0x0000)
struct BP_BtlPersonaBase_C_Request_Magic_Skill_Animation final
{
public:
	bool                                          IsAfterCutin;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlPersonaBase_C_Request_Magic_Skill_Animation) == 0x000001, "Wrong alignment on BP_BtlPersonaBase_C_Request_Magic_Skill_Animation");
static_assert(sizeof(BP_BtlPersonaBase_C_Request_Magic_Skill_Animation) == 0x000001, "Wrong size on BP_BtlPersonaBase_C_Request_Magic_Skill_Animation");
static_assert(offsetof(BP_BtlPersonaBase_C_Request_Magic_Skill_Animation, IsAfterCutin) == 0x000000, "Member 'BP_BtlPersonaBase_C_Request_Magic_Skill_Animation::IsAfterCutin' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.Request Persona Animation
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlPersonaBase_C_Request_Persona_Animation final
{
public:
	EBtlPersonaAnimationType                      Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomBlend;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Blend;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPersonaBase_C_Request_Persona_Animation) == 0x000004, "Wrong alignment on BP_BtlPersonaBase_C_Request_Persona_Animation");
static_assert(sizeof(BP_BtlPersonaBase_C_Request_Persona_Animation) == 0x000008, "Wrong size on BP_BtlPersonaBase_C_Request_Persona_Animation");
static_assert(offsetof(BP_BtlPersonaBase_C_Request_Persona_Animation, Type) == 0x000000, "Member 'BP_BtlPersonaBase_C_Request_Persona_Animation::Type' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_Request_Persona_Animation, UseCustomBlend) == 0x000001, "Member 'BP_BtlPersonaBase_C_Request_Persona_Animation::UseCustomBlend' has a wrong offset!");
static_assert(offsetof(BP_BtlPersonaBase_C_Request_Persona_Animation, Blend) == 0x000004, "Member 'BP_BtlPersonaBase_C_Request_Persona_Animation::Blend' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlPersonaBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPersonaBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BtlPersonaBase_C_ReceiveTick");
static_assert(sizeof(BP_BtlPersonaBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_BtlPersonaBase_C_ReceiveTick");
static_assert(offsetof(BP_BtlPersonaBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BtlPersonaBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.On Ready Showing Emerge Effect
// 0x0001 (0x0001 - 0x0000)
struct BP_BtlPersonaBase_C_On_Ready_Showing_Emerge_Effect final
{
public:
	bool                                          LoopEffectOnly;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlPersonaBase_C_On_Ready_Showing_Emerge_Effect) == 0x000001, "Wrong alignment on BP_BtlPersonaBase_C_On_Ready_Showing_Emerge_Effect");
static_assert(sizeof(BP_BtlPersonaBase_C_On_Ready_Showing_Emerge_Effect) == 0x000001, "Wrong size on BP_BtlPersonaBase_C_On_Ready_Showing_Emerge_Effect");
static_assert(offsetof(BP_BtlPersonaBase_C_On_Ready_Showing_Emerge_Effect, LoopEffectOnly) == 0x000000, "Member 'BP_BtlPersonaBase_C_On_Ready_Showing_Emerge_Effect::LoopEffectOnly' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.OnCompleted_00B369494CAD1145A2628791C978A870
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlPersonaBase_C_OnCompleted_00B369494CAD1145A2628791C978A870 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPersonaBase_C_OnCompleted_00B369494CAD1145A2628791C978A870) == 0x000004, "Wrong alignment on BP_BtlPersonaBase_C_OnCompleted_00B369494CAD1145A2628791C978A870");
static_assert(sizeof(BP_BtlPersonaBase_C_OnCompleted_00B369494CAD1145A2628791C978A870) == 0x000008, "Wrong size on BP_BtlPersonaBase_C_OnCompleted_00B369494CAD1145A2628791C978A870");
static_assert(offsetof(BP_BtlPersonaBase_C_OnCompleted_00B369494CAD1145A2628791C978A870, NotifyName) == 0x000000, "Member 'BP_BtlPersonaBase_C_OnCompleted_00B369494CAD1145A2628791C978A870::NotifyName' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.OnBlendOut_00B369494CAD1145A2628791C978A870
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlPersonaBase_C_OnBlendOut_00B369494CAD1145A2628791C978A870 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPersonaBase_C_OnBlendOut_00B369494CAD1145A2628791C978A870) == 0x000004, "Wrong alignment on BP_BtlPersonaBase_C_OnBlendOut_00B369494CAD1145A2628791C978A870");
static_assert(sizeof(BP_BtlPersonaBase_C_OnBlendOut_00B369494CAD1145A2628791C978A870) == 0x000008, "Wrong size on BP_BtlPersonaBase_C_OnBlendOut_00B369494CAD1145A2628791C978A870");
static_assert(offsetof(BP_BtlPersonaBase_C_OnBlendOut_00B369494CAD1145A2628791C978A870, NotifyName) == 0x000000, "Member 'BP_BtlPersonaBase_C_OnBlendOut_00B369494CAD1145A2628791C978A870::NotifyName' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.OnInterrupted_00B369494CAD1145A2628791C978A870
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlPersonaBase_C_OnInterrupted_00B369494CAD1145A2628791C978A870 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPersonaBase_C_OnInterrupted_00B369494CAD1145A2628791C978A870) == 0x000004, "Wrong alignment on BP_BtlPersonaBase_C_OnInterrupted_00B369494CAD1145A2628791C978A870");
static_assert(sizeof(BP_BtlPersonaBase_C_OnInterrupted_00B369494CAD1145A2628791C978A870) == 0x000008, "Wrong size on BP_BtlPersonaBase_C_OnInterrupted_00B369494CAD1145A2628791C978A870");
static_assert(offsetof(BP_BtlPersonaBase_C_OnInterrupted_00B369494CAD1145A2628791C978A870, NotifyName) == 0x000000, "Member 'BP_BtlPersonaBase_C_OnInterrupted_00B369494CAD1145A2628791C978A870::NotifyName' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.OnNotifyBegin_00B369494CAD1145A2628791C978A870
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlPersonaBase_C_OnNotifyBegin_00B369494CAD1145A2628791C978A870 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPersonaBase_C_OnNotifyBegin_00B369494CAD1145A2628791C978A870) == 0x000004, "Wrong alignment on BP_BtlPersonaBase_C_OnNotifyBegin_00B369494CAD1145A2628791C978A870");
static_assert(sizeof(BP_BtlPersonaBase_C_OnNotifyBegin_00B369494CAD1145A2628791C978A870) == 0x000008, "Wrong size on BP_BtlPersonaBase_C_OnNotifyBegin_00B369494CAD1145A2628791C978A870");
static_assert(offsetof(BP_BtlPersonaBase_C_OnNotifyBegin_00B369494CAD1145A2628791C978A870, NotifyName) == 0x000000, "Member 'BP_BtlPersonaBase_C_OnNotifyBegin_00B369494CAD1145A2628791C978A870::NotifyName' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.OnNotifyEnd_00B369494CAD1145A2628791C978A870
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlPersonaBase_C_OnNotifyEnd_00B369494CAD1145A2628791C978A870 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPersonaBase_C_OnNotifyEnd_00B369494CAD1145A2628791C978A870) == 0x000004, "Wrong alignment on BP_BtlPersonaBase_C_OnNotifyEnd_00B369494CAD1145A2628791C978A870");
static_assert(sizeof(BP_BtlPersonaBase_C_OnNotifyEnd_00B369494CAD1145A2628791C978A870) == 0x000008, "Wrong size on BP_BtlPersonaBase_C_OnNotifyEnd_00B369494CAD1145A2628791C978A870");
static_assert(offsetof(BP_BtlPersonaBase_C_OnNotifyEnd_00B369494CAD1145A2628791C978A870, NotifyName) == 0x000000, "Member 'BP_BtlPersonaBase_C_OnNotifyEnd_00B369494CAD1145A2628791C978A870::NotifyName' has a wrong offset!");

// Function BP_BtlPersonaBase.BP_BtlPersonaBase_C.OnCompleted_0F563E704A8F70393E6FEB836877B9A4
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlPersonaBase_C_OnCompleted_0F563E704A8F70393E6FEB836877B9A4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlPersonaBase_C_OnCompleted_0F563E704A8F70393E6FEB836877B9A4) == 0x000004, "Wrong alignment on BP_BtlPersonaBase_C_OnCompleted_0F563E704A8F70393E6FEB836877B9A4");
static_assert(sizeof(BP_BtlPersonaBase_C_OnCompleted_0F563E704A8F70393E6FEB836877B9A4) == 0x000008, "Wrong size on BP_BtlPersonaBase_C_OnCompleted_0F563E704A8F70393E6FEB836877B9A4");
