#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlHumanBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Xrd777_structs.hpp"
#include "BP_BtlCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlHumanBase.BP_BtlHumanBase_C
// 0x01B0 (0x10E80 - 0x10CD0)
class ABP_BtlHumanBase_C final : public ABP_BtlCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BtlHumanBase_C;                  // 0x10CD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ChildActorSummonGun;                               // 0x10CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Character_Hiding_Power_30D42FCD4CBBEB04AE6ADDA092F52FA9; // 0x10CE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Character_Hiding__Direction_30D42FCD4CBBEB04AE6ADDA092F52FA9; // 0x10CE4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10CE5[0x3];                                    // 0x10CE5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Character_Hiding;                                  // 0x10CE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EscapeFadeOut_Ratio_0D48F6BF4389BDD8DDD64E857F7B7FD9; // 0x10CF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EscapeFadeOut__Direction_0D48F6BF4389BDD8DDD64E857F7B7FD9; // 0x10CF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10CF5[0x3];                                    // 0x10CF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EscapeFadeOut;                                     // 0x10CF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Command_Sequence_Actor;                            // 0x10D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Perfomance_Sequence_Ator;                          // 0x10D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CharacterLoading;                                  // 0x10D10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CharacterLoaded;                                   // 0x10D11(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D12[0x6];                                    // 0x10D12(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlSummonGun_C*                     SummonGun;                                         // 0x10D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SummonEffect;                                      // 0x10D20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Summon_Camera;                                     // 0x10D28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            SceneAnimMontage;                                  // 0x10D30(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         CostumeID;                                         // 0x10D58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D5C[0x4];                                    // 0x10D5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       HumanMID;                                          // 0x10D60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          LoadedShiftSeq;                                    // 0x10D70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LoadedShiftStuff;                                  // 0x10D71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D72[0x6];                                    // 0x10D72(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         LS_Summon_Camera;                                  // 0x10D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlTheurgiaController_C*            TheurgiaController;                                // 0x10D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TheurgiaStuffLoaded;                               // 0x10D88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TheurgiaPersonaLoaded;                             // 0x10D89(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EVisibilityBasedAnimTickOption                Initial_Visibility_Based_Anim_Tick_Option;         // 0x10D8A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D8B[0x1];                                    // 0x10D8B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GunAttachSocket;                                   // 0x10D8C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D94[0x4];                                    // 0x10D94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    TakeoverCameraActor;                               // 0x10D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadedShiftSeqA;                                   // 0x10DA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LoadedShiftSeqB;                                   // 0x10DA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10DA2[0x6];                                    // 0x10DA2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         LS_Critical_Camera;                                // 0x10DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LS_Critical_Actor;                                 // 0x10DB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppCharCategoryType                          AppCharCategory;                                   // 0x10DB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppCharWeaponType                            Weapon_Type;                                       // 0x10DB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10DBA[0x6];                                    // 0x10DBA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             FaceAnimTable;                                     // 0x10DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AppKoromaru_C*                      App_Koromaru;                                      // 0x10DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEscaping;                                        // 0x10DD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsNeedToDelayBeforeShift;                          // 0x10DD1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10DD2[0x6];                                    // 0x10DD2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 BP_Fuka_For_Theurgia;                              // 0x10DD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         SummonShellEX;                                     // 0x10DE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlSceneAnimationType                        LatestPlayedSceneAnim;                             // 0x10DE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10DE9[0x3];                                    // 0x10DE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreSkillCamDuration;                               // 0x10DEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             WeaponVisibleTable;                                // 0x10DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SecName;                                           // 0x10DF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          LS_FirstSummonScene;                               // 0x10E00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ALevelSequenceActor*                    FirstSummonSceneActor;                             // 0x10E28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNeedFirstSummonScene;                            // 0x10E30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPlayingFirstSummonScene;                         // 0x10E31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E32[0x6];                                    // 0x10E32(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         As_Level_Sequence;                                 // 0x10E38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          LoadedFirstSummonScene;                            // 0x10E40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E41[0x7];                                    // 0x10E41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         NSSummonEffect;                                    // 0x10E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NSPersonaAuraEffect;                               // 0x10E50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NSPersonaAuraShineEffect;                          // 0x10E58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHiding;                                          // 0x10E60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E61[0x7];                                    // 0x10E61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           AnimMontageSceneData;                              // 0x10E68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSummonEffectEmergingScene;                       // 0x10E70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BtlHumanBase(int32 EntryPoint);
	void SummonGunTurnToTheurgiaMode();
	void On_Load_Non_Resident_Assets();
	void ShowFromHiding();
	void SetupForEventMode(bool Enable);
	void CharacterDestroy();
	void HideForOtherAction(bool CriticalHindrance, bool Rapid, bool HalfMode);
	void Has_Finished_Cutin_Finalize_Fade();
	void On_Finalize_Cutin();
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void On_Clear_Sequence_Camera();
	void Has_Finished_Critical_Attack_Camera();
	void On_Prepare_Standby_Cutin();
	void DestroyPersonaBeforeCreatePersona();
	void Has_Finished_First_Summon_Scene();
	void On_Play_First_Summon_Scene();
	void Standby_First_Summon_Scene();
	void On_Call_Theurgia_Skill_Scene_to_Skill_End();
	void On_Call_Theurgia_Skill_Scene();
	void On_Destroy_Persona_For_Event();
