#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiAnalyze

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Xrd777_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlGuiAnalyze.BP_BtlGuiAnalyze_C.ExecuteUbergraph_BP_BtlGuiAnalyze
// 0x0228 (0x0228 - 0x0000)
struct BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawText                        K2Node_MakeStruct_BtlGuiDrawText;                  // 0x0018(0x0058)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckPlayingEventScript_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawText_outID;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectText*                  CallFunc_CreateDrawText_outItem;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetGroupDrawItem_idAry;                   // 0x0098(0x0010)(ReferenceParm)
	TArray<class UBtlGuiDrawObjectCore*>          CallFunc_GetGroupDrawItem_objAry;                  // 0x00A8(0x0010)(ReferenceParm)
	class UBtlGuiDrawObjectCore*                  CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawPanel                       K2Node_MakeStruct_BtlGuiDrawPanel;                 // 0x00CC(0x003C)(NoDestructor)
	int32                                         CallFunc_CreateDrawPanel_outID;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPanel*                 CallFunc_CreateDrawPanel_outItem;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0127(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_14;               // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckHighAnalyzeUnlocked_ReturnValue;     // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_15;               // 0x0137(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_deltaTime;                            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_flag;                                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_param;                                // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckHighAnalyzeUnlocked_ReturnValue_1;   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiBaseActor_C*                  CallFunc_FindGUIActor_GuiActor;                    // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindGUIActor_sucsess;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiIcon_C*                       K2Node_DynamicCast_AsBP_Btl_Gui_Icon;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item_1;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetID_ReturnValue;                        // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_CheckShowFukaFukidashi_ReturnValue;       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item_2;                         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlGuiBaseActor_C*                  CallFunc_FindGUIActor_GuiActor_1;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindGUIActor_sucsess_1;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiIcon_C*                       K2Node_DynamicCast_AsBP_Btl_Gui_Icon_1;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze) == 0x000008, "Wrong alignment on BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze");
static_assert(sizeof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze) == 0x000228, "Wrong size on BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, EntryPoint) == 0x000000, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000010, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_MakeStruct_BtlGuiDrawText) == 0x000018, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_MakeStruct_BtlGuiDrawText' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_CheckPlayingEventScript_ReturnValue) == 0x000080, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_CheckPlayingEventScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, Temp_int_Array_Index_Variable) == 0x000084, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_CreateDrawText_outID) == 0x000088, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_CreateDrawText_outID' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_CreateDrawText_outItem) == 0x000090, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_CreateDrawText_outItem' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_GetGroupDrawItem_idAry) == 0x000098, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_GetGroupDrawItem_idAry' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_GetGroupDrawItem_objAry) == 0x0000A8, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_GetGroupDrawItem_objAry' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_MakeStruct_Color) == 0x0000C8, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_MakeStruct_BtlGuiDrawPanel) == 0x0000CC, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_MakeStruct_BtlGuiDrawPanel' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_CreateDrawPanel_outID) == 0x000108, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_CreateDrawPanel_outID' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_CreateDrawPanel_outItem) == 0x000110, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_CreateDrawPanel_outItem' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000118, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue) == 0x00011C, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_1) == 0x00011D, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_2) == 0x00011E, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue) == 0x00011F, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue_1) == 0x000120, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_3) == 0x000121, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_4) == 0x000122, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_5) == 0x000123, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue_2) == 0x000124, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_6) == 0x000125, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue_3) == 0x000126, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_7) == 0x000127, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue_4) == 0x000128, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_8) == 0x000129, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue_5) == 0x00012A, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_9) == 0x00012B, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_10) == 0x00012C, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue_6) == 0x00012D, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue_7) == 0x00012E, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_11) == 0x00012F, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_12) == 0x000130, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue_8) == 0x000131, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue_9) == 0x000132, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_13) == 0x000133, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_14) == 0x000134, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue_10) == 0x000135, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_CheckHighAnalyzeUnlocked_ReturnValue) == 0x000136, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_CheckHighAnalyzeUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Not_PreBool_ReturnValue_15) == 0x000137, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Not_PreBool_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_Event_DeltaSeconds) == 0x000138, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_BooleanAND_ReturnValue_11) == 0x00013C, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_Event_deltaTime) == 0x000140, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_Event_deltaTime' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_CreateDelegate_OutputDelegate_1) == 0x000144, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000154, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_CreateDelegate_OutputDelegate_2) == 0x000158, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_CreateDelegate_OutputDelegate_3) == 0x000168, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_Event_flag) == 0x000178, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_Event_flag' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_Event_param) == 0x00017C, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_Event_param' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_CreateDelegate_OutputDelegate_4) == 0x000180, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_CreateDelegate_OutputDelegate_5) == 0x000190, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001A0, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_CheckHighAnalyzeUnlocked_ReturnValue_1) == 0x0001B0, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_CheckHighAnalyzeUnlocked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_FindGUIActor_GuiActor) == 0x0001B8, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_FindGUIActor_GuiActor' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_FindGUIActor_sucsess) == 0x0001C0, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_FindGUIActor_sucsess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_DynamicCast_AsBP_Btl_Gui_Icon) == 0x0001C8, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_DynamicCast_AsBP_Btl_Gui_Icon' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Array_Get_Item_1) == 0x0001D8, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_GetID_ReturnValue) == 0x0001E0, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_GetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_MakeArray_Array) == 0x0001E8, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_CheckShowFukaFukidashi_ReturnValue) == 0x0001F8, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_CheckShowFukaFukidashi_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_Array_Get_Item_2) == 0x000200, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_FindGUIActor_GuiActor_1) == 0x000208, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_FindGUIActor_GuiActor_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, CallFunc_FindGUIActor_sucsess_1) == 0x000210, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::CallFunc_FindGUIActor_sucsess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_DynamicCast_AsBP_Btl_Gui_Icon_1) == 0x000218, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_DynamicCast_AsBP_Btl_Gui_Icon_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze, K2Node_DynamicCast_bSuccess_1) == 0x000220, "Member 'BP_BtlGuiAnalyze_C_ExecuteUbergraph_BP_BtlGuiAnalyze::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_BtlGuiAnalyze.BP_BtlGuiAnalyze_C.GuiActorStateInit
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlGuiAnalyze_C_GuiActorStateInit final
{
public:
	bool                                          Flag;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiAnalyze_C_GuiActorStateInit) == 0x000004, "Wrong alignment on BP_BtlGuiAnalyze_C_GuiActorStateInit");
static_assert(sizeof(BP_BtlGuiAnalyze_C_GuiActorStateInit) == 0x000008, "Wrong size on BP_BtlGuiAnalyze_C_GuiActorStateInit");
static_assert(offsetof(BP_BtlGuiAnalyze_C_GuiActorStateInit, Flag) == 0x000000, "Member 'BP_BtlGuiAnalyze_C_GuiActorStateInit::Flag' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_GuiActorStateInit, Param) == 0x000004, "Member 'BP_BtlGuiAnalyze_C_GuiActorStateInit::Param' has a wrong offset!");

// Function BP_BtlGuiAnalyze.BP_BtlGuiAnalyze_C.GuiActorUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlGuiAnalyze_C_GuiActorUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiAnalyze_C_GuiActorUpdate) == 0x000004, "Wrong alignment on BP_BtlGuiAnalyze_C_GuiActorUpdate");
static_assert(sizeof(BP_BtlGuiAnalyze_C_GuiActorUpdate) == 0x000004, "Wrong size on BP_BtlGuiAnalyze_C_GuiActorUpdate");
static_assert(offsetof(BP_BtlGuiAnalyze_C_GuiActorUpdate, DeltaTime) == 0x000000, "Member 'BP_BtlGuiAnalyze_C_GuiActorUpdate::DeltaTime' has a wrong offset!");

// Function BP_BtlGuiAnalyze.BP_BtlGuiAnalyze_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlGuiAnalyze_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiAnalyze_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BtlGuiAnalyze_C_ReceiveTick");
static_assert(sizeof(BP_BtlGuiAnalyze_C_ReceiveTick) == 0x000004, "Wrong size on BP_BtlGuiAnalyze_C_ReceiveTick");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BtlGuiAnalyze_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BtlGuiAnalyze.BP_BtlGuiAnalyze_C.kari Draw
// 0x00D8 (0x00D8 - 0x0000)
struct BP_BtlGuiAnalyze_C_Kari_Draw final
{
public:
	class FString                                 String_Work;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AttrText;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetGroupDrawItem_idAry;                   // 0x0040(0x0010)(ReferenceParm)
	TArray<class UBtlGuiDrawObjectCore*>          CallFunc_GetGroupDrawItem_objAry;                  // 0x0050(0x0010)(ReferenceParm)
	class UBtlGuiDrawObjectCore*                  CallFunc_GetDrawItem_obj;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      CallFunc_GetTargets_ReturnValue;                   // 0x0068(0x0010)(ReferenceParm)
	class UBtlGuiDrawObjectText*                  K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Text;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlDataAnalyze                               CallFunc_GatAnalizeAttr_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUnitName_ReturnValue;                  // 0x0098(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectCore*                  CallFunc_GetDrawItem_obj_1;                        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectText*                  K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Text_1;   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlGuiAnalyze_C_Kari_Draw) == 0x000008, "Wrong alignment on BP_BtlGuiAnalyze_C_Kari_Draw");
static_assert(sizeof(BP_BtlGuiAnalyze_C_Kari_Draw) == 0x0000D8, "Wrong size on BP_BtlGuiAnalyze_C_Kari_Draw");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, String_Work) == 0x000000, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::String_Work' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, AttrText) == 0x000010, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::AttrText' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, Temp_int_Variable) == 0x000030, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_Conv_IntToByte_ReturnValue) == 0x000034, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000035, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000036, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_GetGroupDrawItem_idAry) == 0x000040, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_GetGroupDrawItem_idAry' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_GetGroupDrawItem_objAry) == 0x000050, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_GetGroupDrawItem_objAry' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_GetDrawItem_obj) == 0x000060, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_GetDrawItem_obj' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_GetTargets_ReturnValue) == 0x000068, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_GetTargets_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Text) == 0x000078, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Text' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_GatAnalizeAttr_ReturnValue) == 0x000090, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_GatAnalizeAttr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, K2Node_SwitchEnum_CmpSuccess) == 0x000091, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_IsValid_ReturnValue) == 0x000092, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_IsValid_ReturnValue_1) == 0x000093, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_GetUnitName_ReturnValue) == 0x000098, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_GetUnitName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B0, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, CallFunc_GetDrawItem_obj_1) == 0x0000C0, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::CallFunc_GetDrawItem_obj_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Text_1) == 0x0000C8, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Text_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Kari_Draw, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'BP_BtlGuiAnalyze_C_Kari_Draw::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_BtlGuiAnalyze.BP_BtlGuiAnalyze_C.Calc Alpha Color
// 0x0028 (0x0028 - 0x0000)
struct BP_BtlGuiAnalyze_C_Calc_Alpha_Color final
{
public:
	struct FColor                                 InColor;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lerp;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CalcedAlpha;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_FCeil64_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_Int64ToByte_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiAnalyze_C_Calc_Alpha_Color) == 0x000008, "Wrong alignment on BP_BtlGuiAnalyze_C_Calc_Alpha_Color");
static_assert(sizeof(BP_BtlGuiAnalyze_C_Calc_Alpha_Color) == 0x000028, "Wrong size on BP_BtlGuiAnalyze_C_Calc_Alpha_Color");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Calc_Alpha_Color, InColor) == 0x000000, "Member 'BP_BtlGuiAnalyze_C_Calc_Alpha_Color::InColor' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Calc_Alpha_Color, Lerp) == 0x000004, "Member 'BP_BtlGuiAnalyze_C_Calc_Alpha_Color::Lerp' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Calc_Alpha_Color, CalcedAlpha) == 0x000008, "Member 'BP_BtlGuiAnalyze_C_Calc_Alpha_Color::CalcedAlpha' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Calc_Alpha_Color, CallFunc_Conv_ByteToFloat_ReturnValue) == 0x00000C, "Member 'BP_BtlGuiAnalyze_C_Calc_Alpha_Color::CallFunc_Conv_ByteToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Calc_Alpha_Color, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_BtlGuiAnalyze_C_Calc_Alpha_Color::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Calc_Alpha_Color, CallFunc_FCeil64_ReturnValue) == 0x000018, "Member 'BP_BtlGuiAnalyze_C_Calc_Alpha_Color::CallFunc_FCeil64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Calc_Alpha_Color, CallFunc_Conv_Int64ToByte_ReturnValue) == 0x000020, "Member 'BP_BtlGuiAnalyze_C_Calc_Alpha_Color::CallFunc_Conv_Int64ToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_Calc_Alpha_Color, K2Node_MakeStruct_Color) == 0x000024, "Member 'BP_BtlGuiAnalyze_C_Calc_Alpha_Color::K2Node_MakeStruct_Color' has a wrong offset!");

// Function BP_BtlGuiAnalyze.BP_BtlGuiAnalyze_C.SetShowEnemy
// 0x0028 (0x0028 - 0x0000)
struct BP_BtlGuiAnalyze_C_SetShowEnemy final
{
public:
	class ABtlActor*                              Enemy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlGuiAnalyze_C_SetShowEnemy) == 0x000008, "Wrong alignment on BP_BtlGuiAnalyze_C_SetShowEnemy");
static_assert(sizeof(BP_BtlGuiAnalyze_C_SetShowEnemy) == 0x000028, "Wrong size on BP_BtlGuiAnalyze_C_SetShowEnemy");
static_assert(offsetof(BP_BtlGuiAnalyze_C_SetShowEnemy, Enemy) == 0x000000, "Member 'BP_BtlGuiAnalyze_C_SetShowEnemy::Enemy' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_SetShowEnemy, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_BtlGuiAnalyze_C_SetShowEnemy::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_SetShowEnemy, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_BtlGuiAnalyze_C_SetShowEnemy::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_SetShowEnemy, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_BtlGuiAnalyze_C_SetShowEnemy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_SetShowEnemy, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_BtlGuiAnalyze_C_SetShowEnemy::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_SetShowEnemy, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_BtlGuiAnalyze_C_SetShowEnemy::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_SetShowEnemy, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_BtlGuiAnalyze_C_SetShowEnemy::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_SetShowEnemy, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000021, "Member 'BP_BtlGuiAnalyze_C_SetShowEnemy::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_BtlGuiAnalyze.BP_BtlGuiAnalyze_C.CloseAnalyze
// 0x0040 (0x0040 - 0x0000)
struct BP_BtlGuiAnalyze_C_CloseAnalyze final
{
public:
	EBtlGuiState                                  NextState;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiBaseActor_C*                  CallFunc_FindGUIActor_GuiActor;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindGUIActor_sucsess;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlGuiIcon_C*                       K2Node_DynamicCast_AsBP_Btl_Gui_Icon;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlGuiState                                  CallFunc_GetPrevState_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiAnalyze_C_CloseAnalyze) == 0x000008, "Wrong alignment on BP_BtlGuiAnalyze_C_CloseAnalyze");
static_assert(sizeof(BP_BtlGuiAnalyze_C_CloseAnalyze) == 0x000040, "Wrong size on BP_BtlGuiAnalyze_C_CloseAnalyze");
static_assert(offsetof(BP_BtlGuiAnalyze_C_CloseAnalyze, NextState) == 0x000000, "Member 'BP_BtlGuiAnalyze_C_CloseAnalyze::NextState' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_CloseAnalyze, CallFunc_FindGUIActor_GuiActor) == 0x000008, "Member 'BP_BtlGuiAnalyze_C_CloseAnalyze::CallFunc_FindGUIActor_GuiActor' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_CloseAnalyze, CallFunc_FindGUIActor_sucsess) == 0x000010, "Member 'BP_BtlGuiAnalyze_C_CloseAnalyze::CallFunc_FindGUIActor_sucsess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_CloseAnalyze, K2Node_DynamicCast_AsBP_Btl_Gui_Icon) == 0x000018, "Member 'BP_BtlGuiAnalyze_C_CloseAnalyze::K2Node_DynamicCast_AsBP_Btl_Gui_Icon' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_CloseAnalyze, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_BtlGuiAnalyze_C_CloseAnalyze::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_CloseAnalyze, CallFunc_GetMainCharacter_ReturnValue) == 0x000028, "Member 'BP_BtlGuiAnalyze_C_CloseAnalyze::CallFunc_GetMainCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_CloseAnalyze, CallFunc_GetPrevState_ReturnValue) == 0x000030, "Member 'BP_BtlGuiAnalyze_C_CloseAnalyze::CallFunc_GetPrevState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_CloseAnalyze, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000031, "Member 'BP_BtlGuiAnalyze_C_CloseAnalyze::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiAnalyze_C_CloseAnalyze, CallFunc_GetMainCharacter_ReturnValue_1) == 0x000038, "Member 'BP_BtlGuiAnalyze_C_CloseAnalyze::CallFunc_GetMainCharacter_ReturnValue_1' has a wrong offset!");

// Function BP_BtlGuiAnalyze.BP_BtlGuiAnalyze_C.ChangeAnalyzeTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlGuiAnalyze_C_ChangeAnalyzeTarget final
{
public:
	class ABtlActor*                              CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiAnalyze_C_ChangeAnalyzeTarget) == 0x000008, "Wrong alignment on BP_BtlGuiAnalyze_C_ChangeAnalyzeTarget");
static_assert(sizeof(BP_BtlGuiAnalyze_C_ChangeAnalyzeTarget) == 0x000008, "Wrong size on BP_BtlGuiAnalyze_C_ChangeAnalyzeTarget");
static_assert(offsetof(BP_BtlGuiAnalyze_C_ChangeAnalyzeTarget, CallFunc_Array_Get_Item) == 0x000000, "Member 'BP_BtlGuiAnalyze_C_ChangeAnalyzeTarget::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_BtlGuiAnalyze.BP_BtlGuiAnalyze_C.StartHighAnalyze
// 0x00C8 (0x00C8 - 0x0000)
struct BP_BtlGuiAnalyze_C_StartHighAnalyze final
{
public:
	bool                                          IsWeak;                                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsShowAttr;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PosKnownIcon;                                      // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeKnownIcon;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
