#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlMainConductor

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlMainConductor.BP_BtlMainConductor_C.ExecuteUbergraph_BP_BtlMainConductor
// 0x0490 (0x0490 - 0x0000)
struct BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckUseQuickEncount_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_2;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckUseQuickEncount_ReturnValue_1;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_3;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckUseQuickEncount_ReturnValue_2;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_4;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckUseQuickEncount_ReturnValue_3;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_5;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_6;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_7;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_8;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInitialTransform_trans;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_9;                     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlPhaseFighting_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_10;                    // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_11;                    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPlayingEventScript_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_12;                    // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPlayingEventScript_ReturnValue_1;    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBattleCoreLoaded_ReturnValue;        // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_13;                    // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlEncountWipeCore*                    CallFunc_BtlEncountWipeGetInstance_ReturnValue;    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlEncountWipeCore*                    CallFunc_BtlEncountWipeGetInstance_ReturnValue_1;  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_14;                    // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_197[0x1];                                      // 0x0197(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_15;                    // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_16;                    // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckReadyPerformerData_Ready;            // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6[0x2];                                      // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_17;                    // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlTargetManager_C*                 CallFunc_GetTargetsManager_TargetsManager;         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_18;                    // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_19;                    // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_20;                    // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_21;                    // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_22;                    // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_23;                    // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      CallFunc_GetAllCharacterList_ReturnValue;          // 0x0210(0x0010)(ReferenceParm)
	class ABtlActor*                              CallFunc_Array_Get_Item;                           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckReadyCharacterBP_ReturnValue;        // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_24;                    // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_25;                    // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_26;                    // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlEncountWipeCore*                    CallFunc_BtlEncountWipeGetInstance_ReturnValue_2;  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_27;                    // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_28;                    // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_29;                    // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_30;                    // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_31;                    // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckUseQuickEncount_ReturnValue_4;       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_32;                    // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_33;                    // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_34;                    // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckUseQuickEncount_ReturnValue_5;       // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_35;                    // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_36;                    // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_37;                    // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlEncountParam                       K2Node_CustomEvent_Encount_Param;                  // 0x02E8(0x0024)(NoDestructor)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebug_ReturnValue;                      // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0344(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0354(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0368(0x0010)(ZeroConstructor, NoDestructor)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_38;                    // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasEvent_Has_Event;                       // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383[0xD];                                      // 0x0383(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInitialTransform_trans_1;              // 0x0390(0x0030)(IsPlainOldData, NoDestructor)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_39;                    // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlPhaseFighting_C*                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlTargetManager_C*                 CallFunc_GetTargetsManager_TargetsManager_1;       // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_40;                    // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_41;                    // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_42;                    // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_43;                    // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlEncountParam                       CallFunc_CoordinateEncountParam_ReturnValue;       // 0x0408(0x0024)(NoDestructor)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_44;                    // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlCoreComponent_C*                 CallFunc_GetBtlCore_BtlCore_45;                    // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetupDebugKill_RejectDebugKillRequest;    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0xF];                                      // 0x0441(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0450(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlSpawnedActorParent_C*            CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor) == 0x000010, "Wrong alignment on BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor");
static_assert(sizeof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor) == 0x000490, "Wrong size on BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, EntryPoint) == 0x000000, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore) == 0x000008, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_1) == 0x000010, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_CheckUseQuickEncount_ReturnValue) == 0x000018, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_CheckUseQuickEncount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_2) == 0x000020, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_2' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_CheckUseQuickEncount_ReturnValue_1) == 0x000028, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_CheckUseQuickEncount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_3) == 0x000030, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_3' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_CheckUseQuickEncount_ReturnValue_2) == 0x000038, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_CheckUseQuickEncount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_4) == 0x000040, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_4' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_CheckUseQuickEncount_ReturnValue_3) == 0x000048, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_CheckUseQuickEncount_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_5) == 0x000050, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_5' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_BooleanOR_ReturnValue) == 0x000058, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_6) == 0x000060, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_6' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_7) == 0x000068, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_7' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_8) == 0x000070, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_8' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetInitialTransform_trans) == 0x000080, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetInitialTransform_trans' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_9) == 0x0000B8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_9' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_10) == 0x0000C8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_10' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000D0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_CreateDelegate_OutputDelegate) == 0x0000D4, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E4, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_11) == 0x0000F8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_11' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_CheckPlayingEventScript_ReturnValue) == 0x000100, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_CheckPlayingEventScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_CreateDelegate_OutputDelegate_2) == 0x000104, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_12) == 0x000118, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_12' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_CheckPlayingEventScript_ReturnValue_1) == 0x000120, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_CheckPlayingEventScript_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_CheckBattleCoreLoaded_ReturnValue) == 0x000121, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_CheckBattleCoreLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_CreateDelegate_OutputDelegate_3) == 0x000124, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000134, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_CreateDelegate_OutputDelegate_4) == 0x000138, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_CreateDelegate_OutputDelegate_5) == 0x000148, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_13) == 0x000158, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_13' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_BtlEncountWipeGetInstance_ReturnValue) == 0x000160, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_BtlEncountWipeGetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_BtlEncountWipeGetInstance_ReturnValue_1) == 0x000168, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_BtlEncountWipeGetInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_IsValid_ReturnValue_1) == 0x000170, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000174, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_CreateDelegate_OutputDelegate_6) == 0x000178, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_14) == 0x000188, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_14' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000190, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000194, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000195, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_BooleanAND_ReturnValue) == 0x000196, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_15) == 0x000198, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_15' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_16) == 0x0001A0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_16' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_Event_DeltaSeconds) == 0x0001A8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0001AC, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x0001AD, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, Temp_int_Array_Index_Variable) == 0x0001B0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_CheckReadyPerformerData_Ready) == 0x0001B4, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_CheckReadyPerformerData_Ready' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_BooleanAND_ReturnValue_1) == 0x0001B5, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_17) == 0x0001B8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_17' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_BooleanAND_ReturnValue_2) == 0x0001C0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetTargetsManager_TargetsManager) == 0x0001C8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetTargetsManager_TargetsManager' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, Temp_int_Variable) == 0x0001D0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_18) == 0x0001D8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_18' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_19) == 0x0001E0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_19' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_20) == 0x0001E8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_20' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_21) == 0x0001F0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_21' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_22) == 0x0001F8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_22' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_23) == 0x000200, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_23' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_IsValid_ReturnValue_2) == 0x000208, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetAllCharacterList_ReturnValue) == 0x000210, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetAllCharacterList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Array_Get_Item) == 0x000220, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Array_Length_ReturnValue) == 0x000228, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_CheckReadyCharacterBP_ReturnValue) == 0x00022C, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_CheckReadyCharacterBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_24) == 0x000230, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_24' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_25) == 0x000238, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_25' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000240, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, Temp_int_Loop_Counter_Variable) == 0x000244, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Less_IntInt_ReturnValue) == 0x000248, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Add_IntInt_ReturnValue) == 0x00024C, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_26) == 0x000250, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_26' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_BtlEncountWipeGetInstance_ReturnValue_2) == 0x000258, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_BtlEncountWipeGetInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_27) == 0x000260, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_27' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_28) == 0x000268, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_28' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000270, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_29) == 0x000278, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_29' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_30) == 0x000280, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_30' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_31) == 0x000288, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_31' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_CheckUseQuickEncount_ReturnValue_4) == 0x000290, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_CheckUseQuickEncount_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000291, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, Temp_int_Variable_1) == 0x000294, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Array_Length_ReturnValue_1) == 0x000298, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Greater_IntInt_ReturnValue) == 0x00029C, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002A0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_32) == 0x0002A8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_32' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_33) == 0x0002B0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_33' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_34) == 0x0002B8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_34' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_IsValid_ReturnValue_3) == 0x0002C0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_CheckUseQuickEncount_ReturnValue_5) == 0x0002C1, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_CheckUseQuickEncount_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002C4, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x0002C8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002C9, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_35) == 0x0002D0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_35' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_36) == 0x0002D8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_36' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_37) == 0x0002E0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_37' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_CustomEvent_Encount_Param) == 0x0002E8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_CustomEvent_Encount_Param' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Conv_IntToString_ReturnValue) == 0x000310, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_MakeLiteralString_ReturnValue) == 0x000320, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_Concat_StrStr_ReturnValue) == 0x000330, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_IsDebug_ReturnValue) == 0x000340, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_IsDebug_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_CreateDelegate_OutputDelegate_7) == 0x000344, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_CreateDelegate_OutputDelegate_8) == 0x000354, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_IsValid_ReturnValue_4) == 0x000364, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, K2Node_CreateDelegate_OutputDelegate_9) == 0x000368, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_38) == 0x000378, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_38' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_IsValid_ReturnValue_5) == 0x000380, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_HasEvent_Has_Event) == 0x000381, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_HasEvent_Has_Event' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000382, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetInitialTransform_trans_1) == 0x000390, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetInitialTransform_trans_1' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_GetBtlCore_BtlCore_39) == 0x0003C0, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_GetBtlCore_BtlCore_39' has a wrong offset!");
static_assert(offsetof(BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0003C8, "Member 'BP_BtlMainConductor_C_ExecuteUbergraph_BP_BtlMainConductor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
