#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiJyokyoHelp

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlGuiJyokyoHelp.BP_BtlGuiJyokyoHelp_C.ExecuteUbergraph_BP_BtlGuiJyokyoHelp
// 0x08E0 (0x08E0 - 0x0000)
struct BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState;                   // 0x0006(0x0008)(NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDebugJyokyoHelpID_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_deltaTime;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetOthersAdjustedPosition_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_CalcAdjustedScale_adjustedScale;          // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcAdjustedScale_lineBreak;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_CalcAdjustedScale_adjustedScale_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcAdjustedScale_lineBreak_1;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_1;                 // 0x005C(0x0008)(NoDestructor)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex;                    // 0x0074(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_1;                  // 0x0088(0x0014)(NoDestructor)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_3;       // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_2;                  // 0x00AC(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_3;                  // 0x00C0(0x0014)(NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBtlGuiVertex>                  K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive;             // 0x00E8(0x0060)()
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_2;                 // 0x0148(0x0008)(NoDestructor)
	int32                                         CallFunc_CreateDrawPrimitive_outID;                // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_3;                 // 0x0160(0x0008)(NoDestructor)
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_1;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0xC];                                      // 0x0184(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawRect                        K2Node_MakeStruct_BtlGuiDrawRect;                  // 0x0190(0x0050)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_4;                 // 0x01E0(0x0008)(NoDestructor)
	int32                                         CallFunc_CreateDrawRect_outID;                     // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectRect*                  CallFunc_CreateDrawRect_outItem;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_5;                 // 0x01F9(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_6;                 // 0x0201(0x0008)(NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_4;                  // 0x020C(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_5;                  // 0x0220(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_6;                  // 0x0234(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_7;                  // 0x0248(0x0014)(NoDestructor)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBtlGuiVertex>                  K2Node_MakeArray_Array_1;                          // 0x0260(0x0010)(ReferenceParm)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive_1;           // 0x0270(0x0060)()
	int32                                         CallFunc_CreateDrawPrimitive_outID_1;              // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem_1;            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_4;       // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_7;                 // 0x02E8(0x0008)(NoDestructor)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_5;       // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_6;       // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_8;                  // 0x0300(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_9;                  // 0x0314(0x0014)(NoDestructor)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_7;       // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_8;       // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_10;                 // 0x0338(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_11;                 // 0x034C(0x0014)(NoDestructor)
	TArray<struct FBtlGuiVertex>                  K2Node_MakeArray_Array_2;                          // 0x0360(0x0010)(ReferenceParm)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive_2;           // 0x0370(0x0060)()
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_8;                 // 0x03D0(0x0008)(NoDestructor)
	int32                                         CallFunc_CreateDrawPrimitive_outID_2;              // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem_2;            // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_9;       // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_9;                 // 0x03F9(0x0008)(NoDestructor)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0404(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_10;                // 0x040C(0x0008)(NoDestructor)
	struct FBtlBlendState                         K2Node_MakeStruct_BtlBlendState_11;                // 0x0414(0x0008)(NoDestructor)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_10;      // 0x041C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_11;      // 0x0424(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_12;      // 0x042C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USprAsset*                              CallFunc_GetResources_OutResources;                // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite;                // 0x0440(0x0050)(NoDestructor)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_1;              // 0x0490(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID;                   // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem;                 // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID_1;                 // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_1;               // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_2;              // 0x0500(0x0050)(NoDestructor)
	struct FBtlGuiDrawSprite                      K2Node_MakeStruct_BtlGuiDrawSprite_3;              // 0x0550(0x0050)(NoDestructor)
	int32                                         CallFunc_CreateDrawSprite_outID_2;                 // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_2;               // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateDrawSprite_outID_3;                 // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                CallFunc_CreateDrawSprite_outItem_3;               // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_12;                 // 0x05C0(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_13;                 // 0x05D4(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_14;                 // 0x05E8(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_15;                 // 0x05FC(0x0014)(NoDestructor)
	TArray<struct FBtlGuiVertex>                  K2Node_MakeArray_Array_3;                          // 0x0610(0x0010)(ReferenceParm)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_13;      // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive_3;           // 0x0628(0x0060)()
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_16;                 // 0x0688(0x0014)(NoDestructor)
	int32                                         CallFunc_CreateDrawPrimitive_outID_3;              // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem_3;            // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_14;      // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_17;                 // 0x06B0(0x0014)(NoDestructor)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_15;      // 0x06C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_16;      // 0x06CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_18;                 // 0x06D4(0x0014)(NoDestructor)
	struct FBtlGuiVertex                          K2Node_MakeStruct_BtlGuiVertex_19;                 // 0x06E8(0x0014)(NoDestructor)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBtlGuiVertex>                  K2Node_MakeArray_Array_4;                          // 0x0700(0x0010)(ReferenceParm)
	struct FBtlGuiDrawPrimitive                   K2Node_MakeStruct_BtlGuiDrawPrimitive_4;           // 0x0710(0x0060)()
	int32                                         CallFunc_CreateDrawPrimitive_outID_4;              // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectPrimitive*             CallFunc_CreateDrawPrimitive_outItem_4;            // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBmdAsset*                              CallFunc_GetResourcesPure_OutResources;            // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtlGuiDrawMsg                         K2Node_MakeStruct_BtlGuiDrawMsg;                   // 0x0788(0x0080)(NoDestructor)
	int32                                         CallFunc_CreateDrawMsg_outID;                      // 0x0808(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80C[0x4];                                      // 0x080C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectMsg*                   CallFunc_CreateDrawMsg_outItem;                    // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectCore*                  CallFunc_GetDrawItem_obj;                          // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectMsg*                   K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Msg;      // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlGuiDrawMsg                         K2Node_MakeStruct_BtlGuiDrawMsg_1;                 // 0x0830(0x0080)(NoDestructor)
	int32                                         CallFunc_CreateDrawMsg_outID_1;                    // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B4[0x4];                                      // 0x08B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectMsg*                   CallFunc_CreateDrawMsg_outItem_1;                  // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectCore*                  CallFunc_GetDrawItem_obj_1;                        // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawObjectMsg*                   K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Msg_1;    // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D1[0x3];                                      // 0x08D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMsgWindowLength_Width;                 // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMsgWindowLength_Height;                // 0x08D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp) == 0x000010, "Wrong alignment on BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp");
static_assert(sizeof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp) == 0x0008E0, "Wrong size on BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, EntryPoint) == 0x000000, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000005, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState) == 0x000006, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, Temp_bool_Has_Been_Initd_Variable) == 0x00000E, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_GetDebugJyokyoHelpID_ReturnValue) == 0x000010, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_GetDebugJyokyoHelpID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000015, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_BooleanAND_ReturnValue) == 0x000016, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_Event_deltaTime) == 0x000018, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_Event_deltaTime' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_GetOthersAdjustedPosition_ReturnValue) == 0x000020, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_GetOthersAdjustedPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_BreakVector2D_X) == 0x000028, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_BreakVector2D_Y) == 0x00002C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000030, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_MakeVector2D_ReturnValue) == 0x000034, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_MakeVector2D_ReturnValue_1) == 0x00003C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CalcAdjustedScale_adjustedScale) == 0x000044, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CalcAdjustedScale_adjustedScale' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CalcAdjustedScale_lineBreak) == 0x00004C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CalcAdjustedScale_lineBreak' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CalcAdjustedScale_adjustedScale_1) == 0x000050, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CalcAdjustedScale_adjustedScale_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CalcAdjustedScale_lineBreak_1) == 0x000058, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CalcAdjustedScale_lineBreak_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState_1) == 0x00005C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000064, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x00006C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex) == 0x000074, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_1) == 0x000088, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_2) == 0x00009C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_3) == 0x0000A4, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_2) == 0x0000AC, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_3) == 0x0000C0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeArray_Array) == 0x0000D8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawPrimitive) == 0x0000E8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawPrimitive' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState_2) == 0x000148, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawPrimitive_outID) == 0x000150, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawPrimitive_outID' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawPrimitive_outItem) == 0x000158, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawPrimitive_outItem' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState_3) == 0x000160, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_Color) == 0x000168, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_MakeVector4_ReturnValue) == 0x000170, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_Color_1) == 0x000180, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_Color_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawRect) == 0x000190, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawRect' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState_4) == 0x0001E0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawRect_outID) == 0x0001E8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawRect_outID' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawRect_outItem) == 0x0001F0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawRect_outItem' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, Temp_bool_IsClosed_Variable) == 0x0001F8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState_5) == 0x0001F9, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState_6) == 0x000201, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState_6' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_4) == 0x00020C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_5) == 0x000220, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_6) == 0x000234, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_6' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_7) == 0x000248, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_7' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeArray_Array_1) == 0x000260, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawPrimitive_1) == 0x000270, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawPrimitive_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawPrimitive_outID_1) == 0x0002D0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawPrimitive_outID_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawPrimitive_outItem_1) == 0x0002D8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawPrimitive_outItem_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_4) == 0x0002E0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState_7) == 0x0002E8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState_7' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_5) == 0x0002F0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_6) == 0x0002F8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_8) == 0x000300, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_8' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_9) == 0x000314, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_9' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_7) == 0x000328, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_8) == 0x000330, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_10) == 0x000338, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_10' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_11) == 0x00034C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_11' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeArray_Array_2) == 0x000360, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawPrimitive_2) == 0x000370, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawPrimitive_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState_8) == 0x0003D0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState_8' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawPrimitive_outID_2) == 0x0003D8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawPrimitive_outID_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawPrimitive_outItem_2) == 0x0003E0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawPrimitive_outItem_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_MakeVector2D_ReturnValue_2) == 0x0003E8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_9) == 0x0003F0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Array_RemoveItem_ReturnValue) == 0x0003F8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState_9) == 0x0003F9, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState_9' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_MakeVector2D_ReturnValue_3) == 0x000404, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState_10) == 0x00040C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState_10' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlBlendState_11) == 0x000414, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlBlendState_11' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_10) == 0x00041C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_11) == 0x000424, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_12) == 0x00042C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_GetResources_OutResources) == 0x000438, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_GetResources_OutResources' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawSprite) == 0x000440, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawSprite' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawSprite_1) == 0x000490, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawSprite_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawSprite_outID) == 0x0004E0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawSprite_outID' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawSprite_outItem) == 0x0004E8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawSprite_outItem' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawSprite_outID_1) == 0x0004F0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawSprite_outID_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawSprite_outItem_1) == 0x0004F8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawSprite_outItem_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawSprite_2) == 0x000500, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawSprite_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawSprite_3) == 0x000550, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawSprite_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawSprite_outID_2) == 0x0005A0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawSprite_outID_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawSprite_outItem_2) == 0x0005A8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawSprite_outItem_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawSprite_outID_3) == 0x0005B0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawSprite_outID_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawSprite_outItem_3) == 0x0005B8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawSprite_outItem_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_12) == 0x0005C0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_12' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_13) == 0x0005D4, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_13' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_14) == 0x0005E8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_14' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_15) == 0x0005FC, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_15' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeArray_Array_3) == 0x000610, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_13) == 0x000620, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawPrimitive_3) == 0x000628, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawPrimitive_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_16) == 0x000688, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_16' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawPrimitive_outID_3) == 0x00069C, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawPrimitive_outID_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawPrimitive_outItem_3) == 0x0006A0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawPrimitive_outItem_3' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_14) == 0x0006A8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_17) == 0x0006B0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_17' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_15) == 0x0006C4, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_Add_Vector2DVector2D_ReturnValue_16) == 0x0006CC, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_Add_Vector2DVector2D_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_18) == 0x0006D4, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_18' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiVertex_19) == 0x0006E8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiVertex_19' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeArray_Array_4) == 0x000700, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawPrimitive_4) == 0x000710, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawPrimitive_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawPrimitive_outID_4) == 0x000770, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawPrimitive_outID_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawPrimitive_outItem_4) == 0x000778, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawPrimitive_outItem_4' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_GetResourcesPure_OutResources) == 0x000780, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_GetResourcesPure_OutResources' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawMsg) == 0x000788, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawMsg' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawMsg_outID) == 0x000808, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawMsg_outID' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawMsg_outItem) == 0x000810, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawMsg_outItem' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_GetDrawItem_obj) == 0x000818, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_GetDrawItem_obj' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Msg) == 0x000820, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Msg' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_DynamicCast_bSuccess) == 0x000828, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_MakeStruct_BtlGuiDrawMsg_1) == 0x000830, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_MakeStruct_BtlGuiDrawMsg_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawMsg_outID_1) == 0x0008B0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawMsg_outID_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_CreateDrawMsg_outItem_1) == 0x0008B8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_CreateDrawMsg_outItem_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_GetDrawItem_obj_1) == 0x0008C0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_GetDrawItem_obj_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Msg_1) == 0x0008C8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_DynamicCast_AsBtl_Gui_Draw_Object_Msg_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, K2Node_DynamicCast_bSuccess_1) == 0x0008D0, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_GetMsgWindowLength_Width) == 0x0008D4, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_GetMsgWindowLength_Width' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp, CallFunc_GetMsgWindowLength_Height) == 0x0008D8, "Member 'BP_BtlGuiJyokyoHelp_C_ExecuteUbergraph_BP_BtlGuiJyokyoHelp::CallFunc_GetMsgWindowLength_Height' has a wrong offset!");

// Function BP_BtlGuiJyokyoHelp.BP_BtlGuiJyokyoHelp_C.GuiActorUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlGuiJyokyoHelp_C_GuiActorUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiJyokyoHelp_C_GuiActorUpdate) == 0x000004, "Wrong alignment on BP_BtlGuiJyokyoHelp_C_GuiActorUpdate");
static_assert(sizeof(BP_BtlGuiJyokyoHelp_C_GuiActorUpdate) == 0x000004, "Wrong size on BP_BtlGuiJyokyoHelp_C_GuiActorUpdate");
static_assert(offsetof(BP_BtlGuiJyokyoHelp_C_GuiActorUpdate, DeltaTime) == 0x000000, "Member 'BP_BtlGuiJyokyoHelp_C_GuiActorUpdate::DeltaTime' has a wrong offset!");

// Function BP_BtlGuiJyokyoHelp.BP_BtlGuiJyokyoHelp_C.SetParam
// 0x0028 (0x0028 - 0x0000)
struct BP_BtlGuiJyokyoHelp_C_SetParam final
{
public:
	class ABP_BtlGuiIcon_C*                       BtlGuiIcon_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Genus_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID_0;                                              // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
