#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlUICameraRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Xrd777_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlUICameraRoot.BP_BtlUICameraRoot_C
// 0x0108 (0x0380 - 0x0278)
class ABP_BtlUICameraRoot_C final : public AAppActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TidyAnimation___Track_0_9001B44A4E14D23A40EF6B8FD41245CB; // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TidyAnimation__Direction_9001B44A4E14D23A40EF6B8FD41245CB; // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TidyAnimation;                                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Camera;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UIPosZ;                                            // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UIRotX;                                            // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UIRotZ;                                            // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UICranePitch;                                      // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UICraneYaw;                                        // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UICraneLength;                                     // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SilPosZ;                                           // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SilRotX;                                           // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SilRotZ;                                           // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SilCranePitch;                                     // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SilCraneYaw;                                       // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SilCraneLength;                                    // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           SilCamera;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 UI0;                                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EncountID;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 UI1;                                               // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root_Component;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 UI2;                                               // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Sil0;                                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Sil1;                                              // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Sil2;                                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LerpYaw;                                           // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LerpPitch;                                         // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TidyPos;                                           // 0x0330(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LerpTidyPos;                                       // 0x033C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 UI3;                                               // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Sil3;                                              // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotZLerp;                                          // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotZParam;                                         // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             BtlCommandTheurgiaNoUseCameraTable;                // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             BtlCommandTheurgiaCameraTable;                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             BtlCommandItemCameraTable;                         // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             BtlCommandCameraTable;                             // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BtlUICameraRoot(int32 EntryPoint);
	void ReceiveBeginPlay();
	void TidyAnimation__UpdateFunc();
	void TidyAnimation__FinishedFunc();
	void DestroyCamera();
	void UICameraUpdate();
	void Set_Default_Param(class ABtlActor* Actor);
	void MoveTopToSkill(class ABtlActor* Actor, float Lerp);
	void MoveTopToItem(class ABtlActor* Actor, float Lerp);
	void MoveToTop(class ABtlActor* Actor, float Lerp);
	void MoveTopToGuard(class ABtlActor* Actor, float Lerp);
	void MoveTopToTheurgia(class ABtlActor* Actor, float Lerp);
	void MoveTopToStrategy(class ABtlActor* Actor, float Lerp);
	void MoveTopToTargetSelect(class ABtlActor* Actor, float Lerp);
	float CalcLoopAngle(float InputPin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlUICameraRoot_C">();
	}
	static class ABP_BtlUICameraRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlUICameraRoot_C>();
	}
};
static_assert(alignof(ABP_BtlUICameraRoot_C) == 0x000008, "Wrong alignment on ABP_BtlUICameraRoot_C");
static_assert(sizeof(ABP_BtlUICameraRoot_C) == 0x000380, "Wrong size on ABP_BtlUICameraRoot_C");
static_assert(offsetof(ABP_BtlUICameraRoot_C, UberGraphFrame) == 0x000278, "Member 'ABP_BtlUICameraRoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, DefaultSceneRoot) == 0x000280, "Member 'ABP_BtlUICameraRoot_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, TidyAnimation___Track_0_9001B44A4E14D23A40EF6B8FD41245CB) == 0x000288, "Member 'ABP_BtlUICameraRoot_C::TidyAnimation___Track_0_9001B44A4E14D23A40EF6B8FD41245CB' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, TidyAnimation__Direction_9001B44A4E14D23A40EF6B8FD41245CB) == 0x000294, "Member 'ABP_BtlUICameraRoot_C::TidyAnimation__Direction_9001B44A4E14D23A40EF6B8FD41245CB' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, TidyAnimation) == 0x000298, "Member 'ABP_BtlUICameraRoot_C::TidyAnimation' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, Camera) == 0x0002A0, "Member 'ABP_BtlUICameraRoot_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, UIPosZ) == 0x0002A8, "Member 'ABP_BtlUICameraRoot_C::UIPosZ' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, UIRotX) == 0x0002AC, "Member 'ABP_BtlUICameraRoot_C::UIRotX' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, UIRotZ) == 0x0002B0, "Member 'ABP_BtlUICameraRoot_C::UIRotZ' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, UICranePitch) == 0x0002B4, "Member 'ABP_BtlUICameraRoot_C::UICranePitch' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, UICraneYaw) == 0x0002B8, "Member 'ABP_BtlUICameraRoot_C::UICraneYaw' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, UICraneLength) == 0x0002BC, "Member 'ABP_BtlUICameraRoot_C::UICraneLength' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, SilPosZ) == 0x0002C0, "Member 'ABP_BtlUICameraRoot_C::SilPosZ' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, SilRotX) == 0x0002C4, "Member 'ABP_BtlUICameraRoot_C::SilRotX' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, SilRotZ) == 0x0002C8, "Member 'ABP_BtlUICameraRoot_C::SilRotZ' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, SilCranePitch) == 0x0002CC, "Member 'ABP_BtlUICameraRoot_C::SilCranePitch' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, SilCraneYaw) == 0x0002D0, "Member 'ABP_BtlUICameraRoot_C::SilCraneYaw' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, SilCraneLength) == 0x0002D4, "Member 'ABP_BtlUICameraRoot_C::SilCraneLength' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, SilCamera) == 0x0002D8, "Member 'ABP_BtlUICameraRoot_C::SilCamera' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, UI0) == 0x0002E0, "Member 'ABP_BtlUICameraRoot_C::UI0' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, EncountID) == 0x0002E8, "Member 'ABP_BtlUICameraRoot_C::EncountID' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, Yaw) == 0x0002F0, "Member 'ABP_BtlUICameraRoot_C::Yaw' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, Pitch) == 0x0002F4, "Member 'ABP_BtlUICameraRoot_C::Pitch' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, UI1) == 0x0002F8, "Member 'ABP_BtlUICameraRoot_C::UI1' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, Root_Component) == 0x000300, "Member 'ABP_BtlUICameraRoot_C::Root_Component' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, UI2) == 0x000308, "Member 'ABP_BtlUICameraRoot_C::UI2' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, Sil0) == 0x000310, "Member 'ABP_BtlUICameraRoot_C::Sil0' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, Sil1) == 0x000318, "Member 'ABP_BtlUICameraRoot_C::Sil1' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, Sil2) == 0x000320, "Member 'ABP_BtlUICameraRoot_C::Sil2' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, LerpYaw) == 0x000328, "Member 'ABP_BtlUICameraRoot_C::LerpYaw' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, LerpPitch) == 0x00032C, "Member 'ABP_BtlUICameraRoot_C::LerpPitch' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, TidyPos) == 0x000330, "Member 'ABP_BtlUICameraRoot_C::TidyPos' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, LerpTidyPos) == 0x00033C, "Member 'ABP_BtlUICameraRoot_C::LerpTidyPos' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, UI3) == 0x000348, "Member 'ABP_BtlUICameraRoot_C::UI3' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, Sil3) == 0x000350, "Member 'ABP_BtlUICameraRoot_C::Sil3' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, RotZLerp) == 0x000358, "Member 'ABP_BtlUICameraRoot_C::RotZLerp' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, RotZParam) == 0x00035C, "Member 'ABP_BtlUICameraRoot_C::RotZParam' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, BtlCommandTheurgiaNoUseCameraTable) == 0x000360, "Member 'ABP_BtlUICameraRoot_C::BtlCommandTheurgiaNoUseCameraTable' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, BtlCommandTheurgiaCameraTable) == 0x000368, "Member 'ABP_BtlUICameraRoot_C::BtlCommandTheurgiaCameraTable' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, BtlCommandItemCameraTable) == 0x000370, "Member 'ABP_BtlUICameraRoot_C::BtlCommandItemCameraTable' has a wrong offset!");
static_assert(offsetof(ABP_BtlUICameraRoot_C, BtlCommandCameraTable) == 0x000378, "Member 'ABP_BtlUICameraRoot_C::BtlCommandCameraTable' has a wrong offset!");

}

