#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiSceneCapture2D

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlGuiSceneCapture2D.BP_BtlGuiSceneCapture2D_C.ExecuteUbergraph_BP_BtlGuiSceneCapture2D
// 0x01A0 (0x01A0 - 0x0000)
struct BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Transform;                      // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class UBP_BtlTargetManager_C*                 K2Node_CustomEvent_InputObject;                    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlGuiComponent_C*                  K2Node_CustomEvent_BtlGui;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetUIColorModelShowActor_ActorList1;      // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x006C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlCharacterBase_C*                 K2Node_DynamicCast_AsBP_Btl_Character_Base;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetShowActor_Showing_Actor;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAppCharWeaponBase*>             CallFunc_GetWeaponList_Weapon;                     // 0x0130(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppCharWeaponBase*                     CallFunc_Array_Get_Item;                           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlSummonGun_C*                     CallFunc_GetSummonGunBP_Gun;                       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAppPropsCore*>                  CallFunc_GetShowActors_ShowActors;                 // 0x0170(0x0010)(ReferenceParm)
	class AAppPropsCore*                          CallFunc_Array_Get_Item_1;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D) == 0x000010, "Wrong alignment on BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D");
static_assert(sizeof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D) == 0x0001A0, "Wrong size on BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, EntryPoint) == 0x000000, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, K2Node_CustomEvent_Transform) == 0x000010, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::K2Node_CustomEvent_Transform' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, K2Node_CustomEvent_InputObject) == 0x000040, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::K2Node_CustomEvent_InputObject' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, K2Node_CustomEvent_BtlGui) == 0x000048, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::K2Node_CustomEvent_BtlGui' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_GetUIColorModelShowActor_ActorList1) == 0x000058, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_GetUIColorModelShowActor_ActorList1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x00006C, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0000F4, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, Temp_int_Array_Index_Variable) == 0x0000F8, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_BooleanAND_ReturnValue) == 0x0000FC, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, Temp_int_Loop_Counter_Variable_1) == 0x000100, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, Temp_int_Array_Index_Variable_1) == 0x000104, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_Add_IntInt_ReturnValue_1) == 0x000108, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_GetMainCharacter_ReturnValue) == 0x000110, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_GetMainCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, K2Node_DynamicCast_AsBP_Btl_Character_Base) == 0x000118, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::K2Node_DynamicCast_AsBP_Btl_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_GetShowActor_Showing_Actor) == 0x000128, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_GetShowActor_Showing_Actor' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_GetWeaponList_Weapon) == 0x000130, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_GetWeaponList_Weapon' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_Array_Add_ReturnValue) == 0x000140, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_Array_Get_Item) == 0x000148, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_Array_Length_ReturnValue) == 0x000150, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_Array_Add_ReturnValue_1) == 0x000154, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_Less_IntInt_ReturnValue) == 0x000158, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_GetSummonGunBP_Gun) == 0x000160, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_GetSummonGunBP_Gun' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_IsValid_ReturnValue_1) == 0x000168, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_GetShowActors_ShowActors) == 0x000170, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_GetShowActors_ShowActors' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_Array_Add_ReturnValue_2) == 0x00018C, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D, CallFunc_Less_IntInt_ReturnValue_1) == 0x000190, "Member 'BP_BtlGuiSceneCapture2D_C_ExecuteUbergraph_BP_BtlGuiSceneCapture2D::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_BtlGuiSceneCapture2D.BP_BtlGuiSceneCapture2D_C.CaptureUpdate
// 0x0040 (0x0040 - 0x0000)
struct BP_BtlGuiSceneCapture2D_C_CaptureUpdate final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class UBP_BtlTargetManager_C*                 InputObject;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BtlGuiComponent_C*                  BtlGui;                                            // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiSceneCapture2D_C_CaptureUpdate) == 0x000010, "Wrong alignment on BP_BtlGuiSceneCapture2D_C_CaptureUpdate");
static_assert(sizeof(BP_BtlGuiSceneCapture2D_C_CaptureUpdate) == 0x000040, "Wrong size on BP_BtlGuiSceneCapture2D_C_CaptureUpdate");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_CaptureUpdate, Transform) == 0x000000, "Member 'BP_BtlGuiSceneCapture2D_C_CaptureUpdate::Transform' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_CaptureUpdate, InputObject) == 0x000030, "Member 'BP_BtlGuiSceneCapture2D_C_CaptureUpdate::InputObject' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_CaptureUpdate, BtlGui) == 0x000038, "Member 'BP_BtlGuiSceneCapture2D_C_CaptureUpdate::BtlGui' has a wrong offset!");

// Function BP_BtlGuiSceneCapture2D.BP_BtlGuiSceneCapture2D_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct BP_BtlGuiSceneCapture2D_C_UserConstructionScript final
{
public:
	class UTextureRenderTarget2D*                 CallFunc_GetAppRenderTarget_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACineCameraActor*>               CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0008(0x0010)(ReferenceParm)
	class ACineCameraActor*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineCameraComponent*                   CallFunc_GetCineCameraComponent_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlGuiSceneCapture2D_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_BtlGuiSceneCapture2D_C_UserConstructionScript");
static_assert(sizeof(BP_BtlGuiSceneCapture2D_C_UserConstructionScript) == 0x000030, "Wrong size on BP_BtlGuiSceneCapture2D_C_UserConstructionScript");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_UserConstructionScript, CallFunc_GetAppRenderTarget_ReturnValue) == 0x000000, "Member 'BP_BtlGuiSceneCapture2D_C_UserConstructionScript::CallFunc_GetAppRenderTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_UserConstructionScript, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000008, "Member 'BP_BtlGuiSceneCapture2D_C_UserConstructionScript::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_BtlGuiSceneCapture2D_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_UserConstructionScript, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000020, "Member 'BP_BtlGuiSceneCapture2D_C_UserConstructionScript::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_UserConstructionScript, CallFunc_GetCineCameraComponent_ReturnValue) == 0x000028, "Member 'BP_BtlGuiSceneCapture2D_C_UserConstructionScript::CallFunc_GetCineCameraComponent_ReturnValue' has a wrong offset!");

// Function BP_BtlGuiSceneCapture2D.BP_BtlGuiSceneCapture2D_C.SetCaptureEveryFrame
// 0x0001 (0x0001 - 0x0000)
struct BP_BtlGuiSceneCapture2D_C_SetCaptureEveryFrame final
{
public:
	bool                                          EveryFrame;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlGuiSceneCapture2D_C_SetCaptureEveryFrame) == 0x000001, "Wrong alignment on BP_BtlGuiSceneCapture2D_C_SetCaptureEveryFrame");
static_assert(sizeof(BP_BtlGuiSceneCapture2D_C_SetCaptureEveryFrame) == 0x000001, "Wrong size on BP_BtlGuiSceneCapture2D_C_SetCaptureEveryFrame");
static_assert(offsetof(BP_BtlGuiSceneCapture2D_C_SetCaptureEveryFrame, EveryFrame) == 0x000000, "Member 'BP_BtlGuiSceneCapture2D_C_SetCaptureEveryFrame::EveryFrame' has a wrong offset!");

}

