#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlGuiRush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_BtlGuiBaseActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BtlGuiRush.BP_BtlGuiRush_C
// 0x00F0 (0x0440 - 0x0350)
class ABP_BtlGuiRush_C final : public ABP_BtlGuiBaseActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BtlGuiRush_C;                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBtlDataBaseComponent*                  BtlDataBase;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiResources*                       BtlGuiResources;                                   // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBtlGuiDrawComponent*                   BtlGuiDraw;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OutAnim_TextRate_4935DD2241021810CD6538807D443E80; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutAnim_KeyRate_4935DD2241021810CD6538807D443E80;  // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutAnim_PanelRate_4935DD2241021810CD6538807D443E80; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OutAnim__Direction_4935DD2241021810CD6538807D443E80; // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OutAnim;                                           // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PushButtonAnim_Scale_2CAF45054277C8361BC77A96225FCBF6; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PushButtonAnim__Direction_2CAF45054277C8361BC77A96225FCBF6; // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PushButtonAnim;                                    // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LoopAnim_MaskRate_F73671B84F3C5D3C140FFE9F7DED1131; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LoopAnim__Direction_F73671B84F3C5D3C140FFE9F7DED1131; // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     LoopAnim;                                          // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InAnim_TextRate_6225638949D6B1B2949E13BCA65059B0;  // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InAnim_KeyRate_6225638949D6B1B2949E13BCA65059B0;   // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InAnim_PanelRate_6225638949D6B1B2949E13BCA65059B0; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            InAnim__Direction_6225638949D6B1B2949E13BCA65059B0; // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     InAnim;                                            // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OffsetA;                                           // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OffsetB;                                           // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      Pos1List;                                          // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      Pos2List;                                          // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Panel_Rate;                                        // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRushMode;                                        // 0x03F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlGuiDrawObjectSprite*                KeyHelp;                                           // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KeyRate;                                           // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TextRate;                                          // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 AlpfaList;                                         // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Mask_Rate;                                         // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlGuiRushEffect*                      BP_Rush;                                           // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDebugRushMode;                                   // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OnDebugStopMaskNoAlphaBlend;                       // 0x0429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42A[0x2];                                      // 0x042A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaskLengthOffsetX;                                 // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnMaskLoopAnim;                                    // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaskLoopAnimTime;                                  // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnDebugStopMaskAnimationPause;                     // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BtlGuiRush(int32 EntryPoint);
	void GuiActorBeginDestroy();
	void GuiActorUpdate(float DeltaTime);
	void GuiActorBeginPlay();
	void StartOutAnimationNoPush();
	void StartOutAnimation();
	void StartInAnimation();
	void OutAnim__UpdateFunc();
	void OutAnim__FinishedFunc();
	void PushButtonAnim__UpdateFunc();
	void PushButtonAnim__FinishedFunc();
	void LoopAnim__UpdateFunc();
	void LoopAnim__FinishedFunc();
	void InAnim__UpdateFunc();
	void InAnim__FinishedFunc();
	void SetRushMode(bool IsRush, bool PushButton);
	void SetDebugRushMode(bool IsDebugRush, bool OnDebugStopMaskNoAlpha, bool OnDebugStopMaskAnimPause);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BtlGuiRush_C">();
	}
	static class ABP_BtlGuiRush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BtlGuiRush_C>();
	}
};
static_assert(alignof(ABP_BtlGuiRush_C) == 0x000008, "Wrong alignment on ABP_BtlGuiRush_C");
static_assert(sizeof(ABP_BtlGuiRush_C) == 0x000440, "Wrong size on ABP_BtlGuiRush_C");
static_assert(offsetof(ABP_BtlGuiRush_C, UberGraphFrame_BP_BtlGuiRush_C) == 0x000350, "Member 'ABP_BtlGuiRush_C::UberGraphFrame_BP_BtlGuiRush_C' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, BtlDataBase) == 0x000358, "Member 'ABP_BtlGuiRush_C::BtlDataBase' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, BtlGuiResources) == 0x000360, "Member 'ABP_BtlGuiRush_C::BtlGuiResources' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, BtlGuiDraw) == 0x000368, "Member 'ABP_BtlGuiRush_C::BtlGuiDraw' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, OutAnim_TextRate_4935DD2241021810CD6538807D443E80) == 0x000370, "Member 'ABP_BtlGuiRush_C::OutAnim_TextRate_4935DD2241021810CD6538807D443E80' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, OutAnim_KeyRate_4935DD2241021810CD6538807D443E80) == 0x000374, "Member 'ABP_BtlGuiRush_C::OutAnim_KeyRate_4935DD2241021810CD6538807D443E80' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, OutAnim_PanelRate_4935DD2241021810CD6538807D443E80) == 0x000378, "Member 'ABP_BtlGuiRush_C::OutAnim_PanelRate_4935DD2241021810CD6538807D443E80' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, OutAnim__Direction_4935DD2241021810CD6538807D443E80) == 0x00037C, "Member 'ABP_BtlGuiRush_C::OutAnim__Direction_4935DD2241021810CD6538807D443E80' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, OutAnim) == 0x000380, "Member 'ABP_BtlGuiRush_C::OutAnim' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, PushButtonAnim_Scale_2CAF45054277C8361BC77A96225FCBF6) == 0x000388, "Member 'ABP_BtlGuiRush_C::PushButtonAnim_Scale_2CAF45054277C8361BC77A96225FCBF6' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, PushButtonAnim__Direction_2CAF45054277C8361BC77A96225FCBF6) == 0x00038C, "Member 'ABP_BtlGuiRush_C::PushButtonAnim__Direction_2CAF45054277C8361BC77A96225FCBF6' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, PushButtonAnim) == 0x000390, "Member 'ABP_BtlGuiRush_C::PushButtonAnim' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, LoopAnim_MaskRate_F73671B84F3C5D3C140FFE9F7DED1131) == 0x000398, "Member 'ABP_BtlGuiRush_C::LoopAnim_MaskRate_F73671B84F3C5D3C140FFE9F7DED1131' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, LoopAnim__Direction_F73671B84F3C5D3C140FFE9F7DED1131) == 0x00039C, "Member 'ABP_BtlGuiRush_C::LoopAnim__Direction_F73671B84F3C5D3C140FFE9F7DED1131' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, LoopAnim) == 0x0003A0, "Member 'ABP_BtlGuiRush_C::LoopAnim' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, InAnim_TextRate_6225638949D6B1B2949E13BCA65059B0) == 0x0003A8, "Member 'ABP_BtlGuiRush_C::InAnim_TextRate_6225638949D6B1B2949E13BCA65059B0' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, InAnim_KeyRate_6225638949D6B1B2949E13BCA65059B0) == 0x0003AC, "Member 'ABP_BtlGuiRush_C::InAnim_KeyRate_6225638949D6B1B2949E13BCA65059B0' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, InAnim_PanelRate_6225638949D6B1B2949E13BCA65059B0) == 0x0003B0, "Member 'ABP_BtlGuiRush_C::InAnim_PanelRate_6225638949D6B1B2949E13BCA65059B0' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, InAnim__Direction_6225638949D6B1B2949E13BCA65059B0) == 0x0003B4, "Member 'ABP_BtlGuiRush_C::InAnim__Direction_6225638949D6B1B2949E13BCA65059B0' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, InAnim) == 0x0003B8, "Member 'ABP_BtlGuiRush_C::InAnim' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, OffsetA) == 0x0003C0, "Member 'ABP_BtlGuiRush_C::OffsetA' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, OffsetB) == 0x0003C8, "Member 'ABP_BtlGuiRush_C::OffsetB' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, Pos1List) == 0x0003D0, "Member 'ABP_BtlGuiRush_C::Pos1List' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, Pos2List) == 0x0003E0, "Member 'ABP_BtlGuiRush_C::Pos2List' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, Panel_Rate) == 0x0003F0, "Member 'ABP_BtlGuiRush_C::Panel_Rate' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, IsRushMode) == 0x0003F4, "Member 'ABP_BtlGuiRush_C::IsRushMode' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, KeyHelp) == 0x0003F8, "Member 'ABP_BtlGuiRush_C::KeyHelp' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, KeyRate) == 0x000400, "Member 'ABP_BtlGuiRush_C::KeyRate' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, TextRate) == 0x000404, "Member 'ABP_BtlGuiRush_C::TextRate' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, AlpfaList) == 0x000408, "Member 'ABP_BtlGuiRush_C::AlpfaList' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, Mask_Rate) == 0x000418, "Member 'ABP_BtlGuiRush_C::Mask_Rate' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, Scale) == 0x00041C, "Member 'ABP_BtlGuiRush_C::Scale' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, BP_Rush) == 0x000420, "Member 'ABP_BtlGuiRush_C::BP_Rush' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, IsDebugRushMode) == 0x000428, "Member 'ABP_BtlGuiRush_C::IsDebugRushMode' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, OnDebugStopMaskNoAlphaBlend) == 0x000429, "Member 'ABP_BtlGuiRush_C::OnDebugStopMaskNoAlphaBlend' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, MaskLengthOffsetX) == 0x00042C, "Member 'ABP_BtlGuiRush_C::MaskLengthOffsetX' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, OnMaskLoopAnim) == 0x000430, "Member 'ABP_BtlGuiRush_C::OnMaskLoopAnim' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, MaskLoopAnimTime) == 0x000434, "Member 'ABP_BtlGuiRush_C::MaskLoopAnimTime' has a wrong offset!");
static_assert(offsetof(ABP_BtlGuiRush_C, OnDebugStopMaskAnimationPause) == 0x000438, "Member 'ABP_BtlGuiRush_C::OnDebugStopMaskAnimationPause' has a wrong offset!");

}

