#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlCameraManagerComponent

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FBtlCamCalcAddparam_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlCameraManagerComponent.BP_BtlCameraManagerComponent_C.ExecuteUbergraph_BP_BtlCameraManagerComponent
// 0x0130 (0x0130 - 0x0000)
struct BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlTargetsManagerComponent*            K2Node_CustomEvent_BtlTargets;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlSkillBase_C*                     K2Node_CustomEvent_SkillData;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlSkillCameraType                           K2Node_CustomEvent_CameraType;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSkillCameraCharacterHideDisable_ReturnValue; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillItemDumping_ReturnValue;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayCalculateSkillCamera_NeedHidingOthersProc; // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0098(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent) == 0x000010, "Wrong alignment on BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent");
static_assert(sizeof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent) == 0x000130, "Wrong size on BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, EntryPoint) == 0x000000, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_GetSequencePlayer_ReturnValue) == 0x000018, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, K2Node_Event_DeltaSeconds) == 0x000050, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000058, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, K2Node_CustomEvent_BtlTargets) == 0x000068, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::K2Node_CustomEvent_BtlTargets' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, K2Node_CustomEvent_SkillData) == 0x000070, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::K2Node_CustomEvent_SkillData' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, K2Node_CustomEvent_CameraType) == 0x000078, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::K2Node_CustomEvent_CameraType' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_GetMainCharacter_ReturnValue) == 0x000080, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_GetMainCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_CheckSkillCameraCharacterHideDisable_ReturnValue) == 0x000088, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_CheckSkillCameraCharacterHideDisable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_IsSkillItemDumping_ReturnValue) == 0x000089, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_IsSkillItemDumping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_PlayCalculateSkillCamera_NeedHidingOthersProc) == 0x00008A, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_PlayCalculateSkillCamera_NeedHidingOthersProc' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_GetMainCharacter_ReturnValue_1) == 0x000090, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_GetMainCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000098, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000120, "Member 'BP_BtlCameraManagerComponent_C_ExecuteUbergraph_BP_BtlCameraManagerComponent::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BP_BtlCameraManagerComponent.BP_BtlCameraManagerComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlCameraManagerComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlCameraManagerComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BtlCameraManagerComponent_C_ReceiveTick");
static_assert(sizeof(BP_BtlCameraManagerComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_BtlCameraManagerComponent_C_ReceiveTick");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BtlCameraManagerComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BtlCameraManagerComponent.BP_BtlCameraManagerComponent_C.On Play Skill Camera
// 0x0018 (0x0018 - 0x0000)
struct BP_BtlCameraManagerComponent_C_On_Play_Skill_Camera final
{
public:
	class UBtlTargetsManagerComponent*            BtlTargets;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BtlSkillBase_C*                     SkillData;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlSkillCameraType                           CameraType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlCameraManagerComponent_C_On_Play_Skill_Camera) == 0x000008, "Wrong alignment on BP_BtlCameraManagerComponent_C_On_Play_Skill_Camera");
static_assert(sizeof(BP_BtlCameraManagerComponent_C_On_Play_Skill_Camera) == 0x000018, "Wrong size on BP_BtlCameraManagerComponent_C_On_Play_Skill_Camera");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_On_Play_Skill_Camera, BtlTargets) == 0x000000, "Member 'BP_BtlCameraManagerComponent_C_On_Play_Skill_Camera::BtlTargets' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_On_Play_Skill_Camera, SkillData) == 0x000008, "Member 'BP_BtlCameraManagerComponent_C_On_Play_Skill_Camera::SkillData' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_On_Play_Skill_Camera, CameraType) == 0x000010, "Member 'BP_BtlCameraManagerComponent_C_On_Play_Skill_Camera::CameraType' has a wrong offset!");

// Function BP_BtlCameraManagerComponent.BP_BtlCameraManagerComponent_C.GetMainCameraRoot
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlCameraManagerComponent_C_GetMainCameraRoot final
{
public:
	class USceneComponent*                        Scene_Component;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlCameraManagerComponent_C_GetMainCameraRoot) == 0x000008, "Wrong alignment on BP_BtlCameraManagerComponent_C_GetMainCameraRoot");
static_assert(sizeof(BP_BtlCameraManagerComponent_C_GetMainCameraRoot) == 0x000008, "Wrong size on BP_BtlCameraManagerComponent_C_GetMainCameraRoot");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_GetMainCameraRoot, Scene_Component) == 0x000000, "Member 'BP_BtlCameraManagerComponent_C_GetMainCameraRoot::Scene_Component' has a wrong offset!");

// Function BP_BtlCameraManagerComponent.BP_BtlCameraManagerComponent_C.SetActCharacter
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlCameraManagerComponent_C_SetActCharacter final
{
public:
	class ABP_BtlCharacterBase_C*                 Enchanter;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlCameraManagerComponent_C_SetActCharacter) == 0x000008, "Wrong alignment on BP_BtlCameraManagerComponent_C_SetActCharacter");
static_assert(sizeof(BP_BtlCameraManagerComponent_C_SetActCharacter) == 0x000008, "Wrong size on BP_BtlCameraManagerComponent_C_SetActCharacter");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_SetActCharacter, Enchanter) == 0x000000, "Member 'BP_BtlCameraManagerComponent_C_SetActCharacter::Enchanter' has a wrong offset!");

// Function BP_BtlCameraManagerComponent.BP_BtlCameraManagerComponent_C.PlaySequenceCamera
// 0x00C0 (0x00C0 - 0x0000)
struct BP_BtlCameraManagerComponent_C_PlaySequenceCamera final
{
public:
	class ALevelSequenceActor*                    Sequence_Actor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              TransformBaseActor;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Loop;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACineCameraActor*                       UsingOtherMainCamera;                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SequenceTransform;                                 // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class ACineCameraActor*                       UsingCamera;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Loop_Num;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera) == 0x000010, "Wrong alignment on BP_BtlCameraManagerComponent_C_PlaySequenceCamera");
static_assert(sizeof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera) == 0x0000C0, "Wrong size on BP_BtlCameraManagerComponent_C_PlaySequenceCamera");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera, Sequence_Actor) == 0x000000, "Member 'BP_BtlCameraManagerComponent_C_PlaySequenceCamera::Sequence_Actor' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera, TransformBaseActor) == 0x000008, "Member 'BP_BtlCameraManagerComponent_C_PlaySequenceCamera::TransformBaseActor' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera, Loop) == 0x000010, "Member 'BP_BtlCameraManagerComponent_C_PlaySequenceCamera::Loop' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera, UsingOtherMainCamera) == 0x000018, "Member 'BP_BtlCameraManagerComponent_C_PlaySequenceCamera::UsingOtherMainCamera' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera, SequenceTransform) == 0x000020, "Member 'BP_BtlCameraManagerComponent_C_PlaySequenceCamera::SequenceTransform' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera, UsingCamera) == 0x000050, "Member 'BP_BtlCameraManagerComponent_C_PlaySequenceCamera::UsingCamera' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera, Loop_Num) == 0x000058, "Member 'BP_BtlCameraManagerComponent_C_PlaySequenceCamera::Loop_Num' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'BP_BtlCameraManagerComponent_C_PlaySequenceCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'BP_BtlCameraManagerComponent_C_PlaySequenceCamera::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlaySequenceCamera, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BP_BtlCameraManagerComponent_C_PlaySequenceCamera::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function BP_BtlCameraManagerComponent.BP_BtlCameraManagerComponent_C.Play Calc Camera
// 0x0100 (0x0100 - 0x0000)
struct BP_BtlCameraManagerComponent_C_Play_Calc_Camera final
{
public:
	class UBtlTargetsManagerComponent*            Btl_Targets;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypeName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NotInitialShowHidingCharacter;                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0020(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FFBtlCamCalcAddParam                   CamAddParam;                                       // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EnchanterToTarget;                                 // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraLocation;                                    // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_BtlCharacterBase_C*>         TargetList;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class UBtlTargetsManagerComponent*            TargetsManager;                                    // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFBtlCamCalcAddParam                   K2Node_MakeStruct_FBtlCamCalcAddParam;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFBtlCamCalcAddParam                   K2Node_MakeStruct_FBtlCamCalcAddParam_1;           // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcCamData_AnimTime;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetCalculatedTrans_CameraStart;           // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetCalculatedTrans_CameraGoal;            // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera) == 0x000010, "Wrong alignment on BP_BtlCameraManagerComponent_C_Play_Calc_Camera");
static_assert(sizeof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera) == 0x000100, "Wrong size on BP_BtlCameraManagerComponent_C_Play_Calc_Camera");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, Btl_Targets) == 0x000000, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::Btl_Targets' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, TypeName) == 0x000008, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::TypeName' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, NotInitialShowHidingCharacter) == 0x000010, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::NotInitialShowHidingCharacter' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, Transform) == 0x000020, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::Transform' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, CamAddParam) == 0x000050, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::CamAddParam' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, EnchanterToTarget) == 0x000054, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::EnchanterToTarget' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, CameraLocation) == 0x000060, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::CameraLocation' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, TargetList) == 0x000070, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::TargetList' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, TargetsManager) == 0x000080, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::TargetsManager' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, CallFunc_Conv_NameToString_ReturnValue) == 0x000088, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, CallFunc_Contains_ReturnValue) == 0x000098, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, K2Node_MakeStruct_FBtlCamCalcAddParam) == 0x000099, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::K2Node_MakeStruct_FBtlCamCalcAddParam' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, K2Node_MakeStruct_FBtlCamCalcAddParam_1) == 0x00009A, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::K2Node_MakeStruct_FBtlCamCalcAddParam_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, CallFunc_CalcCamData_AnimTime) == 0x00009C, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::CallFunc_CalcCamData_AnimTime' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, CallFunc_GetCalculatedTrans_CameraStart) == 0x0000A0, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::CallFunc_GetCalculatedTrans_CameraStart' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_Play_Calc_Camera, CallFunc_GetCalculatedTrans_CameraGoal) == 0x0000D0, "Member 'BP_BtlCameraManagerComponent_C_Play_Calc_Camera::CallFunc_GetCalculatedTrans_CameraGoal' has a wrong offset!");

// Function BP_BtlCameraManagerComponent.BP_BtlCameraManagerComponent_C.PlayCalculateSkillCamera
// 0x0360 (0x0360 - 0x0000)
struct BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera final
{
public:
	class UBtlTargetsManagerComponent*            Btl_Targets;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedHidingOthersProc;                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NeedHideProc;                                      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBtlTargetsManagerComponent*            TargetManager;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              Enchanter;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform;               // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SearchBossCamera_Found;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckUseAllTargetsCam_useAllTargetsSkill; // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0xE];                                       // 0x0062(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_1;             // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_2;             // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_3;             // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_4;             // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_5;             // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_6;             // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_7;             // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_8;             // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_9;             // 0x01F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_10;            // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_11;            // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_BtlCharacterBase_C*                 K2Node_DynamicCast_AsBP_Btl_Character_Base;        // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_Target_Is_Enemy_Enemy;              // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_Target_Is_Enemy_Enemy_1;            // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSkillCameraCharacterHideDisable_ReturnValue; // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillItemDumping_ReturnValue;           // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_Target_Is_Enemy_Enemy_2;            // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_Target_Is_Enemy_Enemy_3;            // 0x028E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOccurringSkillReflection_ReturnValue;   // 0x028F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOccurringSkillReflection_ReturnValue_1; // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBoss_ReturnValue;                       // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingOffensiveSkill_ReturnValue;        // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingOffensiveSkill_ReturnValue_1;      // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_294[0xC];                                      // 0x0294(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_12;            // 0x02A0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingOffensiveSkill_ReturnValue_2;      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckUseGroupCam_result;                  // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckUseGroupCam_useWholeSkill;           // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D3[0xD];                                      // 0x02D3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_13;            // 0x02E0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemy_ReturnValue;                      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingOffensiveSkill_ReturnValue_3;      // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyInParty_ReturnValue;               // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0313(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UseBackShotWholeCamera_Backshot;          // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UseBackShotCamera_Backshot;               // 0x0316(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_317[0x9];                                      // 0x0317(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Play_Calc_Camera_Transform_14;            // 0x0320(0x0030)(IsPlainOldData, NoDestructor)
	class ABtlActor*                              CallFunc_GetMainCharacter_ReturnValue;             // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemy_ReturnValue_1;                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyInParty_ReturnValue_1;             // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x035B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera) == 0x000010, "Wrong alignment on BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera");
static_assert(sizeof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera) == 0x000360, "Wrong size on BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, Btl_Targets) == 0x000000, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::Btl_Targets' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, NeedHidingOthersProc) == 0x000008, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::NeedHidingOthersProc' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, NeedHideProc) == 0x000009, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::NeedHideProc' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, TargetManager) == 0x000010, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::TargetManager' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, Enchanter) == 0x000018, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::Enchanter' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform) == 0x000030, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_SearchBossCamera_Found) == 0x000060, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_SearchBossCamera_Found' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_CheckUseAllTargetsCam_useAllTargetsSkill) == 0x000061, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_CheckUseAllTargetsCam_useAllTargetsSkill' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_1) == 0x000070, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_2) == 0x0000A0, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_3) == 0x0000D0, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_4) == 0x000100, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_4' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_5) == 0x000130, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_5' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_6) == 0x000160, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_6' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_7) == 0x000190, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_7' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_8) == 0x0001C0, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_8' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_9) == 0x0001F0, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_9' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_10) == 0x000220, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_10' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_11) == 0x000250, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_11' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, K2Node_DynamicCast_AsBP_Btl_Character_Base) == 0x000280, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::K2Node_DynamicCast_AsBP_Btl_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, K2Node_DynamicCast_bSuccess) == 0x000288, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Check_Target_Is_Enemy_Enemy) == 0x000289, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Check_Target_Is_Enemy_Enemy' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Check_Target_Is_Enemy_Enemy_1) == 0x00028A, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Check_Target_Is_Enemy_Enemy_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_CheckSkillCameraCharacterHideDisable_ReturnValue) == 0x00028B, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_CheckSkillCameraCharacterHideDisable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsSkillItemDumping_ReturnValue) == 0x00028C, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsSkillItemDumping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Check_Target_Is_Enemy_Enemy_2) == 0x00028D, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Check_Target_Is_Enemy_Enemy_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Check_Target_Is_Enemy_Enemy_3) == 0x00028E, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Check_Target_Is_Enemy_Enemy_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsOccurringSkillReflection_ReturnValue) == 0x00028F, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsOccurringSkillReflection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsOccurringSkillReflection_ReturnValue_1) == 0x000290, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsOccurringSkillReflection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsBoss_ReturnValue) == 0x000291, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsBoss_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsUsingOffensiveSkill_ReturnValue) == 0x000292, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsUsingOffensiveSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsUsingOffensiveSkill_ReturnValue_1) == 0x000293, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsUsingOffensiveSkill_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_12) == 0x0002A0, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_12' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsUsingOffensiveSkill_ReturnValue_2) == 0x0002D0, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsUsingOffensiveSkill_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_CheckUseGroupCam_result) == 0x0002D1, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_CheckUseGroupCam_result' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_CheckUseGroupCam_useWholeSkill) == 0x0002D2, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_CheckUseGroupCam_useWholeSkill' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_13) == 0x0002E0, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_13' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsEnemy_ReturnValue) == 0x000310, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsUsingOffensiveSkill_ReturnValue_3) == 0x000311, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsUsingOffensiveSkill_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsEnemyInParty_ReturnValue) == 0x000312, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsEnemyInParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Not_PreBool_ReturnValue) == 0x000313, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_UseBackShotWholeCamera_Backshot) == 0x000314, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_UseBackShotWholeCamera_Backshot' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_BooleanAND_ReturnValue) == 0x000315, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_UseBackShotCamera_Backshot) == 0x000316, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_UseBackShotCamera_Backshot' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Play_Calc_Camera_Transform_14) == 0x000320, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Play_Calc_Camera_Transform_14' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_GetMainCharacter_ReturnValue) == 0x000350, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_GetMainCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsEnemy_ReturnValue_1) == 0x000358, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsEnemy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_IsEnemyInParty_ReturnValue_1) == 0x000359, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_IsEnemyInParty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_Not_PreBool_ReturnValue_1) == 0x00035A, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera, CallFunc_BooleanAND_ReturnValue_1) == 0x00035B, "Member 'BP_BtlCameraManagerComponent_C_PlayCalculateSkillCamera::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_BtlCameraManagerComponent.BP_BtlCameraManagerComponent_C.PlayEffectSkillCamera
// 0x02A0 (0x02A0 - 0x0000)
struct BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera final
{
public:
	class ABP_BtlSkillBase_C*                     SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABtlActor*                              Enchanter;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInitialTransform_trans;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingAstrea_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IBtlBossUraBossInterface> K2Node_DynamicCast_AsBtl_Boss_Ura_Boss_Interface;  // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_1;    // 0x0144(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_1;       // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_2;    // 0x0200(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_2;       // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera) == 0x000010, "Wrong alignment on BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera");
static_assert(sizeof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera) == 0x0002A0, "Wrong size on BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, SkillData) == 0x000000, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::SkillData' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, Enchanter) == 0x000008, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::Enchanter' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_GetSequencePlayer_ReturnValue) == 0x000050, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_GetInitialTransform_trans) == 0x000060, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_GetInitialTransform_trans' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_IsPlayingAstrea_ReturnValue) == 0x000090, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_IsPlayingAstrea_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000094, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_K2_SetActorTransform_ReturnValue) == 0x00011C, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, K2Node_CreateDelegate_OutputDelegate) == 0x000120, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, K2Node_DynamicCast_AsBtl_Boss_Ura_Boss_Interface) == 0x000130, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::K2Node_DynamicCast_AsBtl_Boss_Ura_Boss_Interface' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_K2_SetActorTransform_SweepHitResult_1) == 0x000144, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_K2_SetActorTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_K2_SetActorTransform_ReturnValue_1) == 0x0001CC, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_K2_SetActorTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_MakeTransform_ReturnValue) == 0x0001D0, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_K2_SetActorTransform_SweepHitResult_2) == 0x000200, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_K2_SetActorTransform_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_K2_SetActorTransform_ReturnValue_2) == 0x000288, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_K2_SetActorTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera, CallFunc_GetPlayerController_ReturnValue) == 0x000290, "Member 'BP_BtlCameraManagerComponent_C_PlayEffectSkillCamera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function BP_BtlCameraManagerComponent.BP_BtlCameraManagerComponent_C.PlayCommandCamera
// 0x00D0 (0x00D0 - 0x0000)
struct BP_BtlCameraManagerComponent_C_PlayCommandCamera final
{
public:
