#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BtlEnvironment

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Xrd777_structs.hpp"


namespace SDK::Params
{

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.ExecuteUbergraph_BP_BtlEnvironment
// 0x00D0 (0x00D0 - 0x0000)
struct BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AShadowBaseCore*>                CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AShadowBaseCore*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Anim_Time;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlSkillEnvParam                      K2Node_CustomEvent_SkillEnv;                       // 0x0048(0x0020)()
	bool                                          K2Node_CustomEvent_KeepCurrentLight;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_KeepCurrentFog;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_KeepCurrentBG;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_HideBGWithDarkParam;            // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CalcDarkFog_IsEnd;                        // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CalcBGBlack_IsEnd;                        // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ANiagaraActor*>                  CallFunc_GetLoversFogEffects_ReturnValue;          // 0x0088(0x0010)(ReferenceParm)
	class ANiagaraActor*                          CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ANiagaraActor*>                  CallFunc_GetLoversFogEffects_ReturnValue_1;        // 0x00B0(0x0010)(ReferenceParm)
	class ANiagaraActor*                          CallFunc_Array_Get_Item_2;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment");
static_assert(sizeof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment) == 0x0000D0, "Wrong size on BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, EntryPoint) == 0x000000, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000008, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, K2Node_Event_DeltaSeconds) == 0x00003C, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, K2Node_CustomEvent_Anim_Time) == 0x000040, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::K2Node_CustomEvent_Anim_Time' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, K2Node_CustomEvent_SkillEnv) == 0x000048, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::K2Node_CustomEvent_SkillEnv' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, K2Node_CustomEvent_KeepCurrentLight) == 0x000068, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::K2Node_CustomEvent_KeepCurrentLight' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, K2Node_CustomEvent_KeepCurrentFog) == 0x000069, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::K2Node_CustomEvent_KeepCurrentFog' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, K2Node_CustomEvent_KeepCurrentBG) == 0x00006A, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::K2Node_CustomEvent_KeepCurrentBG' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, K2Node_CustomEvent_HideBGWithDarkParam) == 0x00006B, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::K2Node_CustomEvent_HideBGWithDarkParam' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00006C, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000074, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_FMin_ReturnValue) == 0x000078, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_CalcDarkFog_IsEnd) == 0x00007D, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_CalcDarkFog_IsEnd' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x00007E, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_CalcBGBlack_IsEnd) == 0x00007F, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_CalcBGBlack_IsEnd' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, Temp_int_Array_Index_Variable_2) == 0x000080, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_GetLoversFogEffects_ReturnValue) == 0x000088, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_GetLoversFogEffects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A4, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, Temp_int_Loop_Counter_Variable_2) == 0x0000A8, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000AC, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_GetLoversFogEffects_ReturnValue_1) == 0x0000B0, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_GetLoversFogEffects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Array_Get_Item_2) == 0x0000C0, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Array_Length_ReturnValue_2) == 0x0000C8, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000CC, "Member 'BP_BtlEnvironment_C_ExecuteUbergraph_BP_BtlEnvironment::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.Request Dark Env
// 0x0030 (0x0030 - 0x0000)
struct BP_BtlEnvironment_C_Request_Dark_Env final
{
public:
	float                                         Anim_Time;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlSkillEnvParam                      SkillEnv;                                          // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          KeepCurrentLight;                                  // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          KeepCurrentFog;                                    // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          KeepCurrentBG;                                     // 0x002A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideBGWithDarkParam;                               // 0x002B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlEnvironment_C_Request_Dark_Env) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_Request_Dark_Env");
static_assert(sizeof(BP_BtlEnvironment_C_Request_Dark_Env) == 0x000030, "Wrong size on BP_BtlEnvironment_C_Request_Dark_Env");
static_assert(offsetof(BP_BtlEnvironment_C_Request_Dark_Env, Anim_Time) == 0x000000, "Member 'BP_BtlEnvironment_C_Request_Dark_Env::Anim_Time' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Request_Dark_Env, SkillEnv) == 0x000008, "Member 'BP_BtlEnvironment_C_Request_Dark_Env::SkillEnv' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Request_Dark_Env, KeepCurrentLight) == 0x000028, "Member 'BP_BtlEnvironment_C_Request_Dark_Env::KeepCurrentLight' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Request_Dark_Env, KeepCurrentFog) == 0x000029, "Member 'BP_BtlEnvironment_C_Request_Dark_Env::KeepCurrentFog' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Request_Dark_Env, KeepCurrentBG) == 0x00002A, "Member 'BP_BtlEnvironment_C_Request_Dark_Env::KeepCurrentBG' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Request_Dark_Env, HideBGWithDarkParam) == 0x00002B, "Member 'BP_BtlEnvironment_C_Request_Dark_Env::HideBGWithDarkParam' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BtlEnvironment_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEnvironment_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BtlEnvironment_C_ReceiveTick");
static_assert(sizeof(BP_BtlEnvironment_C_ReceiveTick) == 0x000004, "Wrong size on BP_BtlEnvironment_C_ReceiveTick");
static_assert(offsetof(BP_BtlEnvironment_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BtlEnvironment_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.SetBGVisible
// 0x0028 (0x0028 - 0x0000)
struct BP_BtlEnvironment_C_SetBGVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEnvironment_C_SetBGVisible) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_SetBGVisible");
static_assert(sizeof(BP_BtlEnvironment_C_SetBGVisible) == 0x000028, "Wrong size on BP_BtlEnvironment_C_SetBGVisible");
static_assert(offsetof(BP_BtlEnvironment_C_SetBGVisible, Visible) == 0x000000, "Member 'BP_BtlEnvironment_C_SetBGVisible::Visible' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetBGVisible, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_BtlEnvironment_C_SetBGVisible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetBGVisible, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_BtlEnvironment_C_SetBGVisible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetBGVisible, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BtlEnvironment_C_SetBGVisible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetBGVisible, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_BtlEnvironment_C_SetBGVisible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetBGVisible, CallFunc_Array_Get_Item) == 0x000014, "Member 'BP_BtlEnvironment_C_SetBGVisible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetBGVisible, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_BtlEnvironment_C_SetBGVisible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetBGVisible, CallFunc_GetStreamingLevel_ReturnValue) == 0x000020, "Member 'BP_BtlEnvironment_C_SetBGVisible::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.GetMainLight
// 0x0048 (0x0048 - 0x0000)
struct BP_BtlEnvironment_C_GetMainLight final
{
public:
	class ULightComponent*                        Light;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        MainLight;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_FLDSky_C>         K2Node_DynamicCast_AsBPI_FLDSky;                   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_GetDirectionalLightMoon_LightComponent;   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpotLight*                             CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlEnvironment_C_GetMainLight) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_GetMainLight");
static_assert(sizeof(BP_BtlEnvironment_C_GetMainLight) == 0x000048, "Wrong size on BP_BtlEnvironment_C_GetMainLight");
static_assert(offsetof(BP_BtlEnvironment_C_GetMainLight, Light) == 0x000000, "Member 'BP_BtlEnvironment_C_GetMainLight::Light' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_GetMainLight, MainLight) == 0x000008, "Member 'BP_BtlEnvironment_C_GetMainLight::MainLight' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_GetMainLight, K2Node_DynamicCast_AsBPI_FLDSky) == 0x000010, "Member 'BP_BtlEnvironment_C_GetMainLight::K2Node_DynamicCast_AsBPI_FLDSky' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_GetMainLight, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_BtlEnvironment_C_GetMainLight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_GetMainLight, CallFunc_GetDirectionalLightMoon_LightComponent) == 0x000028, "Member 'BP_BtlEnvironment_C_GetMainLight::CallFunc_GetDirectionalLightMoon_LightComponent' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_GetMainLight, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_BtlEnvironment_C_GetMainLight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_GetMainLight, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_BtlEnvironment_C_GetMainLight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_GetMainLight, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_BtlEnvironment_C_GetMainLight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_GetMainLight, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'BP_BtlEnvironment_C_GetMainLight::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.SaveCurrentMainLightParam
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlEnvironment_C_SaveCurrentMainLightParam final
{
public:
	class ULightComponent*                        CallFunc_GetMainLight_LIght;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEnvironment_C_SaveCurrentMainLightParam) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_SaveCurrentMainLightParam");
static_assert(sizeof(BP_BtlEnvironment_C_SaveCurrentMainLightParam) == 0x000008, "Wrong size on BP_BtlEnvironment_C_SaveCurrentMainLightParam");
static_assert(offsetof(BP_BtlEnvironment_C_SaveCurrentMainLightParam, CallFunc_GetMainLight_LIght) == 0x000000, "Member 'BP_BtlEnvironment_C_SaveCurrentMainLightParam::CallFunc_GetMainLight_LIght' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.Initialize
// 0x0060 (0x0060 - 0x0000)
struct BP_BtlEnvironment_C_Initialize final
{
public:
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0000(0x0010)(ReferenceParm)
	TArray<class AFldAnimObj*>                    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CharaDirLight_C*>            CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0028(0x0010)(ReferenceParm)
	class ABP_CharaDirLight_C*                    CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASpotLight*>                     CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0040(0x0010)(ReferenceParm)
	TArray<class ASkyLight*>                      CallFunc_GetAllActorsOfClass_OutActors_3;          // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_BtlEnvironment_C_Initialize) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_Initialize");
static_assert(sizeof(BP_BtlEnvironment_C_Initialize) == 0x000060, "Wrong size on BP_BtlEnvironment_C_Initialize");
static_assert(offsetof(BP_BtlEnvironment_C_Initialize, CallFunc_GetAllActorsWithTag_OutActors) == 0x000000, "Member 'BP_BtlEnvironment_C_Initialize::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Initialize, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_BtlEnvironment_C_Initialize::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Initialize, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_BtlEnvironment_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Initialize, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000028, "Member 'BP_BtlEnvironment_C_Initialize::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Initialize, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'BP_BtlEnvironment_C_Initialize::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Initialize, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x000040, "Member 'BP_BtlEnvironment_C_Initialize::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Initialize, CallFunc_GetAllActorsOfClass_OutActors_3) == 0x000050, "Member 'BP_BtlEnvironment_C_Initialize::CallFunc_GetAllActorsOfClass_OutActors_3' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.SetLightIntensity
// 0x0010 (0x0010 - 0x0000)
struct BP_BtlEnvironment_C_SetLightIntensity final
{
public:
	float                                         Intensity;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_GetMainLight_LIght;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEnvironment_C_SetLightIntensity) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_SetLightIntensity");
static_assert(sizeof(BP_BtlEnvironment_C_SetLightIntensity) == 0x000010, "Wrong size on BP_BtlEnvironment_C_SetLightIntensity");
static_assert(offsetof(BP_BtlEnvironment_C_SetLightIntensity, Intensity) == 0x000000, "Member 'BP_BtlEnvironment_C_SetLightIntensity::Intensity' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetLightIntensity, CallFunc_GetMainLight_LIght) == 0x000008, "Member 'BP_BtlEnvironment_C_SetLightIntensity::CallFunc_GetMainLight_LIght' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.CalcDarkLightIntensity
// 0x0018 (0x0018 - 0x0000)
struct BP_BtlEnvironment_C_CalcDarkLightIntensity final
{
public:
	float                                         AnimRatio;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEnvironment_C_CalcDarkLightIntensity) == 0x000004, "Wrong alignment on BP_BtlEnvironment_C_CalcDarkLightIntensity");
static_assert(sizeof(BP_BtlEnvironment_C_CalcDarkLightIntensity) == 0x000018, "Wrong size on BP_BtlEnvironment_C_CalcDarkLightIntensity");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkLightIntensity, AnimRatio) == 0x000000, "Member 'BP_BtlEnvironment_C_CalcDarkLightIntensity::AnimRatio' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkLightIntensity, CallFunc_FClamp_ReturnValue) == 0x000004, "Member 'BP_BtlEnvironment_C_CalcDarkLightIntensity::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkLightIntensity, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_BtlEnvironment_C_CalcDarkLightIntensity::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkLightIntensity, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_BtlEnvironment_C_CalcDarkLightIntensity::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkLightIntensity, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000010, "Member 'BP_BtlEnvironment_C_CalcDarkLightIntensity::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkLightIntensity, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_BtlEnvironment_C_CalcDarkLightIntensity::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.SetDarkFog
// 0x000C (0x000C - 0x0000)
struct BP_BtlEnvironment_C_SetDarkFog final
{
public:
	float                                         Power;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogDistance;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GradationRange;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEnvironment_C_SetDarkFog) == 0x000004, "Wrong alignment on BP_BtlEnvironment_C_SetDarkFog");
static_assert(sizeof(BP_BtlEnvironment_C_SetDarkFog) == 0x00000C, "Wrong size on BP_BtlEnvironment_C_SetDarkFog");
static_assert(offsetof(BP_BtlEnvironment_C_SetDarkFog, Power) == 0x000000, "Member 'BP_BtlEnvironment_C_SetDarkFog::Power' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetDarkFog, FogDistance) == 0x000004, "Member 'BP_BtlEnvironment_C_SetDarkFog::FogDistance' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetDarkFog, GradationRange) == 0x000008, "Member 'BP_BtlEnvironment_C_SetDarkFog::GradationRange' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.InitEnv
// 0x0048 (0x0048 - 0x0000)
struct BP_BtlEnvironment_C_InitEnv final
{
public:
	struct FBtlSkillEnvParam                      SkillEnv;                                          // 0x0000(0x0020)(Edit, BlueprintVisible)
	struct FBtlSkillEnvParam                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEnvironment_C_InitEnv) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_InitEnv");
static_assert(sizeof(BP_BtlEnvironment_C_InitEnv) == 0x000048, "Wrong size on BP_BtlEnvironment_C_InitEnv");
static_assert(offsetof(BP_BtlEnvironment_C_InitEnv, SkillEnv) == 0x000000, "Member 'BP_BtlEnvironment_C_InitEnv::SkillEnv' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_InitEnv, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'BP_BtlEnvironment_C_InitEnv::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_InitEnv, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000040, "Member 'BP_BtlEnvironment_C_InitEnv::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_InitEnv, CallFunc_FClamp_ReturnValue) == 0x000044, "Member 'BP_BtlEnvironment_C_InitEnv::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.Save Current Skill Env
// 0x0010 (0x0010 - 0x0000)
struct BP_BtlEnvironment_C_Save_Current_Skill_Env final
{
public:
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_2;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_3;    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEnvironment_C_Save_Current_Skill_Env) == 0x000004, "Wrong alignment on BP_BtlEnvironment_C_Save_Current_Skill_Env");
static_assert(sizeof(BP_BtlEnvironment_C_Save_Current_Skill_Env) == 0x000010, "Wrong size on BP_BtlEnvironment_C_Save_Current_Skill_Env");
static_assert(offsetof(BP_BtlEnvironment_C_Save_Current_Skill_Env, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000000, "Member 'BP_BtlEnvironment_C_Save_Current_Skill_Env::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Save_Current_Skill_Env, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000004, "Member 'BP_BtlEnvironment_C_Save_Current_Skill_Env::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Save_Current_Skill_Env, CallFunc_GetScalarParameterValue_ReturnValue_2) == 0x000008, "Member 'BP_BtlEnvironment_C_Save_Current_Skill_Env::CallFunc_GetScalarParameterValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_Save_Current_Skill_Env, CallFunc_GetScalarParameterValue_ReturnValue_3) == 0x00000C, "Member 'BP_BtlEnvironment_C_Save_Current_Skill_Env::CallFunc_GetScalarParameterValue_ReturnValue_3' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.CalcDarkFog
// 0x0070 (0x0070 - 0x0000)
struct BP_BtlEnvironment_C_CalcDarkFog final
{
public:
	float                                         ElapsedTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnd;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimRatio;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlSkillEnvParam                      Work;                                              // 0x0010(0x0020)(Edit, BlueprintVisible)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEnvironment_C_CalcDarkFog) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_CalcDarkFog");
static_assert(sizeof(BP_BtlEnvironment_C_CalcDarkFog) == 0x000070, "Wrong size on BP_BtlEnvironment_C_CalcDarkFog");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, ElapsedTime) == 0x000000, "Member 'BP_BtlEnvironment_C_CalcDarkFog::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, IsEnd) == 0x000004, "Member 'BP_BtlEnvironment_C_CalcDarkFog::IsEnd' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, AnimRatio) == 0x000008, "Member 'BP_BtlEnvironment_C_CalcDarkFog::AnimRatio' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, Work) == 0x000010, "Member 'BP_BtlEnvironment_C_CalcDarkFog::Work' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_FMin_ReturnValue) == 0x000038, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_FClamp_ReturnValue) == 0x000040, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_FClamp_ReturnValue_1) == 0x000048, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_Add_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_FClamp_ReturnValue_2) == 0x000054, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000058, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00005C, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000060, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000064, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000068, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcDarkFog, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00006C, "Member 'BP_BtlEnvironment_C_CalcDarkFog::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.RequestPreSkillEnv
// 0x0028 (0x0028 - 0x0000)
struct BP_BtlEnvironment_C_RequestPreSkillEnv final
{
public:
	struct FBtlSkillEnvParam                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlEnvironment_C_RequestPreSkillEnv) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_RequestPreSkillEnv");
static_assert(sizeof(BP_BtlEnvironment_C_RequestPreSkillEnv) == 0x000028, "Wrong size on BP_BtlEnvironment_C_RequestPreSkillEnv");
static_assert(offsetof(BP_BtlEnvironment_C_RequestPreSkillEnv, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'BP_BtlEnvironment_C_RequestPreSkillEnv::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_RequestPreSkillEnv, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000020, "Member 'BP_BtlEnvironment_C_RequestPreSkillEnv::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.RestoreDefaultSkillEnv
// 0x0078 (0x0078 - 0x0000)
struct BP_BtlEnvironment_C_RestoreDefaultSkillEnv final
{
public:
	float                                         FadeTime;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlSkillEnvParam                      Work;                                              // 0x0008(0x0020)(Edit, BlueprintVisible)
	struct FBtlSkillEnvParam                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlSkillEnvParam                      CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0050(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlEnvironment_C_RestoreDefaultSkillEnv) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_RestoreDefaultSkillEnv");
static_assert(sizeof(BP_BtlEnvironment_C_RestoreDefaultSkillEnv) == 0x000078, "Wrong size on BP_BtlEnvironment_C_RestoreDefaultSkillEnv");
static_assert(offsetof(BP_BtlEnvironment_C_RestoreDefaultSkillEnv, FadeTime) == 0x000000, "Member 'BP_BtlEnvironment_C_RestoreDefaultSkillEnv::FadeTime' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_RestoreDefaultSkillEnv, Work) == 0x000008, "Member 'BP_BtlEnvironment_C_RestoreDefaultSkillEnv::Work' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_RestoreDefaultSkillEnv, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'BP_BtlEnvironment_C_RestoreDefaultSkillEnv::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_RestoreDefaultSkillEnv, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000048, "Member 'BP_BtlEnvironment_C_RestoreDefaultSkillEnv::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_RestoreDefaultSkillEnv, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000050, "Member 'BP_BtlEnvironment_C_RestoreDefaultSkillEnv::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_RestoreDefaultSkillEnv, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000070, "Member 'BP_BtlEnvironment_C_RestoreDefaultSkillEnv::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.SetBGBlack
// 0x0008 (0x0008 - 0x0000)
struct BP_BtlEnvironment_C_SetBGBlack final
{
public:
	float                                         Power;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BtlEnvironment_C_SetBGBlack) == 0x000004, "Wrong alignment on BP_BtlEnvironment_C_SetBGBlack");
static_assert(sizeof(BP_BtlEnvironment_C_SetBGBlack) == 0x000008, "Wrong size on BP_BtlEnvironment_C_SetBGBlack");
static_assert(offsetof(BP_BtlEnvironment_C_SetBGBlack, Power) == 0x000000, "Member 'BP_BtlEnvironment_C_SetBGBlack::Power' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetBGBlack, CallFunc_Less_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_BtlEnvironment_C_SetBGBlack::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_SetBGBlack, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'BP_BtlEnvironment_C_SetBGBlack::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_BtlEnvironment.BP_BtlEnvironment_C.CalcBGBlack
// 0x0050 (0x0050 - 0x0000)
struct BP_BtlEnvironment_C_CalcBGBlack final
{
public:
	float                                         ElapsedTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnd;                                             // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimRatio;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtlSkillEnvParam                      Work;                                              // 0x0010(0x0020)(Edit, BlueprintVisible)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BtlEnvironment_C_CalcBGBlack) == 0x000008, "Wrong alignment on BP_BtlEnvironment_C_CalcBGBlack");
static_assert(sizeof(BP_BtlEnvironment_C_CalcBGBlack) == 0x000050, "Wrong size on BP_BtlEnvironment_C_CalcBGBlack");
static_assert(offsetof(BP_BtlEnvironment_C_CalcBGBlack, ElapsedTime) == 0x000000, "Member 'BP_BtlEnvironment_C_CalcBGBlack::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_BtlEnvironment_C_CalcBGBlack, IsEnd) == 0x000004, "Member 'BP_BtlEnvironment_C_CalcBGBlack::IsEnd' has a wrong offset!");
