#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterBase.BP_CharacterBase_C.ExecuteUbergraph_BP_CharacterBase
// 0x0108 (0x0108 - 0x0000)
struct BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharaPointLight_C*                  K2Node_DynamicCast_AsBP_Chara_Point_Light;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_NoticeToABP_C>    K2Node_DynamicCast_AsBPI_Notice_to_ABP;            // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaPointLight_C*                  K2Node_DynamicCast_AsBP_Chara_Point_Light_1;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastRenderTimeOnScreen_ReturnValue;    // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase) == 0x000008, "Wrong alignment on BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase");
static_assert(sizeof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase) == 0x000108, "Wrong size on BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, EntryPoint) == 0x000000, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, K2Node_DynamicCast_AsBP_Chara_Point_Light) == 0x000018, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::K2Node_DynamicCast_AsBP_Chara_Point_Light' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Array_RemoveItem_ReturnValue) == 0x000021, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_GetAnimInstance_ReturnValue) == 0x000038, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, K2Node_DynamicCast_AsBPI_Notice_to_ABP) == 0x000040, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::K2Node_DynamicCast_AsBPI_Notice_to_ABP' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_GetComponentBounds_Origin) == 0x000064, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_GetComponentBounds_BoxExtent) == 0x000070, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_GetComponentBounds_SphereRadius) == 0x00007C, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_GetSocketLocation_ReturnValue) == 0x000080, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_BreakVector_X) == 0x00008C, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_BreakVector_Y) == 0x000090, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_BreakVector_Z) == 0x000094, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_BreakVector_X_1) == 0x000098, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_BreakVector_Y_1) == 0x00009C, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_BreakVector_Z_1) == 0x0000A0, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0000A4, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000B0, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_BreakVector_X_2) == 0x0000B4, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_BreakVector_Y_2) == 0x0000B8, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_BreakVector_Z_2) == 0x0000BC, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000C0, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, Temp_int_Loop_Counter_Variable) == 0x0000C4, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Add_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, Temp_int_Loop_Counter_Variable_1) == 0x0000D0, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D4, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D8, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, K2Node_Event_OtherActor_1) == 0x0000E0, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, K2Node_DynamicCast_AsBP_Chara_Point_Light_1) == 0x0000E8, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::K2Node_DynamicCast_AsBP_Chara_Point_Light_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x0000F1, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Array_AddUnique_ReturnValue) == 0x0000F4, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, K2Node_Event_DeltaSeconds) == 0x0000F8, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_GetLastRenderTimeOnScreen_ReturnValue) == 0x0000FC, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_GetLastRenderTimeOnScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000100, "Member 'BP_CharacterBase_C_ExecuteUbergraph_BP_CharacterBase::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_CharacterBase.BP_CharacterBase_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterBase_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterBase_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_CharacterBase_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_CharacterBase_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_CharacterBase_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_CharacterBase_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_CharacterBase_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_CharacterBase.BP_CharacterBase_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterBase_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterBase_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_CharacterBase_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_CharacterBase_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_CharacterBase_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_CharacterBase_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_CharacterBase_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_CharacterBase.BP_CharacterBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CharacterBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CharacterBase_C_ReceiveTick");
static_assert(sizeof(BP_CharacterBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_CharacterBase_C_ReceiveTick");
static_assert(offsetof(BP_CharacterBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CharacterBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CharacterBase.BP_CharacterBase_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterBase_C_UserConstructionScript final
{
public:
	TArray<class USceneComponent*>                MeshChildlenComponents;                            // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
};
static_assert(alignof(BP_CharacterBase_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_CharacterBase_C_UserConstructionScript");
static_assert(sizeof(BP_CharacterBase_C_UserConstructionScript) == 0x000010, "Wrong size on BP_CharacterBase_C_UserConstructionScript");
static_assert(offsetof(BP_CharacterBase_C_UserConstructionScript, MeshChildlenComponents) == 0x000000, "Member 'BP_CharacterBase_C_UserConstructionScript::MeshChildlenComponents' has a wrong offset!");

// Function BP_CharacterBase.BP_CharacterBase_C.CreateDMI
// 0x00B8 (0x00B8 - 0x0000)
struct BP_CharacterBase_C_CreateDMI final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0008(0x0010)(Edit, BlueprintVisible)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSkeletalMaterial>              CallFunc_GetMaterials_ReturnValue;                 // 0x0028(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkeletalMaterial                      CallFunc_Array_Get_Item;                           // 0x0040(0x0028)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterBase_C_CreateDMI) == 0x000008, "Wrong alignment on BP_CharacterBase_C_CreateDMI");
static_assert(sizeof(BP_CharacterBase_C_CreateDMI) == 0x0000B8, "Wrong size on BP_CharacterBase_C_CreateDMI");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, MeshComponent) == 0x000000, "Member 'BP_CharacterBase_C_CreateDMI::MeshComponent' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, Materials) == 0x000008, "Member 'BP_CharacterBase_C_CreateDMI::Materials' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000018, "Member 'BP_CharacterBase_C_CreateDMI::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CharacterBase_C_CreateDMI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_CharacterBase_C_CreateDMI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_GetMaterials_ReturnValue) == 0x000028, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_CharacterBase_C_CreateDMI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_IsValid_ReturnValue) == 0x00006C, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_GetDisplayName_ReturnValue) == 0x000070, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_Conv_StringToName_ReturnValue) == 0x000094, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000A0, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_Greater_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_CreateDMI, CallFunc_Array_Length_ReturnValue_2) == 0x0000B0, "Member 'BP_CharacterBase_C_CreateDMI::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");

// Function BP_CharacterBase.BP_CharacterBase_C.SetDMIParameter_CS
// 0x0038 (0x0038 - 0x0000)
struct BP_CharacterBase_C_SetDMIParameter_CS final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NewLocalVar_1;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NewLocalVar_0;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_B;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_A;                                             // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0028(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(BP_CharacterBase_C_SetDMIParameter_CS) == 0x000008, "Wrong alignment on BP_CharacterBase_C_SetDMIParameter_CS");
static_assert(sizeof(BP_CharacterBase_C_SetDMIParameter_CS) == 0x000038, "Wrong size on BP_CharacterBase_C_SetDMIParameter_CS");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_CS, MeshComponent) == 0x000000, "Member 'BP_CharacterBase_C_SetDMIParameter_CS::MeshComponent' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_CS, NewLocalVar_1) == 0x000008, "Member 'BP_CharacterBase_C_SetDMIParameter_CS::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_CS, NewLocalVar_0) == 0x000010, "Member 'BP_CharacterBase_C_SetDMIParameter_CS::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_CS, MID_B) == 0x000018, "Member 'BP_CharacterBase_C_SetDMIParameter_CS::MID_B' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_CS, MID_A) == 0x000020, "Member 'BP_CharacterBase_C_SetDMIParameter_CS::MID_A' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_CS, Materials) == 0x000028, "Member 'BP_CharacterBase_C_SetDMIParameter_CS::Materials' has a wrong offset!");

// Function BP_CharacterBase.BP_CharacterBase_C.SetPointLightParameter
// 0x0160 (0x0160 - 0x0000)
struct BP_CharacterBase_C_SetPointLightParameter final
{
public:
	class UMaterialInstanceDynamic*               MIDObjectReference;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaPointLight_C*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_5;           // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_6;           // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_5;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_6;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterBase_C_SetPointLightParameter) == 0x000008, "Wrong alignment on BP_CharacterBase_C_SetPointLightParameter");
static_assert(sizeof(BP_CharacterBase_C_SetPointLightParameter) == 0x000160, "Wrong size on BP_CharacterBase_C_SetPointLightParameter");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, MIDObjectReference) == 0x000000, "Member 'BP_CharacterBase_C_SetPointLightParameter::MIDObjectReference' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_CharacterBase_C_SetPointLightParameter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue) == 0x000038, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000044, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000050, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000060, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000070, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000090, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000A0, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0000A8, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_3) == 0x0000B0, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_4) == 0x0000C0, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D0, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000E0, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_3) == 0x0000F0, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_4) == 0x0000F8, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_5) == 0x000100, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_6) == 0x000110, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000120, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000130, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_5) == 0x000140, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_6) == 0x000148, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, Temp_int_Loop_Counter_Variable) == 0x000150, "Member 'BP_CharacterBase_C_SetPointLightParameter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Less_IntInt_ReturnValue) == 0x000154, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetPointLightParameter, CallFunc_Add_IntInt_ReturnValue) == 0x000158, "Member 'BP_CharacterBase_C_SetPointLightParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CharacterBase.BP_CharacterBase_C.SetDMIParameter_Tick
// 0x00E8 (0x00E8 - 0x0000)
struct BP_CharacterBase_C_SetDMIParameter_Tick final
{
public:
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterBase_C_SetDMIParameter_Tick) == 0x000008, "Wrong alignment on BP_CharacterBase_C_SetDMIParameter_Tick");
static_assert(sizeof(BP_CharacterBase_C_SetDMIParameter_Tick) == 0x0000E8, "Wrong size on BP_CharacterBase_C_SetDMIParameter_Tick");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_Tick, Materials) == 0x000000, "Member 'BP_CharacterBase_C_SetDMIParameter_Tick::Materials' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_Tick, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_CharacterBase_C_SetDMIParameter_Tick::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_Tick, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_CharacterBase_C_SetDMIParameter_Tick::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_Tick, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_CharacterBase_C_SetDMIParameter_Tick::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_Tick, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_CharacterBase_C_SetDMIParameter_Tick::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_Tick, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_CharacterBase_C_SetDMIParameter_Tick::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_Tick, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_CharacterBase_C_SetDMIParameter_Tick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_Tick, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_CharacterBase_C_SetDMIParameter_Tick::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_Tick, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'BP_CharacterBase_C_SetDMIParameter_Tick::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterBase_C_SetDMIParameter_Tick, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000030, "Member 'BP_CharacterBase_C_SetDMIParameter_Tick::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
