#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Camp_Scene_Capture

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Camp_Scene_Capture.BP_Camp_Scene_Capture_C.ExecuteUbergraph_BP_Camp_Scene_Capture
// 0x0008 (0x0008 - 0x0000)
struct BP_Camp_Scene_Capture_C_ExecuteUbergraph_BP_Camp_Scene_Capture final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_Scene_Capture_C_ExecuteUbergraph_BP_Camp_Scene_Capture) == 0x000004, "Wrong alignment on BP_Camp_Scene_Capture_C_ExecuteUbergraph_BP_Camp_Scene_Capture");
static_assert(sizeof(BP_Camp_Scene_Capture_C_ExecuteUbergraph_BP_Camp_Scene_Capture) == 0x000008, "Wrong size on BP_Camp_Scene_Capture_C_ExecuteUbergraph_BP_Camp_Scene_Capture");
static_assert(offsetof(BP_Camp_Scene_Capture_C_ExecuteUbergraph_BP_Camp_Scene_Capture, EntryPoint) == 0x000000, "Member 'BP_Camp_Scene_Capture_C_ExecuteUbergraph_BP_Camp_Scene_Capture::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Camp_Scene_Capture_C_ExecuteUbergraph_BP_Camp_Scene_Capture, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Camp_Scene_Capture_C_ExecuteUbergraph_BP_Camp_Scene_Capture::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_Camp_Scene_Capture.BP_Camp_Scene_Capture_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Camp_Scene_Capture_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Camp_Scene_Capture_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Camp_Scene_Capture_C_ReceiveTick");
static_assert(sizeof(BP_Camp_Scene_Capture_C_ReceiveTick) == 0x000004, "Wrong size on BP_Camp_Scene_Capture_C_ReceiveTick");
static_assert(offsetof(BP_Camp_Scene_Capture_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Camp_Scene_Capture_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

