#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharaDirLight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CharaDirLight.BP_CharaDirLight_C.ExecuteUbergraph_BP_CharaDirLight
// 0x0004 (0x0004 - 0x0000)
struct BP_CharaDirLight_C_ExecuteUbergraph_BP_CharaDirLight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaDirLight_C_ExecuteUbergraph_BP_CharaDirLight) == 0x000004, "Wrong alignment on BP_CharaDirLight_C_ExecuteUbergraph_BP_CharaDirLight");
static_assert(sizeof(BP_CharaDirLight_C_ExecuteUbergraph_BP_CharaDirLight) == 0x000004, "Wrong size on BP_CharaDirLight_C_ExecuteUbergraph_BP_CharaDirLight");
static_assert(offsetof(BP_CharaDirLight_C_ExecuteUbergraph_BP_CharaDirLight, EntryPoint) == 0x000000, "Member 'BP_CharaDirLight_C_ExecuteUbergraph_BP_CharaDirLight::EntryPoint' has a wrong offset!");

// Function BP_CharaDirLight.BP_CharaDirLight_C.SetLightParameterToMPC
// 0x0028 (0x0028 - 0x0000)
struct BP_CharaDirLight_C_SetLightParameterToMPC final
{
public:
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharaDirLight_C_SetLightParameterToMPC) == 0x000004, "Wrong alignment on BP_CharaDirLight_C_SetLightParameterToMPC");
static_assert(sizeof(BP_CharaDirLight_C_SetLightParameterToMPC) == 0x000028, "Wrong size on BP_CharaDirLight_C_SetLightParameterToMPC");
static_assert(offsetof(BP_CharaDirLight_C_SetLightParameterToMPC, CallFunc_GetForwardVector_ReturnValue) == 0x000000, "Member 'BP_CharaDirLight_C_SetLightParameterToMPC::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaDirLight_C_SetLightParameterToMPC, CallFunc_Multiply_VectorInt_ReturnValue) == 0x00000C, "Member 'BP_CharaDirLight_C_SetLightParameterToMPC::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharaDirLight_C_SetLightParameterToMPC, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000018, "Member 'BP_CharaDirLight_C_SetLightParameterToMPC::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

}

