#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FldPlayer

#include "Basic.hpp"

#include "BP_AppCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FldPlayer.BP_FldPlayer_C
// 0x0010 (0x0950 - 0x0940)
class ABP_FldPlayer_C : public ABP_AppCharacter_C
{
public:
	class UFldCharAccessIconMngComp*              FldCharAccessIconMngComp;                          // 0x0938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFldCharEmotionIconMngComp*             FldCharEmotionIconMngComp;                         // 0x0940(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFldCharPersonalMotionComp*             FldCharPersonalMotionComp;                         // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void SetForceNeautralPose(bool Enable);
	void SetForceMainWaitPose(bool Enable);
	void SetIsTurned(bool Enable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FldPlayer_C">();
	}
	static class ABP_FldPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FldPlayer_C>();
	}
};
static_assert(alignof(ABP_FldPlayer_C) == 0x000010, "Wrong alignment on ABP_FldPlayer_C");
static_assert(sizeof(ABP_FldPlayer_C) == 0x000950, "Wrong size on ABP_FldPlayer_C");
static_assert(offsetof(ABP_FldPlayer_C, FldCharAccessIconMngComp) == 0x000938, "Member 'ABP_FldPlayer_C::FldCharAccessIconMngComp' has a wrong offset!");
static_assert(offsetof(ABP_FldPlayer_C, FldCharEmotionIconMngComp) == 0x000940, "Member 'ABP_FldPlayer_C::FldCharEmotionIconMngComp' has a wrong offset!");
static_assert(offsetof(ABP_FldPlayer_C, FldCharPersonalMotionComp) == 0x000948, "Member 'ABP_FldPlayer_C::FldCharPersonalMotionComp' has a wrong offset!");

}

