#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_F001_SymbolDomitory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Xrd777_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_F001_SymbolDomitory.BP_F001_SymbolDomitory_C
// 0x0040 (0x0350 - 0x0310)
class ABP_F001_SymbolDomitory_C final : public AFldAnimObj
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight_B11;                                     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_B01;                                     // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_A11;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_A01;                                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUITownMapSymbolComponent*              UITownMapSymbol;                                   // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_F001_Symbol;                                    // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_F001_SymbolDomitory(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_F001_SymbolDomitory_C">();
	}
	static class ABP_F001_SymbolDomitory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_F001_SymbolDomitory_C>();
	}
};
static_assert(alignof(ABP_F001_SymbolDomitory_C) == 0x000010, "Wrong alignment on ABP_F001_SymbolDomitory_C");
static_assert(sizeof(ABP_F001_SymbolDomitory_C) == 0x000350, "Wrong size on ABP_F001_SymbolDomitory_C");
static_assert(offsetof(ABP_F001_SymbolDomitory_C, UberGraphFrame) == 0x000310, "Member 'ABP_F001_SymbolDomitory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_F001_SymbolDomitory_C, SpotLight_B11) == 0x000318, "Member 'ABP_F001_SymbolDomitory_C::SpotLight_B11' has a wrong offset!");
static_assert(offsetof(ABP_F001_SymbolDomitory_C, SpotLight_B01) == 0x000320, "Member 'ABP_F001_SymbolDomitory_C::SpotLight_B01' has a wrong offset!");
static_assert(offsetof(ABP_F001_SymbolDomitory_C, SpotLight_A11) == 0x000328, "Member 'ABP_F001_SymbolDomitory_C::SpotLight_A11' has a wrong offset!");
static_assert(offsetof(ABP_F001_SymbolDomitory_C, SpotLight_A01) == 0x000330, "Member 'ABP_F001_SymbolDomitory_C::SpotLight_A01' has a wrong offset!");
static_assert(offsetof(ABP_F001_SymbolDomitory_C, UITownMapSymbol) == 0x000338, "Member 'ABP_F001_SymbolDomitory_C::UITownMapSymbol' has a wrong offset!");
static_assert(offsetof(ABP_F001_SymbolDomitory_C, SK_F001_Symbol) == 0x000340, "Member 'ABP_F001_SymbolDomitory_C::SK_F001_Symbol' has a wrong offset!");

}

