#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HumanBase

#include "Basic.hpp"

#include "ALS_MovementAction_structs.hpp"
#include "ALS_ComponentAndTransform_structs.hpp"
#include "Engine_structs.hpp"
#include "ALS_Gait_structs.hpp"
#include "ALS_MovementState_structs.hpp"
#include "ALS_OverlayState_structs.hpp"
#include "ALS_RotationMode_structs.hpp"
#include "ALS_Stance_structs.hpp"
#include "ALS_ViewMode_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MantleType_structs.hpp"
#include "Mantle_Asset_structs.hpp"
#include "Mantle_Params_structs.hpp"
#include "Mantle_TraceSettings_structs.hpp"
#include "MovementSettings_structs.hpp"
#include "MovementSettings_State_structs.hpp"


namespace SDK::Params
{

// Function BP_HumanBase.BP_HumanBase_C.ExecuteUbergraph_BP_HumanBase
// 0x0110 (0x0110 - 0x0000)
struct BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HalfHeightAdjust_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ScaledHalfHeightAdjust_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HalfHeightAdjust;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ScaledHalfHeightAdjust;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MantleCheck_CanClimb_Vault;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMovementMode                                 K2Node_Event_PrevMovementMode;                     // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_Event_NewMovementMode;                      // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_PrevCustomMode;                       // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_NewCustomMode;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0034(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IALS_Animation_BPI_C>  K2Node_DynamicCast_AsALS_Animation_BPI;            // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Select_Default;                             // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EALS_MovementState                            K2Node_Event_NewMovementState;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EALS_MovementAction                           K2Node_Event_NewMovementAction;                    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EALS_RotationMode                             K2Node_Event_NewRotationMode;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EALS_Gait                                     K2Node_Event_NewGait;                              // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EALS_ViewMode                                 K2Node_Event_NewViewMode;                          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_4;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EALS_OverlayState                             K2Node_Event_NewOverlayState;                      // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_5;          // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_InputAxisEvent_AxisValue_1;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetRollAnimation_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetRollAnimation_ReturnValue_1;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue_1;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase) == 0x000008, "Wrong alignment on BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase");
static_assert(sizeof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase) == 0x000110, "Wrong size on BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, EntryPoint) == 0x000000, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_HalfHeightAdjust_1) == 0x00000C, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_HalfHeightAdjust_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_ScaledHalfHeightAdjust_1) == 0x000010, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_ScaledHalfHeightAdjust_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_HalfHeightAdjust) == 0x000014, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_HalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_ScaledHalfHeightAdjust) == 0x000018, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_ScaledHalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_MantleCheck_CanClimb_Vault) == 0x00001C, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_MantleCheck_CanClimb_Vault' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_PrevMovementMode) == 0x00001D, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_PrevMovementMode' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_NewMovementMode) == 0x00001E, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_NewMovementMode' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_PrevCustomMode) == 0x00001F, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_PrevCustomMode' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_NewCustomMode) == 0x000020, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_NewCustomMode' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000024, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_Hit) == 0x000034, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_IsValid_ReturnValue_2) == 0x0000BC, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_DynamicCast_AsALS_Animation_BPI) == 0x0000C0, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_DynamicCast_AsALS_Animation_BPI' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_SwitchEnum_CmpSuccess) == 0x0000D1, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, Temp_bool_Variable) == 0x0000D2, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Select_Default) == 0x0000D4, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_NewMovementState) == 0x0000E0, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_NewMovementState' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000E1, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_NewMovementAction) == 0x0000E2, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_NewMovementAction' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000E3, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_NewRotationMode) == 0x0000E4, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_NewRotationMode' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x0000E5, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_NewGait) == 0x0000E6, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_NewGait' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x0000E7, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_NewViewMode) == 0x0000E8, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_NewViewMode' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_NotEqual_ByteByte_ReturnValue_4) == 0x0000E9, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_NotEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_Event_NewOverlayState) == 0x0000EA, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_Event_NewOverlayState' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_NotEqual_ByteByte_ReturnValue_5) == 0x0000EB, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_NotEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_InputAxisEvent_AxisValue_1) == 0x0000EC, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_InputAxisEvent_AxisValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_GetRollAnimation_ReturnValue) == 0x0000F0, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_GetRollAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_GetRollAnimation_ReturnValue_1) == 0x0000F8, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_GetRollAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_Montage_Play_ReturnValue) == 0x000100, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, CallFunc_Montage_Play_ReturnValue_1) == 0x000104, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::CallFunc_Montage_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase, K2Node_InputAxisEvent_AxisValue) == 0x000108, "Member 'BP_HumanBase_C_ExecuteUbergraph_BP_HumanBase::K2Node_InputAxisEvent_AxisValue' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.InpAxisEvt_PM_AxisLY_K2Node_InputAxisEvent_0
// 0x0004 (0x0004 - 0x0000)
struct BP_HumanBase_C_InpAxisEvt_PM_AxisLY_K2Node_InputAxisEvent_0 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_InpAxisEvt_PM_AxisLY_K2Node_InputAxisEvent_0) == 0x000004, "Wrong alignment on BP_HumanBase_C_InpAxisEvt_PM_AxisLY_K2Node_InputAxisEvent_0");
static_assert(sizeof(BP_HumanBase_C_InpAxisEvt_PM_AxisLY_K2Node_InputAxisEvent_0) == 0x000004, "Wrong size on BP_HumanBase_C_InpAxisEvt_PM_AxisLY_K2Node_InputAxisEvent_0");
static_assert(offsetof(BP_HumanBase_C_InpAxisEvt_PM_AxisLY_K2Node_InputAxisEvent_0, AxisValue) == 0x000000, "Member 'BP_HumanBase_C_InpAxisEvt_PM_AxisLY_K2Node_InputAxisEvent_0::AxisValue' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.InpAxisEvt_PM_AxisLX_K2Node_InputAxisEvent_1
// 0x0004 (0x0004 - 0x0000)
struct BP_HumanBase_C_InpAxisEvt_PM_AxisLX_K2Node_InputAxisEvent_1 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_InpAxisEvt_PM_AxisLX_K2Node_InputAxisEvent_1) == 0x000004, "Wrong alignment on BP_HumanBase_C_InpAxisEvt_PM_AxisLX_K2Node_InputAxisEvent_1");
static_assert(sizeof(BP_HumanBase_C_InpAxisEvt_PM_AxisLX_K2Node_InputAxisEvent_1) == 0x000004, "Wrong size on BP_HumanBase_C_InpAxisEvt_PM_AxisLX_K2Node_InputAxisEvent_1");
static_assert(offsetof(BP_HumanBase_C_InpAxisEvt_PM_AxisLX_K2Node_InputAxisEvent_1, AxisValue) == 0x000000, "Member 'BP_HumanBase_C_InpAxisEvt_PM_AxisLX_K2Node_InputAxisEvent_1::AxisValue' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.BPI_Set_OverlayState
// 0x0001 (0x0001 - 0x0000)
struct BP_HumanBase_C_BPI_Set_OverlayState final
{
public:
	EALS_OverlayState                             NewOverlayState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_BPI_Set_OverlayState) == 0x000001, "Wrong alignment on BP_HumanBase_C_BPI_Set_OverlayState");
static_assert(sizeof(BP_HumanBase_C_BPI_Set_OverlayState) == 0x000001, "Wrong size on BP_HumanBase_C_BPI_Set_OverlayState");
static_assert(offsetof(BP_HumanBase_C_BPI_Set_OverlayState, NewOverlayState) == 0x000000, "Member 'BP_HumanBase_C_BPI_Set_OverlayState::NewOverlayState' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.BPI_Set_ViewMode
// 0x0001 (0x0001 - 0x0000)
struct BP_HumanBase_C_BPI_Set_ViewMode final
{
public:
	EALS_ViewMode                                 NewViewMode;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_BPI_Set_ViewMode) == 0x000001, "Wrong alignment on BP_HumanBase_C_BPI_Set_ViewMode");
static_assert(sizeof(BP_HumanBase_C_BPI_Set_ViewMode) == 0x000001, "Wrong size on BP_HumanBase_C_BPI_Set_ViewMode");
static_assert(offsetof(BP_HumanBase_C_BPI_Set_ViewMode, NewViewMode) == 0x000000, "Member 'BP_HumanBase_C_BPI_Set_ViewMode::NewViewMode' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.BPI_Set_Gait
// 0x0001 (0x0001 - 0x0000)
struct BP_HumanBase_C_BPI_Set_Gait final
{
public:
	EALS_Gait                                     NewGait;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_BPI_Set_Gait) == 0x000001, "Wrong alignment on BP_HumanBase_C_BPI_Set_Gait");
static_assert(sizeof(BP_HumanBase_C_BPI_Set_Gait) == 0x000001, "Wrong size on BP_HumanBase_C_BPI_Set_Gait");
static_assert(offsetof(BP_HumanBase_C_BPI_Set_Gait, NewGait) == 0x000000, "Member 'BP_HumanBase_C_BPI_Set_Gait::NewGait' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.BPI_Set_RotationMode
// 0x0001 (0x0001 - 0x0000)
struct BP_HumanBase_C_BPI_Set_RotationMode final
{
public:
	EALS_RotationMode                             NewRotationMode;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_BPI_Set_RotationMode) == 0x000001, "Wrong alignment on BP_HumanBase_C_BPI_Set_RotationMode");
static_assert(sizeof(BP_HumanBase_C_BPI_Set_RotationMode) == 0x000001, "Wrong size on BP_HumanBase_C_BPI_Set_RotationMode");
static_assert(offsetof(BP_HumanBase_C_BPI_Set_RotationMode, NewRotationMode) == 0x000000, "Member 'BP_HumanBase_C_BPI_Set_RotationMode::NewRotationMode' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.BPI_Set_MovementAction
// 0x0001 (0x0001 - 0x0000)
struct BP_HumanBase_C_BPI_Set_MovementAction final
{
public:
	EALS_MovementAction                           NewMovementAction;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_BPI_Set_MovementAction) == 0x000001, "Wrong alignment on BP_HumanBase_C_BPI_Set_MovementAction");
static_assert(sizeof(BP_HumanBase_C_BPI_Set_MovementAction) == 0x000001, "Wrong size on BP_HumanBase_C_BPI_Set_MovementAction");
static_assert(offsetof(BP_HumanBase_C_BPI_Set_MovementAction, NewMovementAction) == 0x000000, "Member 'BP_HumanBase_C_BPI_Set_MovementAction::NewMovementAction' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.BPI_Set_MovementState
// 0x0001 (0x0001 - 0x0000)
struct BP_HumanBase_C_BPI_Set_MovementState final
{
public:
	EALS_MovementState                            NewMovementState;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_BPI_Set_MovementState) == 0x000001, "Wrong alignment on BP_HumanBase_C_BPI_Set_MovementState");
static_assert(sizeof(BP_HumanBase_C_BPI_Set_MovementState) == 0x000001, "Wrong size on BP_HumanBase_C_BPI_Set_MovementState");
static_assert(offsetof(BP_HumanBase_C_BPI_Set_MovementState, NewMovementState) == 0x000000, "Member 'BP_HumanBase_C_BPI_Set_MovementState::NewMovementState' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.OnLanded
// 0x0088 (0x0088 - 0x0000)
struct BP_HumanBase_C_OnLanded final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_HumanBase_C_OnLanded) == 0x000004, "Wrong alignment on BP_HumanBase_C_OnLanded");
static_assert(sizeof(BP_HumanBase_C_OnLanded) == 0x000088, "Wrong size on BP_HumanBase_C_OnLanded");
static_assert(offsetof(BP_HumanBase_C_OnLanded, Hit) == 0x000000, "Member 'BP_HumanBase_C_OnLanded::Hit' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.K2_OnMovementModeChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_HumanBase_C_K2_OnMovementModeChanged final
{
public:
	EMovementMode                                 PrevMovementMode;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 NewMovementMode;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PrevCustomMode;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         NewCustomMode;                                     // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_K2_OnMovementModeChanged) == 0x000001, "Wrong alignment on BP_HumanBase_C_K2_OnMovementModeChanged");
static_assert(sizeof(BP_HumanBase_C_K2_OnMovementModeChanged) == 0x000004, "Wrong size on BP_HumanBase_C_K2_OnMovementModeChanged");
static_assert(offsetof(BP_HumanBase_C_K2_OnMovementModeChanged, PrevMovementMode) == 0x000000, "Member 'BP_HumanBase_C_K2_OnMovementModeChanged::PrevMovementMode' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_K2_OnMovementModeChanged, NewMovementMode) == 0x000001, "Member 'BP_HumanBase_C_K2_OnMovementModeChanged::NewMovementMode' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_K2_OnMovementModeChanged, PrevCustomMode) == 0x000002, "Member 'BP_HumanBase_C_K2_OnMovementModeChanged::PrevCustomMode' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_K2_OnMovementModeChanged, NewCustomMode) == 0x000003, "Member 'BP_HumanBase_C_K2_OnMovementModeChanged::NewCustomMode' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.K2_OnEndCrouch
// 0x0008 (0x0008 - 0x0000)
struct BP_HumanBase_C_K2_OnEndCrouch final
{
public:
	float                                         HalfHeightAdjust;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaledHalfHeightAdjust;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_K2_OnEndCrouch) == 0x000004, "Wrong alignment on BP_HumanBase_C_K2_OnEndCrouch");
static_assert(sizeof(BP_HumanBase_C_K2_OnEndCrouch) == 0x000008, "Wrong size on BP_HumanBase_C_K2_OnEndCrouch");
static_assert(offsetof(BP_HumanBase_C_K2_OnEndCrouch, HalfHeightAdjust) == 0x000000, "Member 'BP_HumanBase_C_K2_OnEndCrouch::HalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_K2_OnEndCrouch, ScaledHalfHeightAdjust) == 0x000004, "Member 'BP_HumanBase_C_K2_OnEndCrouch::ScaledHalfHeightAdjust' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.K2_OnStartCrouch
// 0x0008 (0x0008 - 0x0000)
struct BP_HumanBase_C_K2_OnStartCrouch final
{
public:
	float                                         HalfHeightAdjust;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaledHalfHeightAdjust;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_K2_OnStartCrouch) == 0x000004, "Wrong alignment on BP_HumanBase_C_K2_OnStartCrouch");
static_assert(sizeof(BP_HumanBase_C_K2_OnStartCrouch) == 0x000008, "Wrong size on BP_HumanBase_C_K2_OnStartCrouch");
static_assert(offsetof(BP_HumanBase_C_K2_OnStartCrouch, HalfHeightAdjust) == 0x000000, "Member 'BP_HumanBase_C_K2_OnStartCrouch::HalfHeightAdjust' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_K2_OnStartCrouch, ScaledHalfHeightAdjust) == 0x000004, "Member 'BP_HumanBase_C_K2_OnStartCrouch::ScaledHalfHeightAdjust' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_HumanBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_HumanBase_C_ReceiveTick");
static_assert(sizeof(BP_HumanBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_HumanBase_C_ReceiveTick");
static_assert(offsetof(BP_HumanBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_HumanBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.PlayerMovementInput
// 0x0030 (0x0030 - 0x0000)
struct BP_HumanBase_C_PlayerMovementInput final
{
public:
	bool                                          IsForwardAxis;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInputAxisValue_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetControlForward_RightVector_ForwardVector; // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetControlForward_RightVector_RightVector; // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputAxisValue_ReturnValue_1;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FixDiagonalGamepadValues_Y_Out;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FixDiagonalGamepadValues_X_Out;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HumanBase_C_PlayerMovementInput) == 0x000004, "Wrong alignment on BP_HumanBase_C_PlayerMovementInput");
static_assert(sizeof(BP_HumanBase_C_PlayerMovementInput) == 0x000030, "Wrong size on BP_HumanBase_C_PlayerMovementInput");
static_assert(offsetof(BP_HumanBase_C_PlayerMovementInput, IsForwardAxis) == 0x000000, "Member 'BP_HumanBase_C_PlayerMovementInput::IsForwardAxis' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_PlayerMovementInput, CallFunc_GetInputAxisValue_ReturnValue) == 0x000004, "Member 'BP_HumanBase_C_PlayerMovementInput::CallFunc_GetInputAxisValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_PlayerMovementInput, CallFunc_GetControlForward_RightVector_ForwardVector) == 0x000008, "Member 'BP_HumanBase_C_PlayerMovementInput::CallFunc_GetControlForward_RightVector_ForwardVector' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_PlayerMovementInput, CallFunc_GetControlForward_RightVector_RightVector) == 0x000014, "Member 'BP_HumanBase_C_PlayerMovementInput::CallFunc_GetControlForward_RightVector_RightVector' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_PlayerMovementInput, CallFunc_GetInputAxisValue_ReturnValue_1) == 0x000020, "Member 'BP_HumanBase_C_PlayerMovementInput::CallFunc_GetInputAxisValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_PlayerMovementInput, CallFunc_FixDiagonalGamepadValues_Y_Out) == 0x000024, "Member 'BP_HumanBase_C_PlayerMovementInput::CallFunc_FixDiagonalGamepadValues_Y_Out' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_PlayerMovementInput, CallFunc_FixDiagonalGamepadValues_X_Out) == 0x000028, "Member 'BP_HumanBase_C_PlayerMovementInput::CallFunc_FixDiagonalGamepadValues_X_Out' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_PlayerMovementInput, K2Node_SwitchEnum_CmpSuccess) == 0x00002C, "Member 'BP_HumanBase_C_PlayerMovementInput::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.SetEssentialValues
// 0x00AC (0x00AC - 0x0000)
struct BP_HumanBase_C_SetEssentialValues final
{
public:
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalculateAcceleration_ReturnValue;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMaxAcceleration_ReturnValue;           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue_1;     // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_SetEssentialValues) == 0x000004, "Wrong alignment on BP_HumanBase_C_SetEssentialValues");
static_assert(sizeof(BP_HumanBase_C_SetEssentialValues) == 0x0000AC, "Wrong size on BP_HumanBase_C_SetEssentialValues");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_GetVelocity_ReturnValue) == 0x000004, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_GetVelocity_ReturnValue_1) == 0x000010, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00001C, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_BreakVector_Y) == 0x00002C, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_MakeVector_ReturnValue) == 0x000034, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000040, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_VSize_ReturnValue) == 0x000044, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_CalculateAcceleration_ReturnValue) == 0x000048, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_CalculateAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_GetCurrentAcceleration_ReturnValue) == 0x000054, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_GetCurrentAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000060, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x000064, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_GetMaxAcceleration_ReturnValue) == 0x000070, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_GetMaxAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_GetCurrentAcceleration_ReturnValue_1) == 0x000074, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_GetCurrentAcceleration_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_GetControlRotation_ReturnValue) == 0x000080, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_VSize_ReturnValue_1) == 0x00008C, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_BreakRotator_Roll) == 0x000090, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_BreakRotator_Pitch) == 0x000094, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_BreakRotator_Yaw) == 0x000098, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00009C, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A0, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000A4, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_SetEssentialValues, CallFunc_Abs_ReturnValue) == 0x0000A8, "Member 'BP_HumanBase_C_SetEssentialValues::CallFunc_Abs_ReturnValue' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.CacheValues
// 0x0024 (0x0024 - 0x0000)
struct BP_HumanBase_C_CacheValues final
{
public:
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HumanBase_C_CacheValues) == 0x000004, "Wrong alignment on BP_HumanBase_C_CacheValues");
static_assert(sizeof(BP_HumanBase_C_CacheValues) == 0x000024, "Wrong size on BP_HumanBase_C_CacheValues");
static_assert(offsetof(BP_HumanBase_C_CacheValues, CallFunc_GetVelocity_ReturnValue) == 0x000000, "Member 'BP_HumanBase_C_CacheValues::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_CacheValues, CallFunc_GetControlRotation_ReturnValue) == 0x00000C, "Member 'BP_HumanBase_C_CacheValues::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_CacheValues, CallFunc_BreakRotator_Roll) == 0x000018, "Member 'BP_HumanBase_C_CacheValues::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_CacheValues, CallFunc_BreakRotator_Pitch) == 0x00001C, "Member 'BP_HumanBase_C_CacheValues::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_CacheValues, CallFunc_BreakRotator_Yaw) == 0x000020, "Member 'BP_HumanBase_C_CacheValues::CallFunc_BreakRotator_Yaw' has a wrong offset!");

// Function BP_HumanBase.BP_HumanBase_C.UpdateGroudedRotation
// 0x0170 (0x0170 - 0x0000)
struct BP_HumanBase_C_UpdateGroudedRotation final
{
public:
	bool                                          CallFunc_CanUpdateMovingRotation_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_CalculateGroundedRotationRate_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetAnimCurveValue_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimCurveValue_ReturnValue_1;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateGroundedRotationRate_ReturnValue_1; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_4;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_4;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_4;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateGroundedRotationRate_ReturnValue_2; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_5;                // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddActorWorldRotation_SweepHitResult;  // 0x00E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HumanBase_C_UpdateGroudedRotation) == 0x000004, "Wrong alignment on BP_HumanBase_C_UpdateGroudedRotation");
static_assert(sizeof(BP_HumanBase_C_UpdateGroudedRotation) == 0x000170, "Wrong size on BP_HumanBase_C_UpdateGroudedRotation");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_CanUpdateMovingRotation_ReturnValue) == 0x000000, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_CanUpdateMovingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_HumanBase_C_UpdateGroudedRotation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_GetControlRotation_ReturnValue) == 0x000008, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000014, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_MakeRotator_ReturnValue) == 0x00002C, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_CalculateGroundedRotationRate_ReturnValue) == 0x000038, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_CalculateGroundedRotationRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_BreakRotator_Roll_1) == 0x00003C, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_BreakRotator_Pitch_1) == 0x000040, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_BreakRotator_Yaw_1) == 0x000044, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, K2Node_SwitchEnum_CmpSuccess_1) == 0x000048, "Member 'BP_HumanBase_C_UpdateGroudedRotation::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_MakeRotator_ReturnValue_1) == 0x00004C, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_GetAnimCurveValue_ReturnValue) == 0x000058, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_GetAnimCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_Abs_ReturnValue) == 0x00005C, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_GetAnimCurveValue_ReturnValue_1) == 0x000060, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_GetAnimCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HumanBase_C_UpdateGroudedRotation, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000064, "Member 'BP_HumanBase_C_UpdateGroudedRotation::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
