#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainCharaBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MainCharaBase.BP_MainCharaBase_C.ExecuteUbergraph_BP_MainCharaBase
// 0x0008 (0x0008 - 0x0000)
struct BP_MainCharaBase_C_ExecuteUbergraph_BP_MainCharaBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharaBase_C_ExecuteUbergraph_BP_MainCharaBase) == 0x000004, "Wrong alignment on BP_MainCharaBase_C_ExecuteUbergraph_BP_MainCharaBase");
static_assert(sizeof(BP_MainCharaBase_C_ExecuteUbergraph_BP_MainCharaBase) == 0x000008, "Wrong size on BP_MainCharaBase_C_ExecuteUbergraph_BP_MainCharaBase");
static_assert(offsetof(BP_MainCharaBase_C_ExecuteUbergraph_BP_MainCharaBase, EntryPoint) == 0x000000, "Member 'BP_MainCharaBase_C_ExecuteUbergraph_BP_MainCharaBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MainCharaBase_C_ExecuteUbergraph_BP_MainCharaBase, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_MainCharaBase_C_ExecuteUbergraph_BP_MainCharaBase::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_MainCharaBase.BP_MainCharaBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_MainCharaBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharaBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_MainCharaBase_C_ReceiveTick");
static_assert(sizeof(BP_MainCharaBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_MainCharaBase_C_ReceiveTick");
static_assert(offsetof(BP_MainCharaBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_MainCharaBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

