#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PersonaBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PersonaBase.BP_PersonaBase_C.ExecuteUbergraph_BP_PersonaBase
// 0x0050 (0x0050 - 0x0000)
struct BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaPointLight_C*                  K2Node_DynamicCast_AsBP_Chara_Point_Light;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharaPointLight_C*                  K2Node_DynamicCast_AsBP_Chara_Point_Light_1;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCompLastRenderTimeOnScreen_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase) == 0x000008, "Wrong alignment on BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase");
static_assert(sizeof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase) == 0x000050, "Wrong size on BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, EntryPoint) == 0x000000, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, K2Node_Event_OtherActor_1) == 0x000008, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, K2Node_DynamicCast_AsBP_Chara_Point_Light) == 0x000010, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::K2Node_DynamicCast_AsBP_Chara_Point_Light' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, CallFunc_Array_AddUnique_ReturnValue) == 0x000020, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, K2Node_Event_OtherActor) == 0x000028, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, K2Node_DynamicCast_AsBP_Chara_Point_Light_1) == 0x000030, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::K2Node_DynamicCast_AsBP_Chara_Point_Light_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, CallFunc_GetCompLastRenderTimeOnScreen_ReturnValue) == 0x00003C, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::CallFunc_GetCompLastRenderTimeOnScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, CallFunc_Array_RemoveItem_ReturnValue) == 0x000040, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, K2Node_Event_DeltaSeconds) == 0x000044, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_PersonaBase_C_ExecuteUbergraph_BP_PersonaBase::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_PersonaBase.BP_PersonaBase_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_PersonaBase_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PersonaBase_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_PersonaBase_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_PersonaBase_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_PersonaBase_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_PersonaBase_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_PersonaBase_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_PersonaBase.BP_PersonaBase_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_PersonaBase_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PersonaBase_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_PersonaBase_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_PersonaBase_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_PersonaBase_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_PersonaBase_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_PersonaBase_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_PersonaBase.BP_PersonaBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PersonaBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PersonaBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PersonaBase_C_ReceiveTick");
static_assert(sizeof(BP_PersonaBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_PersonaBase_C_ReceiveTick");
static_assert(offsetof(BP_PersonaBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PersonaBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PersonaBase.BP_PersonaBase_C.UserConstructionScript
// 0x0060 (0x0060 - 0x0000)
struct BP_PersonaBase_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PersonaBase_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_PersonaBase_C_UserConstructionScript");
static_assert(sizeof(BP_PersonaBase_C_UserConstructionScript) == 0x000060, "Wrong size on BP_PersonaBase_C_UserConstructionScript");
static_assert(offsetof(BP_PersonaBase_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_PersonaBase_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_UserConstructionScript, CallFunc_GetSocketLocation_ReturnValue) == 0x000004, "Member 'BP_PersonaBase_C_UserConstructionScript::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_UserConstructionScript, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000010, "Member 'BP_PersonaBase_C_UserConstructionScript::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_UserConstructionScript, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000020, "Member 'BP_PersonaBase_C_UserConstructionScript::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_UserConstructionScript, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000030, "Member 'BP_PersonaBase_C_UserConstructionScript::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_PersonaBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_PersonaBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_PersonaBase_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_PersonaBase_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_PersonaBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_PersonaBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PersonaBase.BP_PersonaBase_C.CreateDMI
// 0x0078 (0x0078 - 0x0000)
struct BP_PersonaBase_C_CreateDMI final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0018(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PersonaBase_C_CreateDMI) == 0x000008, "Wrong alignment on BP_PersonaBase_C_CreateDMI");
static_assert(sizeof(BP_PersonaBase_C_CreateDMI) == 0x000078, "Wrong size on BP_PersonaBase_C_CreateDMI");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, MeshComponent) == 0x000000, "Member 'BP_PersonaBase_C_CreateDMI::MeshComponent' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, Materials) == 0x000008, "Member 'BP_PersonaBase_C_CreateDMI::Materials' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, CallFunc_GetMaterials_ReturnValue) == 0x000018, "Member 'BP_PersonaBase_C_CreateDMI::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, Temp_int_Variable) == 0x000028, "Member 'BP_PersonaBase_C_CreateDMI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, CallFunc_Array_LastIndex_ReturnValue) == 0x00002C, "Member 'BP_PersonaBase_C_CreateDMI::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_PersonaBase_C_CreateDMI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'BP_PersonaBase_C_CreateDMI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'BP_PersonaBase_C_CreateDMI::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BP_PersonaBase_C_CreateDMI::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, CallFunc_Conv_StringToName_ReturnValue) == 0x000060, "Member 'BP_PersonaBase_C_CreateDMI::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BP_PersonaBase_C_CreateDMI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_CreateDMI, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000070, "Member 'BP_PersonaBase_C_CreateDMI::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_PersonaBase.BP_PersonaBase_C.SetPointLightParameter
// 0x0170 (0x0170 - 0x0000)
struct BP_PersonaBase_C_SetPointLightParameter final
{
public:
	class UMaterialInstanceDynamic*               MIDObjectReference;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_CharaPointLight_C*                  K2Node_DynamicCast_AsBP_Chara_Point_Light;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_5;           // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_5;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_6;           // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_6;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PersonaBase_C_SetPointLightParameter) == 0x000008, "Wrong alignment on BP_PersonaBase_C_SetPointLightParameter");
static_assert(sizeof(BP_PersonaBase_C_SetPointLightParameter) == 0x000170, "Wrong size on BP_PersonaBase_C_SetPointLightParameter");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, MIDObjectReference) == 0x000000, "Member 'BP_PersonaBase_C_SetPointLightParameter::MIDObjectReference' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_PersonaBase_C_SetPointLightParameter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_PersonaBase_C_SetPointLightParameter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, K2Node_DynamicCast_AsBP_Chara_Point_Light) == 0x000038, "Member 'BP_PersonaBase_C_SetPointLightParameter::K2Node_DynamicCast_AsBP_Chara_Point_Light' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_PersonaBase_C_SetPointLightParameter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue) == 0x000058, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000060, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000070, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000090, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000A0, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_2) == 0x0000A8, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B8, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_3) == 0x0000C8, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0000D8, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000E0, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_3) == 0x0000F0, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_4) == 0x0000F8, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000108, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_5) == 0x000118, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_4) == 0x000128, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000130, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_5) == 0x000140, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_IntToString_ReturnValue_6) == 0x000148, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_IntToString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000158, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetPointLightParameter, CallFunc_Conv_StringToName_ReturnValue_6) == 0x000168, "Member 'BP_PersonaBase_C_SetPointLightParameter::CallFunc_Conv_StringToName_ReturnValue_6' has a wrong offset!");

// Function BP_PersonaBase.BP_PersonaBase_C.SetDMIParameter_Tick
// 0x00A8 (0x00A8 - 0x0000)
struct BP_PersonaBase_C_SetDMIParameter_Tick final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PersonaBase_C_SetDMIParameter_Tick) == 0x000008, "Wrong alignment on BP_PersonaBase_C_SetDMIParameter_Tick");
static_assert(sizeof(BP_PersonaBase_C_SetDMIParameter_Tick) == 0x0000A8, "Wrong size on BP_PersonaBase_C_SetDMIParameter_Tick");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_X) == 0x00000C, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_Z) == 0x000014, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000020, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000030, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_X_1) == 0x000040, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_Y_1) == 0x000044, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_Z_1) == 0x000048, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_GetSocketLocation_ReturnValue) == 0x000050, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_GetSocketLocation_ReturnValue_1) == 0x00005C, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_X_2) == 0x000068, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_Y_2) == 0x00006C, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_Z_2) == 0x000070, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_X_3) == 0x000074, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_Y_3) == 0x000078, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_BreakVector_Z_3) == 0x00007C, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000080, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_NearlyEqual_FloatFloat_ReturnValue_1) == 0x000081, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_NearlyEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetDMIParameter_Tick, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A5, "Member 'BP_PersonaBase_C_SetDMIParameter_Tick::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_PersonaBase.BP_PersonaBase_C.SetScalarParameterValueEx
// 0x0020 (0x0020 - 0x0000)
struct BP_PersonaBase_C_SetScalarParameterValueEx final
{
public:
	class UMaterialInstanceDynamic*               Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ParameterName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParameterValue;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RequestValue;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PersonaBase_C_SetScalarParameterValueEx) == 0x000008, "Wrong alignment on BP_PersonaBase_C_SetScalarParameterValueEx");
static_assert(sizeof(BP_PersonaBase_C_SetScalarParameterValueEx) == 0x000020, "Wrong size on BP_PersonaBase_C_SetScalarParameterValueEx");
static_assert(offsetof(BP_PersonaBase_C_SetScalarParameterValueEx, Material) == 0x000000, "Member 'BP_PersonaBase_C_SetScalarParameterValueEx::Material' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetScalarParameterValueEx, ParameterName) == 0x000008, "Member 'BP_PersonaBase_C_SetScalarParameterValueEx::ParameterName' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetScalarParameterValueEx, ParameterValue) == 0x000010, "Member 'BP_PersonaBase_C_SetScalarParameterValueEx::ParameterValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetScalarParameterValueEx, RequestValue) == 0x000014, "Member 'BP_PersonaBase_C_SetScalarParameterValueEx::RequestValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetScalarParameterValueEx, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000018, "Member 'BP_PersonaBase_C_SetScalarParameterValueEx::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_SetScalarParameterValueEx, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_PersonaBase_C_SetScalarParameterValueEx::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_PersonaBase.BP_PersonaBase_C.GetClosestPointLights
// 0x0070 (0x0070 - 0x0000)
struct BP_PersonaBase_C_GetClosestPointLights final
{
public:
	int32                                         MaxNumOfPointLights;                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 LightDistance;                                     // 0x0008(0x0010)(Edit, BlueprintVisible)
	float                                         Distance;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PersonaBase_C_GetClosestPointLights) == 0x000008, "Wrong alignment on BP_PersonaBase_C_GetClosestPointLights");
static_assert(sizeof(BP_PersonaBase_C_GetClosestPointLights) == 0x000070, "Wrong size on BP_PersonaBase_C_GetClosestPointLights");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, MaxNumOfPointLights) == 0x000000, "Member 'BP_PersonaBase_C_GetClosestPointLights::MaxNumOfPointLights' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, LightDistance) == 0x000008, "Member 'BP_PersonaBase_C_GetClosestPointLights::LightDistance' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, Distance) == 0x000018, "Member 'BP_PersonaBase_C_GetClosestPointLights::Distance' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_PersonaBase_C_GetClosestPointLights::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_PersonaBase_C_GetClosestPointLights::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, Temp_int_Variable) == 0x000030, "Member 'BP_PersonaBase_C_GetClosestPointLights::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_Less_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, K2Node_MakeArray_Array) == 0x000040, "Member 'BP_PersonaBase_C_GetClosestPointLights::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, Temp_bool_Variable) == 0x000051, "Member 'BP_PersonaBase_C_GetClosestPointLights::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_BooleanAND_ReturnValue) == 0x000065, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PersonaBase_C_GetClosestPointLights, CallFunc_GetDistanceTo_ReturnValue) == 0x000068, "Member 'BP_PersonaBase_C_GetClosestPointLights::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");

// Function BP_PersonaBase.BP_PersonaBase_C.Set Niagara Offscreen Mode
// 0x0050 (0x0050 - 0x0000)
struct BP_PersonaBase_C_Set_Niagara_Offscreen_Mode final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
