#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PersonaStatusDraw

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Xrd777_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PersonaStatusDraw.BP_PersonaStatusDraw_C
// 0x0018 (0x0918 - 0x0900)
class ABP_PersonaStatusDraw_C final : public APersonaStatusDraw
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0900(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Background_Material_Instance;                      // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PersonaStatusDraw(int32 EntryPoint);
	void OnSetBackgroundAlphaEvent(float Param1);
	void OnSetCausticsSlideEvent(float Param1, float Param2);
	void OnSetCausticsRectMaskScaleEvent(float Param1);
	void OnSkillSelectListEvent(float Param1);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void Scene_Main();
	void Scene_Combine();
	void Scene_LevelUp();
	void Scene_ParameterUp();
	void Scene_Skill_Card();
	void Scene_Drawer();
	void Scene_Registry();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PersonaStatusDraw_C">();
	}
	static class ABP_PersonaStatusDraw_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PersonaStatusDraw_C>();
	}
};
static_assert(alignof(ABP_PersonaStatusDraw_C) == 0x000008, "Wrong alignment on ABP_PersonaStatusDraw_C");
static_assert(sizeof(ABP_PersonaStatusDraw_C) == 0x000918, "Wrong size on ABP_PersonaStatusDraw_C");
static_assert(offsetof(ABP_PersonaStatusDraw_C, UberGraphFrame) == 0x000900, "Member 'ABP_PersonaStatusDraw_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PersonaStatusDraw_C, DefaultSceneRoot) == 0x000908, "Member 'ABP_PersonaStatusDraw_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PersonaStatusDraw_C, Background_Material_Instance) == 0x000910, "Member 'ABP_PersonaStatusDraw_C::Background_Material_Instance' has a wrong offset!");

}

