#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_P3_Logo

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_P3_Logo.BP_P3_Logo_C.ExecuteUbergraph_BP_P3_Logo
// 0x0030 (0x0030 - 0x0000)
struct BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameClear_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAlpha_ReturnValue;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo) == 0x000008, "Wrong alignment on BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo");
static_assert(sizeof(BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo) == 0x000030, "Wrong size on BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo");
static_assert(offsetof(BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo, EntryPoint) == 0x000000, "Member 'BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000018, "Member 'BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo, CallFunc_IsGameClear_ReturnValue) == 0x000020, "Member 'BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo::CallFunc_IsGameClear_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo, CallFunc_GetAlpha_ReturnValue) == 0x000024, "Member 'BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo::CallFunc_GetAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_P3_Logo_C_ExecuteUbergraph_BP_P3_Logo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_P3_Logo.BP_P3_Logo_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_P3_Logo_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_P3_Logo_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_P3_Logo_C_ReceiveTick");
static_assert(sizeof(BP_P3_Logo_C_ReceiveTick) == 0x000004, "Wrong size on BP_P3_Logo_C_ReceiveTick");
static_assert(offsetof(BP_P3_Logo_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_P3_Logo_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

