#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_P3_Logo_Astrea

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Xrd777_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_P3_Logo_Astrea.BP_P3_Logo_Astrea_C
// 0x0050 (0x02E0 - 0x0290)
class ABP_P3_Logo_Astrea_C final : public ATitleLogoActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   S_UI_P3Logo_TitleA_Jp;                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_UI_P3Logo_TitleB_Jp;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_UI_P3Logo_TitleA;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_UI_P3Logo_TitleB;                                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInst_LogoB;                                // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInst_LogoA;                                // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Logo_jp;                                           // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Logo_en;                                           // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_P3_Logo_Astrea(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Set_Visiblity_Logo(bool IsClear);
	void InitLogo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_P3_Logo_Astrea_C">();
	}
	static class ABP_P3_Logo_Astrea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_P3_Logo_Astrea_C>();
	}
};
static_assert(alignof(ABP_P3_Logo_Astrea_C) == 0x000008, "Wrong alignment on ABP_P3_Logo_Astrea_C");
static_assert(sizeof(ABP_P3_Logo_Astrea_C) == 0x0002E0, "Wrong size on ABP_P3_Logo_Astrea_C");
static_assert(offsetof(ABP_P3_Logo_Astrea_C, UberGraphFrame) == 0x000290, "Member 'ABP_P3_Logo_Astrea_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_P3_Logo_Astrea_C, S_UI_P3Logo_TitleA_Jp) == 0x000298, "Member 'ABP_P3_Logo_Astrea_C::S_UI_P3Logo_TitleA_Jp' has a wrong offset!");
static_assert(offsetof(ABP_P3_Logo_Astrea_C, S_UI_P3Logo_TitleB_Jp) == 0x0002A0, "Member 'ABP_P3_Logo_Astrea_C::S_UI_P3Logo_TitleB_Jp' has a wrong offset!");
static_assert(offsetof(ABP_P3_Logo_Astrea_C, S_UI_P3Logo_TitleA) == 0x0002A8, "Member 'ABP_P3_Logo_Astrea_C::S_UI_P3Logo_TitleA' has a wrong offset!");
static_assert(offsetof(ABP_P3_Logo_Astrea_C, S_UI_P3Logo_TitleB) == 0x0002B0, "Member 'ABP_P3_Logo_Astrea_C::S_UI_P3Logo_TitleB' has a wrong offset!");
static_assert(offsetof(ABP_P3_Logo_Astrea_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_P3_Logo_Astrea_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_P3_Logo_Astrea_C, MaterialInst_LogoB) == 0x0002C0, "Member 'ABP_P3_Logo_Astrea_C::MaterialInst_LogoB' has a wrong offset!");
static_assert(offsetof(ABP_P3_Logo_Astrea_C, MaterialInst_LogoA) == 0x0002C8, "Member 'ABP_P3_Logo_Astrea_C::MaterialInst_LogoA' has a wrong offset!");
static_assert(offsetof(ABP_P3_Logo_Astrea_C, Logo_jp) == 0x0002D0, "Member 'ABP_P3_Logo_Astrea_C::Logo_jp' has a wrong offset!");
static_assert(offsetof(ABP_P3_Logo_Astrea_C, Logo_en) == 0x0002D8, "Member 'ABP_P3_Logo_Astrea_C::Logo_en' has a wrong offset!");

}

