#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TitleCharaBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TitleCharaBase.BP_TitleCharaBase_C
// 0x0018 (0x0238 - 0x0220)
class ABP_TitleCharaBase_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TitleCharaBase(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TitleCharaBase_C">();
	}
	static class ABP_TitleCharaBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TitleCharaBase_C>();
	}
};
static_assert(alignof(ABP_TitleCharaBase_C) == 0x000008, "Wrong alignment on ABP_TitleCharaBase_C");
static_assert(sizeof(ABP_TitleCharaBase_C) == 0x000238, "Wrong size on ABP_TitleCharaBase_C");
static_assert(offsetof(ABP_TitleCharaBase_C, UberGraphFrame) == 0x000220, "Member 'ABP_TitleCharaBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TitleCharaBase_C, Mesh) == 0x000228, "Member 'ABP_TitleCharaBase_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_TitleCharaBase_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_TitleCharaBase_C::DefaultSceneRoot' has a wrong offset!");

}

