#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialDraw

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TutorialDraw.BP_TutorialDraw_C.ExecuteUbergraph_BP_TutorialDraw
// 0x0010 (0x0010 - 0x0000)
struct BP_TutorialDraw_C_ExecuteUbergraph_BP_TutorialDraw final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialDraw_C_ExecuteUbergraph_BP_TutorialDraw) == 0x000008, "Wrong alignment on BP_TutorialDraw_C_ExecuteUbergraph_BP_TutorialDraw");
static_assert(sizeof(BP_TutorialDraw_C_ExecuteUbergraph_BP_TutorialDraw) == 0x000010, "Wrong size on BP_TutorialDraw_C_ExecuteUbergraph_BP_TutorialDraw");
static_assert(offsetof(BP_TutorialDraw_C_ExecuteUbergraph_BP_TutorialDraw, EntryPoint) == 0x000000, "Member 'BP_TutorialDraw_C_ExecuteUbergraph_BP_TutorialDraw::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TutorialDraw_C_ExecuteUbergraph_BP_TutorialDraw, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_TutorialDraw_C_ExecuteUbergraph_BP_TutorialDraw::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TutorialDraw_C_ExecuteUbergraph_BP_TutorialDraw, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_TutorialDraw_C_ExecuteUbergraph_BP_TutorialDraw::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_TutorialDraw.BP_TutorialDraw_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TutorialDraw_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TutorialDraw_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TutorialDraw_C_ReceiveTick");
static_assert(sizeof(BP_TutorialDraw_C_ReceiveTick) == 0x000004, "Wrong size on BP_TutorialDraw_C_ReceiveTick");
static_assert(offsetof(BP_TutorialDraw_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TutorialDraw_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

