#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIConfiguration

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Xrd777_structs.hpp"
#include "FEqualizerSettings_structs.hpp"


namespace SDK::Params
{

// Function BP_UIConfiguration.BP_UIConfiguration_C.ExecuteUbergraph_BP_UIConfiguration
// 0x01E8 (0x01E8 - 0x0000)
struct BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingAstrea_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Loaded_8;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_7;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_1;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_6;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_2;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_3;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_4;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_4; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_5;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_5;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_5; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_6;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_7;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_6;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_6; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_8;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface_7;         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_7; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration");
static_assert(sizeof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration) == 0x0001E8, "Wrong size on BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, EntryPoint) == 0x000000, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, CallFunc_IsPlayingAstrea_ReturnValue) == 0x000004, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::CallFunc_IsPlayingAstrea_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CreateDelegate_OutputDelegate_4) == 0x000048, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CustomEvent_Loaded_8) == 0x000058, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CustomEvent_Loaded_8' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, Temp_object_Variable) == 0x000060, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_AsMaterial_Interface) == 0x000068, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000078, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CustomEvent_Loaded_7) == 0x000080, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CustomEvent_Loaded_7' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, Temp_object_Variable_1) == 0x000088, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_AsMaterial_Interface_1) == 0x000090, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_AsMaterial_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000A0, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CustomEvent_Loaded_6) == 0x0000A8, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CustomEvent_Loaded_6' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, Temp_object_Variable_2) == 0x0000B0, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_AsMaterial_Interface_2) == 0x0000B8, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_AsMaterial_Interface_2' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x0000C8, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CustomEvent_Loaded_5) == 0x0000D0, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, Temp_object_Variable_3) == 0x0000D8, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_AsMaterial_Interface_3) == 0x0000E0, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_AsMaterial_Interface_3' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_bSuccess_3) == 0x0000E8, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x0000F0, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CustomEvent_Loaded_4) == 0x0000F8, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, Temp_object_Variable_4) == 0x000100, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_AsMaterial_Interface_4) == 0x000108, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_AsMaterial_Interface_4' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_bSuccess_4) == 0x000110, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, CallFunc_CreateDynamicMaterialInstance_ReturnValue_4) == 0x000118, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::CallFunc_CreateDynamicMaterialInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CustomEvent_Loaded_3) == 0x000120, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, Temp_object_Variable_5) == 0x000128, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_AsMaterial_Interface_5) == 0x000130, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_AsMaterial_Interface_5' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_bSuccess_5) == 0x000138, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, CallFunc_CreateDynamicMaterialInstance_ReturnValue_5) == 0x000140, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::CallFunc_CreateDynamicMaterialInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CustomEvent_Loaded_2) == 0x000148, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, Temp_object_Variable_6) == 0x000150, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CustomEvent_Loaded_1) == 0x000158, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, Temp_object_Variable_7) == 0x000160, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_AsMaterial_Interface_6) == 0x000168, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_AsMaterial_Interface_6' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_bSuccess_6) == 0x000170, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, CallFunc_CreateDynamicMaterialInstance_ReturnValue_6) == 0x000178, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::CallFunc_CreateDynamicMaterialInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CustomEvent_Loaded) == 0x000180, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, Temp_object_Variable_8) == 0x000188, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_AsMaterial_Interface_7) == 0x000190, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_AsMaterial_Interface_7' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_DynamicCast_bSuccess_7) == 0x000198, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, CallFunc_CreateDynamicMaterialInstance_ReturnValue_7) == 0x0001A0, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::CallFunc_CreateDynamicMaterialInstance_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001A8, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001B8, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001C8, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001D8, "Member 'BP_UIConfiguration_C_ExecuteUbergraph_BP_UIConfiguration::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");

// Function BP_UIConfiguration.BP_UIConfiguration_C.OnLoaded_1714D7E14A13D709135C79896AF74639
// 0x0008 (0x0008 - 0x0000)
struct BP_UIConfiguration_C_OnLoaded_1714D7E14A13D709135C79896AF74639 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIConfiguration_C_OnLoaded_1714D7E14A13D709135C79896AF74639) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_OnLoaded_1714D7E14A13D709135C79896AF74639");
static_assert(sizeof(BP_UIConfiguration_C_OnLoaded_1714D7E14A13D709135C79896AF74639) == 0x000008, "Wrong size on BP_UIConfiguration_C_OnLoaded_1714D7E14A13D709135C79896AF74639");
static_assert(offsetof(BP_UIConfiguration_C_OnLoaded_1714D7E14A13D709135C79896AF74639, Loaded) == 0x000000, "Member 'BP_UIConfiguration_C_OnLoaded_1714D7E14A13D709135C79896AF74639::Loaded' has a wrong offset!");

// Function BP_UIConfiguration.BP_UIConfiguration_C.OnLoaded_489A017D4C77D04BA5A71DBB57B9E315
// 0x0008 (0x0008 - 0x0000)
struct BP_UIConfiguration_C_OnLoaded_489A017D4C77D04BA5A71DBB57B9E315 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIConfiguration_C_OnLoaded_489A017D4C77D04BA5A71DBB57B9E315) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_OnLoaded_489A017D4C77D04BA5A71DBB57B9E315");
static_assert(sizeof(BP_UIConfiguration_C_OnLoaded_489A017D4C77D04BA5A71DBB57B9E315) == 0x000008, "Wrong size on BP_UIConfiguration_C_OnLoaded_489A017D4C77D04BA5A71DBB57B9E315");
static_assert(offsetof(BP_UIConfiguration_C_OnLoaded_489A017D4C77D04BA5A71DBB57B9E315, Loaded) == 0x000000, "Member 'BP_UIConfiguration_C_OnLoaded_489A017D4C77D04BA5A71DBB57B9E315::Loaded' has a wrong offset!");

// Function BP_UIConfiguration.BP_UIConfiguration_C.OnLoaded_3ECDA16B4C5006283D90FE9611CA505F
// 0x0008 (0x0008 - 0x0000)
struct BP_UIConfiguration_C_OnLoaded_3ECDA16B4C5006283D90FE9611CA505F final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIConfiguration_C_OnLoaded_3ECDA16B4C5006283D90FE9611CA505F) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_OnLoaded_3ECDA16B4C5006283D90FE9611CA505F");
static_assert(sizeof(BP_UIConfiguration_C_OnLoaded_3ECDA16B4C5006283D90FE9611CA505F) == 0x000008, "Wrong size on BP_UIConfiguration_C_OnLoaded_3ECDA16B4C5006283D90FE9611CA505F");
static_assert(offsetof(BP_UIConfiguration_C_OnLoaded_3ECDA16B4C5006283D90FE9611CA505F, Loaded) == 0x000000, "Member 'BP_UIConfiguration_C_OnLoaded_3ECDA16B4C5006283D90FE9611CA505F::Loaded' has a wrong offset!");

// Function BP_UIConfiguration.BP_UIConfiguration_C.OnLoaded_694C5D9D446006DF320831B0397F4D17
// 0x0008 (0x0008 - 0x0000)
struct BP_UIConfiguration_C_OnLoaded_694C5D9D446006DF320831B0397F4D17 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIConfiguration_C_OnLoaded_694C5D9D446006DF320831B0397F4D17) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_OnLoaded_694C5D9D446006DF320831B0397F4D17");
static_assert(sizeof(BP_UIConfiguration_C_OnLoaded_694C5D9D446006DF320831B0397F4D17) == 0x000008, "Wrong size on BP_UIConfiguration_C_OnLoaded_694C5D9D446006DF320831B0397F4D17");
static_assert(offsetof(BP_UIConfiguration_C_OnLoaded_694C5D9D446006DF320831B0397F4D17, Loaded) == 0x000000, "Member 'BP_UIConfiguration_C_OnLoaded_694C5D9D446006DF320831B0397F4D17::Loaded' has a wrong offset!");

// Function BP_UIConfiguration.BP_UIConfiguration_C.OnLoaded_3E7A6270477F0CD7076FFF81AAEEA339
// 0x0008 (0x0008 - 0x0000)
struct BP_UIConfiguration_C_OnLoaded_3E7A6270477F0CD7076FFF81AAEEA339 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIConfiguration_C_OnLoaded_3E7A6270477F0CD7076FFF81AAEEA339) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_OnLoaded_3E7A6270477F0CD7076FFF81AAEEA339");
static_assert(sizeof(BP_UIConfiguration_C_OnLoaded_3E7A6270477F0CD7076FFF81AAEEA339) == 0x000008, "Wrong size on BP_UIConfiguration_C_OnLoaded_3E7A6270477F0CD7076FFF81AAEEA339");
static_assert(offsetof(BP_UIConfiguration_C_OnLoaded_3E7A6270477F0CD7076FFF81AAEEA339, Loaded) == 0x000000, "Member 'BP_UIConfiguration_C_OnLoaded_3E7A6270477F0CD7076FFF81AAEEA339::Loaded' has a wrong offset!");

// Function BP_UIConfiguration.BP_UIConfiguration_C.OnLoaded_4B6D24F74DB86C733E9F23827D16783C
// 0x0008 (0x0008 - 0x0000)
struct BP_UIConfiguration_C_OnLoaded_4B6D24F74DB86C733E9F23827D16783C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIConfiguration_C_OnLoaded_4B6D24F74DB86C733E9F23827D16783C) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_OnLoaded_4B6D24F74DB86C733E9F23827D16783C");
static_assert(sizeof(BP_UIConfiguration_C_OnLoaded_4B6D24F74DB86C733E9F23827D16783C) == 0x000008, "Wrong size on BP_UIConfiguration_C_OnLoaded_4B6D24F74DB86C733E9F23827D16783C");
static_assert(offsetof(BP_UIConfiguration_C_OnLoaded_4B6D24F74DB86C733E9F23827D16783C, Loaded) == 0x000000, "Member 'BP_UIConfiguration_C_OnLoaded_4B6D24F74DB86C733E9F23827D16783C::Loaded' has a wrong offset!");

// Function BP_UIConfiguration.BP_UIConfiguration_C.OnLoaded_B2842006413FBBBAA8AF718E759679B3
// 0x0008 (0x0008 - 0x0000)
struct BP_UIConfiguration_C_OnLoaded_B2842006413FBBBAA8AF718E759679B3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIConfiguration_C_OnLoaded_B2842006413FBBBAA8AF718E759679B3) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_OnLoaded_B2842006413FBBBAA8AF718E759679B3");
static_assert(sizeof(BP_UIConfiguration_C_OnLoaded_B2842006413FBBBAA8AF718E759679B3) == 0x000008, "Wrong size on BP_UIConfiguration_C_OnLoaded_B2842006413FBBBAA8AF718E759679B3");
static_assert(offsetof(BP_UIConfiguration_C_OnLoaded_B2842006413FBBBAA8AF718E759679B3, Loaded) == 0x000000, "Member 'BP_UIConfiguration_C_OnLoaded_B2842006413FBBBAA8AF718E759679B3::Loaded' has a wrong offset!");

// Function BP_UIConfiguration.BP_UIConfiguration_C.OnLoaded_6A26AE0D4DA7295D0598C8B5D7E7AE29
// 0x0008 (0x0008 - 0x0000)
struct BP_UIConfiguration_C_OnLoaded_6A26AE0D4DA7295D0598C8B5D7E7AE29 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIConfiguration_C_OnLoaded_6A26AE0D4DA7295D0598C8B5D7E7AE29) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_OnLoaded_6A26AE0D4DA7295D0598C8B5D7E7AE29");
static_assert(sizeof(BP_UIConfiguration_C_OnLoaded_6A26AE0D4DA7295D0598C8B5D7E7AE29) == 0x000008, "Wrong size on BP_UIConfiguration_C_OnLoaded_6A26AE0D4DA7295D0598C8B5D7E7AE29");
static_assert(offsetof(BP_UIConfiguration_C_OnLoaded_6A26AE0D4DA7295D0598C8B5D7E7AE29, Loaded) == 0x000000, "Member 'BP_UIConfiguration_C_OnLoaded_6A26AE0D4DA7295D0598C8B5D7E7AE29::Loaded' has a wrong offset!");

// Function BP_UIConfiguration.BP_UIConfiguration_C.OnLoaded_C6F299164BCA72934F0F218FF612AEDE
// 0x0008 (0x0008 - 0x0000)
struct BP_UIConfiguration_C_OnLoaded_C6F299164BCA72934F0F218FF612AEDE final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIConfiguration_C_OnLoaded_C6F299164BCA72934F0F218FF612AEDE) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_OnLoaded_C6F299164BCA72934F0F218FF612AEDE");
static_assert(sizeof(BP_UIConfiguration_C_OnLoaded_C6F299164BCA72934F0F218FF612AEDE) == 0x000008, "Wrong size on BP_UIConfiguration_C_OnLoaded_C6F299164BCA72934F0F218FF612AEDE");
static_assert(offsetof(BP_UIConfiguration_C_OnLoaded_C6F299164BCA72934F0F218FF612AEDE, Loaded) == 0x000000, "Member 'BP_UIConfiguration_C_OnLoaded_C6F299164BCA72934F0F218FF612AEDE::Loaded' has a wrong offset!");

// Function BP_UIConfiguration.BP_UIConfiguration_C.StateDraw_Update
// 0x0020 (0x0020 - 0x0000)
struct BP_UIConfiguration_C_StateDraw_Update final
{
public:
	float                                         DeltaTime_0;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_BPUICommand_GetRenderTarget_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ConvFrameToTime_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UIConfiguration_C_StateDraw_Update) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_StateDraw_Update");
static_assert(sizeof(BP_UIConfiguration_C_StateDraw_Update) == 0x000020, "Wrong size on BP_UIConfiguration_C_StateDraw_Update");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_Update, DeltaTime_0) == 0x000000, "Member 'BP_UIConfiguration_C_StateDraw_Update::DeltaTime_0' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_Update, ReturnValue) == 0x000004, "Member 'BP_UIConfiguration_C_StateDraw_Update::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_Update, CallFunc_BPUICommand_GetRenderTarget_ReturnValue) == 0x000008, "Member 'BP_UIConfiguration_C_StateDraw_Update::CallFunc_BPUICommand_GetRenderTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_Update, CallFunc_ConvFrameToTime_ReturnValue) == 0x000010, "Member 'BP_UIConfiguration_C_StateDraw_Update::CallFunc_ConvFrameToTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_Update, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_UIConfiguration_C_StateDraw_Update::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_Update, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_UIConfiguration_C_StateDraw_Update::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_UIConfiguration.BP_UIConfiguration_C.StateDraw_BG
// 0x0210 (0x0210 - 0x0000)
struct BP_UIConfiguration_C_StateDraw_BG final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CONFIGr;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 R_0r;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USprAsset*                              CallFunc_GetSprData_SprData;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USprAsset*                              CallFunc_GetSprData_SprData_1;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USprAsset*                              CallFunc_GetSprData_SprData_2;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USprAsset*                              CallFunc_GetSprData_SprData_3;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USprAsset*                              CallFunc_GetSprData_SprData_4;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_3;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_4;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBGMMode_ReturnValue;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBGMMode_ReturnValue_1;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_5;       // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_6;       // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_7;       // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_8;       // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_9;       // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetAlphaRateColor_outColor;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetAlphaRateColor_outColor_1;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetAlphaRateColor_outColor_2;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetAlphaRateColor_outColor_3;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetAlphaRateColor_outColor_4;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetAlphaRateColor_outColor_5;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBGMMode_ReturnValue_2;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetAdjustedHelpRootPosition_OutPosition;  // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAdjustedHelpRootPosition_ReturnValue;  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBGMMode_ReturnValue_3;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetAdjustedHelpBarOffset_OutPosition;     // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAdjustedHelpBarOffset_ReturnValue;     // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_10;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_11;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_12;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTitleOpend_ReturnValue;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTitleOpend_ReturnValue_1;               // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTitleOpend_ReturnValue_2;               // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_ColorPow_OutColor;                        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_ColorPow_OutColor_1;                      // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetAlphaRateColor_outColor_6;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTitleOpend_ReturnValue_3;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlgAsset*                              CallFunc_GetPlgData_outSprData;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_13;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_14;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_15;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_16;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_17;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_7;                        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_7;                        // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_8;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_8;                        // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBGMMode_ReturnValue_4;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_18;      // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_19;      // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_20;      // 0x0194(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_9;                        // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_9;                        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USprAsset*                              CallFunc_GetSprData_SprData_5;                     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_21;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_22;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlgAsset*                              CallFunc_GetPlgData_outSprData_1;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_10;                       // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_10;                       // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_23;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_ColorPow_OutColor_2;                      // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_24;      // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetAlphaRateColor_outColor_7;             // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_11;                       // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_11;                       // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlgAsset*                              CallFunc_GetPlgData_outSprData_2;                  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_25;      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_26;      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_12;                       // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_12;                       // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIConfiguration_C_StateDraw_BG) == 0x000008, "Wrong alignment on BP_UIConfiguration_C_StateDraw_BG");
static_assert(sizeof(BP_UIConfiguration_C_StateDraw_BG) == 0x000210, "Wrong size on BP_UIConfiguration_C_StateDraw_BG");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, ReturnValue) == 0x000000, "Member 'BP_UIConfiguration_C_StateDraw_BG::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CONFIGr) == 0x000004, "Member 'BP_UIConfiguration_C_StateDraw_BG::CONFIGr' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, R_0r) == 0x000008, "Member 'BP_UIConfiguration_C_StateDraw_BG::R_0r' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_GetSprData_SprData) == 0x000010, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_GetSprData_SprData' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_GetSprData_SprData_1) == 0x000018, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_GetSprData_SprData_1' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000020, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x000028, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_GetSprData_SprData_2) == 0x000030, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_GetSprData_SprData_2' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_GetSprData_SprData_3) == 0x000038, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_GetSprData_SprData_3' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_Add_Vector2DVector2D_ReturnValue_2) == 0x000040, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_Add_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_GetSprData_SprData_4) == 0x000048, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_GetSprData_SprData_4' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_Add_Vector2DVector2D_ReturnValue_3) == 0x000050, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_Add_Vector2DVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_Add_Vector2DVector2D_ReturnValue_4) == 0x000058, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_Add_Vector2DVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_IsBGMMode_ReturnValue) == 0x000060, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_IsBGMMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_IsBGMMode_ReturnValue_1) == 0x000061, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_IsBGMMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_SelectInt_ReturnValue) == 0x000064, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIConfiguration_C_StateDraw_BG, CallFunc_SelectInt_ReturnValue_1) == 0x000068, "Member 'BP_UIConfiguration_C_StateDraw_BG::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
