#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_Handwriting_Mumble_00

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_UI_Handwriting_Mumble_00.BP_UI_Handwriting_Mumble_00_C.ExecuteUbergraph_BP_UI_Handwriting_Mumble_00
// 0x00C8 (0x00C8 - 0x0000)
struct BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHandwritingSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAdjustedAllLayoutData_OutPosition;     // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAdjustedAllLayoutData_OutAngle;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAdjustedAllLayoutData_OutScale;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAdjustedAllLayoutData_OutSize;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAdjustedAllLayoutData_ReturnValue;     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHandwritingSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAdjustedAllLayoutData_OutPosition_1;   // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAdjustedAllLayoutData_OutAngle_1;      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAdjustedAllLayoutData_OutScale_1;      // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAdjustedAllLayoutData_OutSize_1;       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAdjustedAllLayoutData_ReturnValue_1;   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHandwritingSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAdjustedAllLayoutData_OutPosition_2;   // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAdjustedAllLayoutData_OutAngle_2;      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAdjustedAllLayoutData_OutScale_2;      // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAdjustedAllLayoutData_OutSize_2;       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAdjustedAllLayoutData_ReturnValue_2;   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHandwritingSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAdjustedAllLayoutData_OutPosition_3;   // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAdjustedAllLayoutData_OutAngle_3;      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAdjustedAllLayoutData_OutScale_3;      // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAdjustedAllLayoutData_OutSize_3;       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAdjustedAllLayoutData_ReturnValue_3;   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00) == 0x000008, "Wrong alignment on BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00");
static_assert(sizeof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00) == 0x0000C8, "Wrong size on BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, EntryPoint) == 0x000000, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutPosition) == 0x000010, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutPosition' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutAngle) == 0x00001C, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutAngle' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutScale) == 0x000020, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutScale' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutSize) == 0x00002C, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutSize' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_ReturnValue) == 0x000030, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutPosition_1) == 0x000040, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutPosition_1' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutAngle_1) == 0x00004C, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutAngle_1' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutScale_1) == 0x000050, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutScale_1' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutSize_1) == 0x00005C, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutSize_1' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_ReturnValue_1) == 0x000060, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000068, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutPosition_2) == 0x000070, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutPosition_2' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutAngle_2) == 0x00007C, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutAngle_2' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutScale_2) == 0x000080, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutScale_2' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutSize_2) == 0x00008C, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutSize_2' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_ReturnValue_2) == 0x000090, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, K2Node_Event_DeltaSeconds) == 0x000094, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000098, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutPosition_3) == 0x0000A0, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutPosition_3' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutAngle_3) == 0x0000AC, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutAngle_3' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutScale_3) == 0x0000B0, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutScale_3' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_OutSize_3) == 0x0000BC, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_OutSize_3' has a wrong offset!");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00, CallFunc_GetAdjustedAllLayoutData_ReturnValue_3) == 0x0000C0, "Member 'BP_UI_Handwriting_Mumble_00_C_ExecuteUbergraph_BP_UI_Handwriting_Mumble_00::CallFunc_GetAdjustedAllLayoutData_ReturnValue_3' has a wrong offset!");

// Function BP_UI_Handwriting_Mumble_00.BP_UI_Handwriting_Mumble_00_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_UI_Handwriting_Mumble_00_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_Handwriting_Mumble_00_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_UI_Handwriting_Mumble_00_C_ReceiveTick");
static_assert(sizeof(BP_UI_Handwriting_Mumble_00_C_ReceiveTick) == 0x000004, "Wrong size on BP_UI_Handwriting_Mumble_00_C_ReceiveTick");
static_assert(offsetof(BP_UI_Handwriting_Mumble_00_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_UI_Handwriting_Mumble_00_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

