#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_Battle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Xrd777_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPFL_Battle.BPFL_Battle_C.MakeCylinder
// 0x01E0 (0x01E0 - 0x0000)
struct BPFL_Battle_C_MakeCylinder final
{
public:
	TArray<class ABtlActor*>                      Targets;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          UseCommonCylinder;                                 // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ModeSizeWeightingCylinder;                         // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Bottom_Center;                                     // 0x0020(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDefault;                                        // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LowestZ;                                           // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalHeight;                                       // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHeight;                                         // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxLength;                                         // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVec;                                          // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Center;                                            // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABtlActor*>                      TargetList;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_BtlCharacterBase_C*                 Chara;                                             // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalcCylinderCenter_CylinderCenter;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcCylinderCenter_SizeWeightingCenter;   // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCylinderCommon_CenterBottom;           // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCylinderCommon_Radius;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCylinderCommon_Height;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCylinderCommon_CenterCylinder;         // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCylinderCommon_LocalCylinderLocation;  // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCylinderCommon_CenterBottom_1;         // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCylinderCommon_Radius_1;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCylinderCommon_Height_1;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCylinderCommon_CenterCylinder_1;       // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCylinderCommon_LocalCylinderLocation_1; // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCylinderCommon_CenterBottom_2;         // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCylinderCommon_Radius_2;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCylinderCommon_Height_2;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCylinderCommon_CenterCylinder_2;       // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCylinderCommon_LocalCylinderLocation_2; // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCylinderCommon_CenterBottom_3;         // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCylinderCommon_Radius_3;               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCylinderCommon_Height_3;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCylinderCommon_CenterCylinder_3;       // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCylinderCommon_LocalCylinderLocation_3; // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              CallFunc_Array_Get_Item;                           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BtlCharacterBase_C*                 K2Node_DynamicCast_AsBP_Btl_Character_Base;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Battle_C_MakeCylinder) == 0x000008, "Wrong alignment on BPFL_Battle_C_MakeCylinder");
static_assert(sizeof(BPFL_Battle_C_MakeCylinder) == 0x0001E0, "Wrong size on BPFL_Battle_C_MakeCylinder");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, Targets) == 0x000000, "Member 'BPFL_Battle_C_MakeCylinder::Targets' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, UseCommonCylinder) == 0x000010, "Member 'BPFL_Battle_C_MakeCylinder::UseCommonCylinder' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, ModeSizeWeightingCylinder) == 0x000011, "Member 'BPFL_Battle_C_MakeCylinder::ModeSizeWeightingCylinder' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, __WorldContext) == 0x000018, "Member 'BPFL_Battle_C_MakeCylinder::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, Bottom_Center) == 0x000020, "Member 'BPFL_Battle_C_MakeCylinder::Bottom_Center' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, Radius) == 0x00002C, "Member 'BPFL_Battle_C_MakeCylinder::Radius' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, Height) == 0x000030, "Member 'BPFL_Battle_C_MakeCylinder::Height' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, UseDefault) == 0x000034, "Member 'BPFL_Battle_C_MakeCylinder::UseDefault' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, LowestZ) == 0x000038, "Member 'BPFL_Battle_C_MakeCylinder::LowestZ' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, LocalHeight) == 0x00003C, "Member 'BPFL_Battle_C_MakeCylinder::LocalHeight' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, MaxHeight) == 0x000040, "Member 'BPFL_Battle_C_MakeCylinder::MaxHeight' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, MaxLength) == 0x000044, "Member 'BPFL_Battle_C_MakeCylinder::MaxLength' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, LocalVec) == 0x000048, "Member 'BPFL_Battle_C_MakeCylinder::LocalVec' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, Center) == 0x000054, "Member 'BPFL_Battle_C_MakeCylinder::Center' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, TargetList) == 0x000060, "Member 'BPFL_Battle_C_MakeCylinder::TargetList' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, Chara) == 0x000070, "Member 'BPFL_Battle_C_MakeCylinder::Chara' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, Temp_int_Array_Index_Variable) == 0x000078, "Member 'BPFL_Battle_C_MakeCylinder::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00007C, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_CalcCylinderCenter_CylinderCenter) == 0x000080, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_CalcCylinderCenter_CylinderCenter' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_CalcCylinderCenter_SizeWeightingCenter) == 0x00008C, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_CalcCylinderCenter_SizeWeightingCenter' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_X) == 0x000098, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_Y) == 0x00009C, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_Z) == 0x0000A0, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A4, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Greater_IntInt_ReturnValue) == 0x0000AC, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_CenterBottom) == 0x0000B0, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_CenterBottom' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_Radius) == 0x0000BC, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_Radius' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_Height) == 0x0000C0, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_Height' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_CenterCylinder) == 0x0000C4, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_CenterCylinder' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_LocalCylinderLocation) == 0x0000D0, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_LocalCylinderLocation' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_X_1) == 0x0000DC, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_Y_1) == 0x0000E0, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_Z_1) == 0x0000E4, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_X_2) == 0x0000E8, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_Y_2) == 0x0000EC, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_Z_2) == 0x0000F0, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_MakeVector_ReturnValue) == 0x0000F4, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_FMin_ReturnValue) == 0x000100, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Less_FloatFloat_ReturnValue) == 0x000104, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_CenterBottom_1) == 0x000108, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_CenterBottom_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_Radius_1) == 0x000114, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_Radius_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_Height_1) == 0x000118, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_Height_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_CenterCylinder_1) == 0x00011C, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_CenterCylinder_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_LocalCylinderLocation_1) == 0x000128, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_LocalCylinderLocation_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_X_3) == 0x000134, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_Y_3) == 0x000138, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_BreakVector_Z_3) == 0x00013C, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Add_FloatFloat_ReturnValue) == 0x000140, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_CenterBottom_2) == 0x000144, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_CenterBottom_2' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_Radius_2) == 0x000150, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_Radius_2' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_Height_2) == 0x000154, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_Height_2' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_CenterCylinder_2) == 0x000158, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_CenterCylinder_2' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_LocalCylinderLocation_2) == 0x000164, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_LocalCylinderLocation_2' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_VSize_ReturnValue) == 0x000170, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000174, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000178, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000184, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_CenterBottom_3) == 0x000188, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_CenterBottom_3' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_Radius_3) == 0x000194, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_Radius_3' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_Height_3) == 0x000198, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_Height_3' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_CenterCylinder_3) == 0x00019C, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_CenterCylinder_3' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_GetCylinderCommon_LocalCylinderLocation_3) == 0x0001A8, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_GetCylinderCommon_LocalCylinderLocation_3' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Array_Get_Item) == 0x0001B8, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Array_Length_ReturnValue_1) == 0x0001C0, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, K2Node_DynamicCast_AsBP_Btl_Character_Base) == 0x0001C8, "Member 'BPFL_Battle_C_MakeCylinder::K2Node_DynamicCast_AsBP_Btl_Character_Base' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'BPFL_Battle_C_MakeCylinder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, Temp_int_Loop_Counter_Variable) == 0x0001D4, "Member 'BPFL_Battle_C_MakeCylinder::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Less_IntInt_ReturnValue) == 0x0001D8, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_MakeCylinder, CallFunc_Add_IntInt_ReturnValue) == 0x0001DC, "Member 'BPFL_Battle_C_MakeCylinder::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_Battle.BPFL_Battle_C.GetInitialTransform
// 0x0070 (0x0070 - 0x0000)
struct BPFL_Battle_C_GetInitialTransform final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Trans;                                             // 0x0010(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_Battle_C_GetInitialTransform) == 0x000010, "Wrong alignment on BPFL_Battle_C_GetInitialTransform");
static_assert(sizeof(BPFL_Battle_C_GetInitialTransform) == 0x000070, "Wrong size on BPFL_Battle_C_GetInitialTransform");
static_assert(offsetof(BPFL_Battle_C_GetInitialTransform, __WorldContext) == 0x000000, "Member 'BPFL_Battle_C_GetInitialTransform::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_GetInitialTransform, Trans) == 0x000010, "Member 'BPFL_Battle_C_GetInitialTransform::Trans' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_GetInitialTransform, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BPFL_Battle_C_GetInitialTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function BPFL_Battle.BPFL_Battle_C.AddInt
// 0x0018 (0x0018 - 0x0000)
struct BPFL_Battle_C_AddInt final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Add_Value;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Battle_C_AddInt) == 0x000008, "Wrong alignment on BPFL_Battle_C_AddInt");
static_assert(sizeof(BPFL_Battle_C_AddInt) == 0x000018, "Wrong size on BPFL_Battle_C_AddInt");
static_assert(offsetof(BPFL_Battle_C_AddInt, Value) == 0x000000, "Member 'BPFL_Battle_C_AddInt::Value' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_AddInt, Add_Value) == 0x000004, "Member 'BPFL_Battle_C_AddInt::Add_Value' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_AddInt, __WorldContext) == 0x000008, "Member 'BPFL_Battle_C_AddInt::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_AddInt, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BPFL_Battle_C_AddInt::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_Battle.BPFL_Battle_C.AddFloat
// 0x0018 (0x0018 - 0x0000)
struct BPFL_Battle_C_AddFloat final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AddValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Battle_C_AddFloat) == 0x000008, "Wrong alignment on BPFL_Battle_C_AddFloat");
static_assert(sizeof(BPFL_Battle_C_AddFloat) == 0x000018, "Wrong size on BPFL_Battle_C_AddFloat");
static_assert(offsetof(BPFL_Battle_C_AddFloat, Value) == 0x000000, "Member 'BPFL_Battle_C_AddFloat::Value' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_AddFloat, AddValue) == 0x000004, "Member 'BPFL_Battle_C_AddFloat::AddValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_AddFloat, __WorldContext) == 0x000008, "Member 'BPFL_Battle_C_AddFloat::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_AddFloat, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'BPFL_Battle_C_AddFloat::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BPFL_Battle.BPFL_Battle_C.Conv Vec to CSV string
// 0x0070 (0x0070 - 0x0000)
struct BPFL_Battle_C_Conv_Vec_to_CSV_string final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 String;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 String_Buffer;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_ReplaceInline_ReturnValue;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Battle_C_Conv_Vec_to_CSV_string) == 0x000008, "Wrong alignment on BPFL_Battle_C_Conv_Vec_to_CSV_string");
static_assert(sizeof(BPFL_Battle_C_Conv_Vec_to_CSV_string) == 0x000070, "Wrong size on BPFL_Battle_C_Conv_Vec_to_CSV_string");
static_assert(offsetof(BPFL_Battle_C_Conv_Vec_to_CSV_string, Location) == 0x000000, "Member 'BPFL_Battle_C_Conv_Vec_to_CSV_string::Location' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Conv_Vec_to_CSV_string, __WorldContext) == 0x000010, "Member 'BPFL_Battle_C_Conv_Vec_to_CSV_string::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Conv_Vec_to_CSV_string, String) == 0x000018, "Member 'BPFL_Battle_C_Conv_Vec_to_CSV_string::String' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Conv_Vec_to_CSV_string, String_Buffer) == 0x000028, "Member 'BPFL_Battle_C_Conv_Vec_to_CSV_string::String_Buffer' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Conv_Vec_to_CSV_string, CallFunc_Conv_VectorToString_ReturnValue) == 0x000038, "Member 'BPFL_Battle_C_Conv_Vec_to_CSV_string::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Conv_Vec_to_CSV_string, CallFunc_ReplaceInline_ReturnValue) == 0x000048, "Member 'BPFL_Battle_C_Conv_Vec_to_CSV_string::CallFunc_ReplaceInline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Conv_Vec_to_CSV_string, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BPFL_Battle_C_Conv_Vec_to_CSV_string::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Conv_Vec_to_CSV_string, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'BPFL_Battle_C_Conv_Vec_to_CSV_string::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function BPFL_Battle.BPFL_Battle_C.Battle Print Error String
// 0x0050 (0x0050 - 0x0000)
struct BPFL_Battle_C_Battle_Print_Error_String final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebug_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Battle_C_Battle_Print_Error_String) == 0x000008, "Wrong alignment on BPFL_Battle_C_Battle_Print_Error_String");
static_assert(sizeof(BPFL_Battle_C_Battle_Print_Error_String) == 0x000050, "Wrong size on BPFL_Battle_C_Battle_Print_Error_String");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Error_String, String) == 0x000000, "Member 'BPFL_Battle_C_Battle_Print_Error_String::String' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Error_String, __WorldContext) == 0x000010, "Member 'BPFL_Battle_C_Battle_Print_Error_String::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Error_String, CallFunc_IsDebug_ReturnValue) == 0x000018, "Member 'BPFL_Battle_C_Battle_Print_Error_String::CallFunc_IsDebug_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Error_String, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BPFL_Battle_C_Battle_Print_Error_String::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Error_String, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'BPFL_Battle_C_Battle_Print_Error_String::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Error_String, K2Node_MakeStruct_LinearColor) == 0x000040, "Member 'BPFL_Battle_C_Battle_Print_Error_String::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function BPFL_Battle.BPFL_Battle_C.Battle Print Warning String
// 0x0050 (0x0050 - 0x0000)
struct BPFL_Battle_C_Battle_Print_Warning_String final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebug_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Battle_C_Battle_Print_Warning_String) == 0x000008, "Wrong alignment on BPFL_Battle_C_Battle_Print_Warning_String");
static_assert(sizeof(BPFL_Battle_C_Battle_Print_Warning_String) == 0x000050, "Wrong size on BPFL_Battle_C_Battle_Print_Warning_String");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Warning_String, String) == 0x000000, "Member 'BPFL_Battle_C_Battle_Print_Warning_String::String' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Warning_String, __WorldContext) == 0x000010, "Member 'BPFL_Battle_C_Battle_Print_Warning_String::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Warning_String, CallFunc_IsDebug_ReturnValue) == 0x000018, "Member 'BPFL_Battle_C_Battle_Print_Warning_String::CallFunc_IsDebug_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Warning_String, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BPFL_Battle_C_Battle_Print_Warning_String::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Warning_String, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'BPFL_Battle_C_Battle_Print_Warning_String::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Warning_String, K2Node_MakeStruct_LinearColor) == 0x000040, "Member 'BPFL_Battle_C_Battle_Print_Warning_String::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function BPFL_Battle.BPFL_Battle_C.Battle Print Note String
// 0x0050 (0x0050 - 0x0000)
struct BPFL_Battle_C_Battle_Print_Note_String final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebug_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Battle_C_Battle_Print_Note_String) == 0x000008, "Wrong alignment on BPFL_Battle_C_Battle_Print_Note_String");
static_assert(sizeof(BPFL_Battle_C_Battle_Print_Note_String) == 0x000050, "Wrong size on BPFL_Battle_C_Battle_Print_Note_String");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Note_String, String) == 0x000000, "Member 'BPFL_Battle_C_Battle_Print_Note_String::String' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Note_String, __WorldContext) == 0x000010, "Member 'BPFL_Battle_C_Battle_Print_Note_String::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Note_String, CallFunc_IsDebug_ReturnValue) == 0x000018, "Member 'BPFL_Battle_C_Battle_Print_Note_String::CallFunc_IsDebug_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Note_String, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BPFL_Battle_C_Battle_Print_Note_String::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Note_String, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'BPFL_Battle_C_Battle_Print_Note_String::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Note_String, K2Node_MakeStruct_LinearColor) == 0x000040, "Member 'BPFL_Battle_C_Battle_Print_Note_String::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function BPFL_Battle.BPFL_Battle_C.CalculateCylinderLocation
// 0x0088 (0x0088 - 0x0000)
struct BPFL_Battle_C_CalculateCylinderLocation final
{
public:
	TArray<class ABP_BtlCharacterBase_C*>         Character_List;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Radius_Ratio;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height_Ratio;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotate_Degree;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Common_Cylinder;                               // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Work;                                              // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Len;                                               // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeCylinder_Bottom_Center;               // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeCylinder_Radius;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeCylinder_Height;                      // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Battle_C_CalculateCylinderLocation) == 0x000008, "Wrong alignment on BPFL_Battle_C_CalculateCylinderLocation");
static_assert(sizeof(BPFL_Battle_C_CalculateCylinderLocation) == 0x000088, "Wrong size on BPFL_Battle_C_CalculateCylinderLocation");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, Character_List) == 0x000000, "Member 'BPFL_Battle_C_CalculateCylinderLocation::Character_List' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, Radius_Ratio) == 0x000010, "Member 'BPFL_Battle_C_CalculateCylinderLocation::Radius_Ratio' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, Height_Ratio) == 0x000014, "Member 'BPFL_Battle_C_CalculateCylinderLocation::Height_Ratio' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, Rotate_Degree) == 0x000018, "Member 'BPFL_Battle_C_CalculateCylinderLocation::Rotate_Degree' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, Use_Common_Cylinder) == 0x00001C, "Member 'BPFL_Battle_C_CalculateCylinderLocation::Use_Common_Cylinder' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, __WorldContext) == 0x000020, "Member 'BPFL_Battle_C_CalculateCylinderLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, Location) == 0x000028, "Member 'BPFL_Battle_C_CalculateCylinderLocation::Location' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, Work) == 0x000034, "Member 'BPFL_Battle_C_CalculateCylinderLocation::Work' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, Len) == 0x000040, "Member 'BPFL_Battle_C_CalculateCylinderLocation::Len' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, CallFunc_MakeCylinder_Bottom_Center) == 0x000044, "Member 'BPFL_Battle_C_CalculateCylinderLocation::CallFunc_MakeCylinder_Bottom_Center' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, CallFunc_MakeCylinder_Radius) == 0x000050, "Member 'BPFL_Battle_C_CalculateCylinderLocation::CallFunc_MakeCylinder_Radius' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, CallFunc_MakeCylinder_Height) == 0x000054, "Member 'BPFL_Battle_C_CalculateCylinderLocation::CallFunc_MakeCylinder_Height' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, CallFunc_DegCos_ReturnValue) == 0x000058, "Member 'BPFL_Battle_C_CalculateCylinderLocation::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00005C, "Member 'BPFL_Battle_C_CalculateCylinderLocation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000060, "Member 'BPFL_Battle_C_CalculateCylinderLocation::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000064, "Member 'BPFL_Battle_C_CalculateCylinderLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, CallFunc_DegSin_ReturnValue) == 0x000070, "Member 'BPFL_Battle_C_CalculateCylinderLocation::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000074, "Member 'BPFL_Battle_C_CalculateCylinderLocation::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000078, "Member 'BPFL_Battle_C_CalculateCylinderLocation::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalculateCylinderLocation, CallFunc_MakeVector_ReturnValue) == 0x00007C, "Member 'BPFL_Battle_C_CalculateCylinderLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BPFL_Battle.BPFL_Battle_C.CalcLoopIndex
// 0x0020 (0x0020 - 0x0000)
struct BPFL_Battle_C_CalcLoopIndex final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopIndex;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Battle_C_CalcLoopIndex) == 0x000008, "Wrong alignment on BPFL_Battle_C_CalcLoopIndex");
static_assert(sizeof(BPFL_Battle_C_CalcLoopIndex) == 0x000020, "Wrong size on BPFL_Battle_C_CalcLoopIndex");
static_assert(offsetof(BPFL_Battle_C_CalcLoopIndex, Value) == 0x000000, "Member 'BPFL_Battle_C_CalcLoopIndex::Value' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalcLoopIndex, Max) == 0x000004, "Member 'BPFL_Battle_C_CalcLoopIndex::Max' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalcLoopIndex, __WorldContext) == 0x000008, "Member 'BPFL_Battle_C_CalcLoopIndex::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalcLoopIndex, LoopIndex) == 0x000010, "Member 'BPFL_Battle_C_CalcLoopIndex::LoopIndex' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalcLoopIndex, CallFunc_Divide_IntInt_ReturnValue) == 0x000014, "Member 'BPFL_Battle_C_CalcLoopIndex::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalcLoopIndex, CallFunc_Multiply_IntInt_ReturnValue) == 0x000018, "Member 'BPFL_Battle_C_CalcLoopIndex::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_CalcLoopIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'BPFL_Battle_C_CalcLoopIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BPFL_Battle.BPFL_Battle_C.Battle Print Log
// 0x0030 (0x0030 - 0x0000)
struct BPFL_Battle_C_Battle_Print_Log final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebug_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Battle_C_Battle_Print_Log) == 0x000008, "Wrong alignment on BPFL_Battle_C_Battle_Print_Log");
static_assert(sizeof(BPFL_Battle_C_Battle_Print_Log) == 0x000030, "Wrong size on BPFL_Battle_C_Battle_Print_Log");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Log, String) == 0x000000, "Member 'BPFL_Battle_C_Battle_Print_Log::String' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Log, __WorldContext) == 0x000010, "Member 'BPFL_Battle_C_Battle_Print_Log::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Log, CallFunc_IsDebug_ReturnValue) == 0x000018, "Member 'BPFL_Battle_C_Battle_Print_Log::CallFunc_IsDebug_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Battle_C_Battle_Print_Log, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BPFL_Battle_C_Battle_Print_Log::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BPFL_Battle.BPFL_Battle_C.BtlFindLookAtRotationFlat
// 0x0120 (0x0120 - 0x0000)
struct BPFL_Battle_C_BtlFindLookAtRotationFlat final
{
public:
	class ABP_BtlCharacterBase_C*                 Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
