#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Get_PC0001_Variables

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Get_PC0001_Variables.BPI_Get_PC0001_Variables_C.Is_EventPlayAndHaveBag
// 0x0001 (0x0001 - 0x0000)
struct BPI_Get_PC0001_Variables_C_Is_EventPlayAndHaveBag final
{
public:
	bool                                          Out_Result;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_Get_PC0001_Variables_C_Is_EventPlayAndHaveBag) == 0x000001, "Wrong alignment on BPI_Get_PC0001_Variables_C_Is_EventPlayAndHaveBag");
static_assert(sizeof(BPI_Get_PC0001_Variables_C_Is_EventPlayAndHaveBag) == 0x000001, "Wrong size on BPI_Get_PC0001_Variables_C_Is_EventPlayAndHaveBag");
static_assert(offsetof(BPI_Get_PC0001_Variables_C_Is_EventPlayAndHaveBag, Out_Result) == 0x000000, "Member 'BPI_Get_PC0001_Variables_C_Is_EventPlayAndHaveBag::Out_Result' has a wrong offset!");

// Function BPI_Get_PC0001_Variables.BPI_Get_PC0001_Variables_C.Get_ForceAttachPocket
// 0x0001 (0x0001 - 0x0000)
struct BPI_Get_PC0001_Variables_C_Get_ForceAttachPocket final
{
public:
	bool                                          Out_ForceAttachPocket;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_Get_PC0001_Variables_C_Get_ForceAttachPocket) == 0x000001, "Wrong alignment on BPI_Get_PC0001_Variables_C_Get_ForceAttachPocket");
static_assert(sizeof(BPI_Get_PC0001_Variables_C_Get_ForceAttachPocket) == 0x000001, "Wrong size on BPI_Get_PC0001_Variables_C_Get_ForceAttachPocket");
static_assert(offsetof(BPI_Get_PC0001_Variables_C_Get_ForceAttachPocket, Out_ForceAttachPocket) == 0x000000, "Member 'BPI_Get_PC0001_Variables_C_Get_ForceAttachPocket::Out_ForceAttachPocket' has a wrong offset!");

// Function BPI_Get_PC0001_Variables.BPI_Get_PC0001_Variables_C.Get_IsAttachedBostonBag
// 0x0001 (0x0001 - 0x0000)
struct BPI_Get_PC0001_Variables_C_Get_IsAttachedBostonBag final
{
public:
	bool                                          Out_IsAttachedBostonBag;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_Get_PC0001_Variables_C_Get_IsAttachedBostonBag) == 0x000001, "Wrong alignment on BPI_Get_PC0001_Variables_C_Get_IsAttachedBostonBag");
static_assert(sizeof(BPI_Get_PC0001_Variables_C_Get_IsAttachedBostonBag) == 0x000001, "Wrong size on BPI_Get_PC0001_Variables_C_Get_IsAttachedBostonBag");
static_assert(offsetof(BPI_Get_PC0001_Variables_C_Get_IsAttachedBostonBag, Out_IsAttachedBostonBag) == 0x000000, "Member 'BPI_Get_PC0001_Variables_C_Get_IsAttachedBostonBag::Out_IsAttachedBostonBag' has a wrong offset!");

// Function BPI_Get_PC0001_Variables.BPI_Get_PC0001_Variables_C.Get_NotUpdateAttachPocket
// 0x0001 (0x0001 - 0x0000)
struct BPI_Get_PC0001_Variables_C_Get_NotUpdateAttachPocket final
{
public:
	bool                                          Out_NotUpdateEnableAttachPocket;                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_Get_PC0001_Variables_C_Get_NotUpdateAttachPocket) == 0x000001, "Wrong alignment on BPI_Get_PC0001_Variables_C_Get_NotUpdateAttachPocket");
static_assert(sizeof(BPI_Get_PC0001_Variables_C_Get_NotUpdateAttachPocket) == 0x000001, "Wrong size on BPI_Get_PC0001_Variables_C_Get_NotUpdateAttachPocket");
static_assert(offsetof(BPI_Get_PC0001_Variables_C_Get_NotUpdateAttachPocket, Out_NotUpdateEnableAttachPocket) == 0x000000, "Member 'BPI_Get_PC0001_Variables_C_Get_NotUpdateAttachPocket::Out_NotUpdateEnableAttachPocket' has a wrong offset!");

// Function BPI_Get_PC0001_Variables.BPI_Get_PC0001_Variables_C.Get_AttachPocketAlpha
// 0x0008 (0x0008 - 0x0000)
struct BPI_Get_PC0001_Variables_C_Get_AttachPocketAlpha final
{
public:
	float                                         Out_AttachPocket_L_Alpha;                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Out_AttachPocket_R_Alpha;                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Get_PC0001_Variables_C_Get_AttachPocketAlpha) == 0x000004, "Wrong alignment on BPI_Get_PC0001_Variables_C_Get_AttachPocketAlpha");
static_assert(sizeof(BPI_Get_PC0001_Variables_C_Get_AttachPocketAlpha) == 0x000008, "Wrong size on BPI_Get_PC0001_Variables_C_Get_AttachPocketAlpha");
static_assert(offsetof(BPI_Get_PC0001_Variables_C_Get_AttachPocketAlpha, Out_AttachPocket_L_Alpha) == 0x000000, "Member 'BPI_Get_PC0001_Variables_C_Get_AttachPocketAlpha::Out_AttachPocket_L_Alpha' has a wrong offset!");
static_assert(offsetof(BPI_Get_PC0001_Variables_C_Get_AttachPocketAlpha, Out_AttachPocket_R_Alpha) == 0x000004, "Member 'BPI_Get_PC0001_Variables_C_Get_AttachPocketAlpha::Out_AttachPocket_R_Alpha' has a wrong offset!");

}

