#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_ModulerCharacterSet

#include "Basic.hpp"

#include "Enum_LocomotionState_structs.hpp"


namespace SDK::Params
{

// Function BPI_ModulerCharacterSet.BPI_ModulerCharacterSet_C.SetSinkingDistance
// 0x0004 (0x0004 - 0x0000)
struct BPI_ModulerCharacterSet_C_SetSinkingDistance final
{
public:
	float                                         SinkingDistance;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ModulerCharacterSet_C_SetSinkingDistance) == 0x000004, "Wrong alignment on BPI_ModulerCharacterSet_C_SetSinkingDistance");
static_assert(sizeof(BPI_ModulerCharacterSet_C_SetSinkingDistance) == 0x000004, "Wrong size on BPI_ModulerCharacterSet_C_SetSinkingDistance");
static_assert(offsetof(BPI_ModulerCharacterSet_C_SetSinkingDistance, SinkingDistance) == 0x000000, "Member 'BPI_ModulerCharacterSet_C_SetSinkingDistance::SinkingDistance' has a wrong offset!");

// Function BPI_ModulerCharacterSet.BPI_ModulerCharacterSet_C.GetWalkRunBlend
// 0x0008 (0x0008 - 0x0000)
struct BPI_ModulerCharacterSet_C_GetWalkRunBlend final
{
public:
	float                                         OutWalkRunBlend;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutPreviousWalkRunBlend;                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ModulerCharacterSet_C_GetWalkRunBlend) == 0x000004, "Wrong alignment on BPI_ModulerCharacterSet_C_GetWalkRunBlend");
static_assert(sizeof(BPI_ModulerCharacterSet_C_GetWalkRunBlend) == 0x000008, "Wrong size on BPI_ModulerCharacterSet_C_GetWalkRunBlend");
static_assert(offsetof(BPI_ModulerCharacterSet_C_GetWalkRunBlend, OutWalkRunBlend) == 0x000000, "Member 'BPI_ModulerCharacterSet_C_GetWalkRunBlend::OutWalkRunBlend' has a wrong offset!");
static_assert(offsetof(BPI_ModulerCharacterSet_C_GetWalkRunBlend, OutPreviousWalkRunBlend) == 0x000004, "Member 'BPI_ModulerCharacterSet_C_GetWalkRunBlend::OutPreviousWalkRunBlend' has a wrong offset!");

// Function BPI_ModulerCharacterSet.BPI_ModulerCharacterSet_C.GetLocomotionState
// 0x0001 (0x0001 - 0x0000)
struct BPI_ModulerCharacterSet_C_GetLocomotionState final
{
public:
	Enum_LocomotionState                          OutLocomotionState;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_ModulerCharacterSet_C_GetLocomotionState) == 0x000001, "Wrong alignment on BPI_ModulerCharacterSet_C_GetLocomotionState");
static_assert(sizeof(BPI_ModulerCharacterSet_C_GetLocomotionState) == 0x000001, "Wrong size on BPI_ModulerCharacterSet_C_GetLocomotionState");
static_assert(offsetof(BPI_ModulerCharacterSet_C_GetLocomotionState, OutLocomotionState) == 0x000000, "Member 'BPI_ModulerCharacterSet_C_GetLocomotionState::OutLocomotionState' has a wrong offset!");

// Function BPI_ModulerCharacterSet.BPI_ModulerCharacterSet_C.Set No Blink
// 0x0001 (0x0001 - 0x0000)
struct BPI_ModulerCharacterSet_C_Set_No_Blink final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ModulerCharacterSet_C_Set_No_Blink) == 0x000001, "Wrong alignment on BPI_ModulerCharacterSet_C_Set_No_Blink");
static_assert(sizeof(BPI_ModulerCharacterSet_C_Set_No_Blink) == 0x000001, "Wrong size on BPI_ModulerCharacterSet_C_Set_No_Blink");
static_assert(offsetof(BPI_ModulerCharacterSet_C_Set_No_Blink, Enable) == 0x000000, "Member 'BPI_ModulerCharacterSet_C_Set_No_Blink::Enable' has a wrong offset!");

// Function BPI_ModulerCharacterSet.BPI_ModulerCharacterSet_C.Set Saccade
// 0x0001 (0x0001 - 0x0000)
struct BPI_ModulerCharacterSet_C_Set_Saccade final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_ModulerCharacterSet_C_Set_Saccade) == 0x000001, "Wrong alignment on BPI_ModulerCharacterSet_C_Set_Saccade");
static_assert(sizeof(BPI_ModulerCharacterSet_C_Set_Saccade) == 0x000001, "Wrong size on BPI_ModulerCharacterSet_C_Set_Saccade");
static_assert(offsetof(BPI_ModulerCharacterSet_C_Set_Saccade, Enable) == 0x000000, "Member 'BPI_ModulerCharacterSet_C_Set_Saccade::Enable' has a wrong offset!");

}

