#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CriWareRuntime_structs.hpp"


namespace SDK
{

// Class CriWareRuntime.AtomEntranceVolume
// 0x0020 (0x0278 - 0x0258)
class AAtomEntranceVolume final : public AVolume
{
public:
	float                                         Priority;                                          // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bEnabled : 1;                                      // 0x025C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_25D[0xB];                                      // 0x025D(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AAtomAudioVolume>> NeighbourhoodAudioVolumeArray;                     // 0x0268(0x0010)(Edit, Net, ZeroConstructor, EditConst, RepNotify, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void OnRep_bEnabled();
	void SetEnabled(bool bNewEnabled);
	void SetPriority(float NewPriority);

	bool GetEnabled() const;
	float GetPriority() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEntranceVolume">();
	}
	static class AAtomEntranceVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomEntranceVolume>();
	}
};
static_assert(alignof(AAtomEntranceVolume) == 0x000008, "Wrong alignment on AAtomEntranceVolume");
static_assert(sizeof(AAtomEntranceVolume) == 0x000278, "Wrong size on AAtomEntranceVolume");
static_assert(offsetof(AAtomEntranceVolume, Priority) == 0x000258, "Member 'AAtomEntranceVolume::Priority' has a wrong offset!");
static_assert(offsetof(AAtomEntranceVolume, NeighbourhoodAudioVolumeArray) == 0x000268, "Member 'AAtomEntranceVolume::NeighbourhoodAudioVolumeArray' has a wrong offset!");

// Class CriWareRuntime.Atom3dRegionHandle
// 0x0008 (0x0030 - 0x0028)
class UAtom3dRegionHandle final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Atom3dRegionHandle">();
	}
	static class UAtom3dRegionHandle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtom3dRegionHandle>();
	}
};
static_assert(alignof(UAtom3dRegionHandle) == 0x000008, "Wrong alignment on UAtom3dRegionHandle");
static_assert(sizeof(UAtom3dRegionHandle) == 0x000030, "Wrong size on UAtom3dRegionHandle");

// Class CriWareRuntime.AtomAudioVolume
// 0x0088 (0x02E0 - 0x0258)
class AAtomAudioVolume final : public AVolume
{
public:
	float                                         Priority;                                          // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bEnabled : 1;                                      // 0x025C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CollisionProfile;                                  // 0x0260(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoSettingEntranceVolume;                        // 0x0268(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoSettingNeighbourAudioVolumeToEntranceVolume;  // 0x0269(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           AudioVolumeTags;                                   // 0x0270(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bOverrideAtomAudioVolume;                          // 0x0280(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomAudioVolumeSettings*               AtomAudioVolumeSettings;                           // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomAudioVolumeParameters             AtomAudioVolumeSettingsOverrides;                  // 0x0290(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class AAtomEntranceVolume*>            EntranceVolumes;                                   // 0x02D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static void EnableAllAudioVolume(bool bEnable);

	void OnRep_bEnabled();
	void SetEnabled(bool bNewEnabled);
	void SetPriority(float NewPriority);
	void SetReverbSettings(const struct FSnapshotSwitchSettings& NewReverbSettings);

	bool GetEnabled() const;
	float GetPriority() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAudioVolume">();
	}
	static class AAtomAudioVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomAudioVolume>();
	}
};
static_assert(alignof(AAtomAudioVolume) == 0x000008, "Wrong alignment on AAtomAudioVolume");
static_assert(sizeof(AAtomAudioVolume) == 0x0002E0, "Wrong size on AAtomAudioVolume");
static_assert(offsetof(AAtomAudioVolume, Priority) == 0x000258, "Member 'AAtomAudioVolume::Priority' has a wrong offset!");
static_assert(offsetof(AAtomAudioVolume, CollisionProfile) == 0x000260, "Member 'AAtomAudioVolume::CollisionProfile' has a wrong offset!");
static_assert(offsetof(AAtomAudioVolume, bAutoSettingEntranceVolume) == 0x000268, "Member 'AAtomAudioVolume::bAutoSettingEntranceVolume' has a wrong offset!");
static_assert(offsetof(AAtomAudioVolume, bAutoSettingNeighbourAudioVolumeToEntranceVolume) == 0x000269, "Member 'AAtomAudioVolume::bAutoSettingNeighbourAudioVolumeToEntranceVolume' has a wrong offset!");
static_assert(offsetof(AAtomAudioVolume, AudioVolumeTags) == 0x000270, "Member 'AAtomAudioVolume::AudioVolumeTags' has a wrong offset!");
static_assert(offsetof(AAtomAudioVolume, bOverrideAtomAudioVolume) == 0x000280, "Member 'AAtomAudioVolume::bOverrideAtomAudioVolume' has a wrong offset!");
static_assert(offsetof(AAtomAudioVolume, AtomAudioVolumeSettings) == 0x000288, "Member 'AAtomAudioVolume::AtomAudioVolumeSettings' has a wrong offset!");
static_assert(offsetof(AAtomAudioVolume, AtomAudioVolumeSettingsOverrides) == 0x000290, "Member 'AAtomAudioVolume::AtomAudioVolumeSettingsOverrides' has a wrong offset!");
static_assert(offsetof(AAtomAudioVolume, EntranceVolumes) == 0x0002D0, "Member 'AAtomAudioVolume::EntranceVolumes' has a wrong offset!");

// Class CriWareRuntime.Atom3dRegion
// 0x0020 (0x0048 - 0x0028)
class UAtom3dRegion final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtom3dRegionHandle*                    Handle;                                            // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UAtom3dRegionHandle* GetHandle();
	void SetHandle(class UAtom3dRegionHandle* InHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Atom3dRegion">();
	}
	static class UAtom3dRegion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtom3dRegion>();
	}
};
static_assert(alignof(UAtom3dRegion) == 0x000008, "Wrong alignment on UAtom3dRegion");
static_assert(sizeof(UAtom3dRegion) == 0x000048, "Wrong size on UAtom3dRegion");
static_assert(offsetof(UAtom3dRegion, Handle) == 0x000040, "Member 'UAtom3dRegion::Handle' has a wrong offset!");

// Class CriWareRuntime.Atom3dSourceBaseComponent
// 0x0090 (0x0290 - 0x0200)
class UAtom3dSourceBaseComponent : public USceneComponent
{
public:
	float                                         DefaultOutputVolumeScale;                          // 0x01F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtom3dRegion*                          DefaultRegion;                                     // 0x0200(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsAttenuationDistanceDebugSpheresVisible : 1;     // 0x0208(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultMinAttenuationDistance;                     // 0x020C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultMaxAttenuationDistance;                     // 0x0210(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsOutputInteriorPanFieldDebugSpheresVisible : 1;  // 0x0214(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultSourceRadius;                               // 0x0218(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultInteriorDistance;                           // 0x021C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         DefaultDistanceAisacControls;                      // 0x0220(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         DefaultOutputBasedAzimuthAngleAisacControls;       // 0x0230(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         DefaultOutputBasedElevationAngleAisacControls;     // 0x0240(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         DefaultListenerBasedAzimuthAngleAisacControls;     // 0x0250(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         DefaultListenerBasedElevationAngleAisacControls;   // 0x0260(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bIsDebugStringsForDetailsVisible : 1;              // 0x0270(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_271[0x1F];                                     // 0x0271(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetRegion(class UAtom3dRegion* InRegion);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Atom3dSourceBaseComponent">();
	}
	static class UAtom3dSourceBaseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtom3dSourceBaseComponent>();
	}
};
static_assert(alignof(UAtom3dSourceBaseComponent) == 0x000010, "Wrong alignment on UAtom3dSourceBaseComponent");
static_assert(sizeof(UAtom3dSourceBaseComponent) == 0x000290, "Wrong size on UAtom3dSourceBaseComponent");
static_assert(offsetof(UAtom3dSourceBaseComponent, DefaultOutputVolumeScale) == 0x0001F8, "Member 'UAtom3dSourceBaseComponent::DefaultOutputVolumeScale' has a wrong offset!");
static_assert(offsetof(UAtom3dSourceBaseComponent, DefaultRegion) == 0x000200, "Member 'UAtom3dSourceBaseComponent::DefaultRegion' has a wrong offset!");
static_assert(offsetof(UAtom3dSourceBaseComponent, DefaultMinAttenuationDistance) == 0x00020C, "Member 'UAtom3dSourceBaseComponent::DefaultMinAttenuationDistance' has a wrong offset!");
static_assert(offsetof(UAtom3dSourceBaseComponent, DefaultMaxAttenuationDistance) == 0x000210, "Member 'UAtom3dSourceBaseComponent::DefaultMaxAttenuationDistance' has a wrong offset!");
static_assert(offsetof(UAtom3dSourceBaseComponent, DefaultSourceRadius) == 0x000218, "Member 'UAtom3dSourceBaseComponent::DefaultSourceRadius' has a wrong offset!");
static_assert(offsetof(UAtom3dSourceBaseComponent, DefaultInteriorDistance) == 0x00021C, "Member 'UAtom3dSourceBaseComponent::DefaultInteriorDistance' has a wrong offset!");
static_assert(offsetof(UAtom3dSourceBaseComponent, DefaultDistanceAisacControls) == 0x000220, "Member 'UAtom3dSourceBaseComponent::DefaultDistanceAisacControls' has a wrong offset!");
static_assert(offsetof(UAtom3dSourceBaseComponent, DefaultOutputBasedAzimuthAngleAisacControls) == 0x000230, "Member 'UAtom3dSourceBaseComponent::DefaultOutputBasedAzimuthAngleAisacControls' has a wrong offset!");
static_assert(offsetof(UAtom3dSourceBaseComponent, DefaultOutputBasedElevationAngleAisacControls) == 0x000240, "Member 'UAtom3dSourceBaseComponent::DefaultOutputBasedElevationAngleAisacControls' has a wrong offset!");
static_assert(offsetof(UAtom3dSourceBaseComponent, DefaultListenerBasedAzimuthAngleAisacControls) == 0x000250, "Member 'UAtom3dSourceBaseComponent::DefaultListenerBasedAzimuthAngleAisacControls' has a wrong offset!");
static_assert(offsetof(UAtom3dSourceBaseComponent, DefaultListenerBasedElevationAngleAisacControls) == 0x000260, "Member 'UAtom3dSourceBaseComponent::DefaultListenerBasedElevationAngleAisacControls' has a wrong offset!");

// Class CriWareRuntime.Atom3dTransceiverComponent
// 0x0030 (0x02C0 - 0x0290)
class UAtom3dTransceiverComponent final : public UAtom3dSourceBaseComponent
{
public:
	class AActor*                                 InputPoint;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         DefaultGlobalAisacs;                               // 0x0298(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bIsInputCrossfadeFieldDebugSpheresVisible : 1;     // 0x02A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultDirectAudioRadius;                          // 0x02AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultCrossfadeDistance;                          // 0x02B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B4[0xC];                                      // 0x02B4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Atom3dTransceiverComponent">();
	}
	static class UAtom3dTransceiverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtom3dTransceiverComponent>();
	}
};
static_assert(alignof(UAtom3dTransceiverComponent) == 0x000010, "Wrong alignment on UAtom3dTransceiverComponent");
static_assert(sizeof(UAtom3dTransceiverComponent) == 0x0002C0, "Wrong size on UAtom3dTransceiverComponent");
static_assert(offsetof(UAtom3dTransceiverComponent, InputPoint) == 0x000290, "Member 'UAtom3dTransceiverComponent::InputPoint' has a wrong offset!");
static_assert(offsetof(UAtom3dTransceiverComponent, DefaultGlobalAisacs) == 0x000298, "Member 'UAtom3dTransceiverComponent::DefaultGlobalAisacs' has a wrong offset!");
static_assert(offsetof(UAtom3dTransceiverComponent, DefaultDirectAudioRadius) == 0x0002AC, "Member 'UAtom3dTransceiverComponent::DefaultDirectAudioRadius' has a wrong offset!");
static_assert(offsetof(UAtom3dTransceiverComponent, DefaultCrossfadeDistance) == 0x0002B0, "Member 'UAtom3dTransceiverComponent::DefaultCrossfadeDistance' has a wrong offset!");

// Class CriWareRuntime.AtomAreaSoundVolume
// 0x0040 (0x0298 - 0x0258)
class AAtomAreaSoundVolume final : public AVolume
{
public:
	float                                         Priority;                                          // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bEnabled : 1;                                      // 0x025C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CollisionProfile;                                  // 0x0260(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SoundStopDistance;                                 // 0x0268(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsEnableAtomCompoentPack;                         // 0x026C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_26D[0x2];                                      // 0x026D(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsAutoPlaySound;                                  // 0x026F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDeterminationFromVolumeBoundaryPlane;           // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAtomComponent*>                 AtomComponents;                                    // 0x0278(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class USoundAtomCue*>                  Sounds;                                            // 0x0288(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	TArray<class UAtomComponent*> CreateSounds(const struct FVector& Listener_location);
	void DestroySounds();
	void OnRep_bEnabled();
	void SetEnabled(bool bNewEnabled);
	void SetPriority(float NewPriority);

	bool GetEnabled() const;
	float GetPriority() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAreaSoundVolume">();
	}
	static class AAtomAreaSoundVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomAreaSoundVolume>();
	}
};
static_assert(alignof(AAtomAreaSoundVolume) == 0x000008, "Wrong alignment on AAtomAreaSoundVolume");
static_assert(sizeof(AAtomAreaSoundVolume) == 0x000298, "Wrong size on AAtomAreaSoundVolume");
static_assert(offsetof(AAtomAreaSoundVolume, Priority) == 0x000258, "Member 'AAtomAreaSoundVolume::Priority' has a wrong offset!");
static_assert(offsetof(AAtomAreaSoundVolume, CollisionProfile) == 0x000260, "Member 'AAtomAreaSoundVolume::CollisionProfile' has a wrong offset!");
static_assert(offsetof(AAtomAreaSoundVolume, SoundStopDistance) == 0x000268, "Member 'AAtomAreaSoundVolume::SoundStopDistance' has a wrong offset!");
static_assert(offsetof(AAtomAreaSoundVolume, bIsEnableAtomCompoentPack) == 0x00026C, "Member 'AAtomAreaSoundVolume::bIsEnableAtomCompoentPack' has a wrong offset!");
static_assert(offsetof(AAtomAreaSoundVolume, bIsAutoPlaySound) == 0x00026F, "Member 'AAtomAreaSoundVolume::bIsAutoPlaySound' has a wrong offset!");
static_assert(offsetof(AAtomAreaSoundVolume, bIsDeterminationFromVolumeBoundaryPlane) == 0x000270, "Member 'AAtomAreaSoundVolume::bIsDeterminationFromVolumeBoundaryPlane' has a wrong offset!");
static_assert(offsetof(AAtomAreaSoundVolume, AtomComponents) == 0x000278, "Member 'AAtomAreaSoundVolume::AtomComponents' has a wrong offset!");
static_assert(offsetof(AAtomAreaSoundVolume, Sounds) == 0x000288, "Member 'AAtomAreaSoundVolume::Sounds' has a wrong offset!");

// Class CriWareRuntime.AtomAsrRack
// 0x0018 (0x0040 - 0x0028)
class UAtomAsrRack final : public UObject
{
public:
	int32                                         RackId;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x14];                                      // 0x002C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAtomAsrRack* GetAsrRack(int32 ASRRackID);
	static class UAtomAsrRack* GetDefaultAsrRack();

	void ApplyDspBusSnapshot(const class FString& SnapshotName, int32 Milliseconds);
	void AttachDspBusSetting(const class FString& SettingName);
	void ConnectToPadSpeaker(int32 UserIndex);
	void ConnectToPadVibrator(int32 UserIndex);
	void DetachDspBusSetting();
	bool GetBusAnalyzerInfo(const class FString& DspBusName, int32* Num_channels, TArray<float>* Rms_levels, TArray<float>* Peak_levels, TArray<float>* Peak_hold_levels);
	class FString GetCurrentAppliedSnapshot(int32 ASRRackID);
	void SetBusSendLevelByName(const class FString& SourceBusName, const class FString& DestBusName, float Level);
	void SetBusVolumeByName(const class FString& BusName, float Volume);
	void SetEffectBypass(const class FString& BusName, const class FString& EffectName, bool Bypasses);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAsrRack">();
	}
	static class UAtomAsrRack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAsrRack>();
	}
};
static_assert(alignof(UAtomAsrRack) == 0x000008, "Wrong alignment on UAtomAsrRack");
static_assert(sizeof(UAtomAsrRack) == 0x000040, "Wrong size on UAtomAsrRack");
static_assert(offsetof(UAtomAsrRack, RackId) == 0x000028, "Member 'UAtomAsrRack::RackId' has a wrong offset!");

// Class CriWareRuntime.AtomAudioVolumeSettings
// 0x0040 (0x0068 - 0x0028)
class UAtomAudioVolumeSettings final : public UObject
{
public:
	struct FAtomAudioVolumeParameters             AtomAudioVolumeParameters;                         // 0x0028(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAudioVolumeSettings">();
	}
	static class UAtomAudioVolumeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAudioVolumeSettings>();
	}
};
static_assert(alignof(UAtomAudioVolumeSettings) == 0x000008, "Wrong alignment on UAtomAudioVolumeSettings");
static_assert(sizeof(UAtomAudioVolumeSettings) == 0x000068, "Wrong size on UAtomAudioVolumeSettings");
static_assert(offsetof(UAtomAudioVolumeSettings, AtomAudioVolumeParameters) == 0x000028, "Member 'UAtomAudioVolumeSettings::AtomAudioVolumeParameters' has a wrong offset!");

// Class CriWareRuntime.AtomBusSampler
// 0x0040 (0x0068 - 0x0028)
class UAtomBusSampler final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnRecordingStarted;                                // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnRecordingFinished;                               // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FinishRecording();
	void OnRecordingFinished__DelegateSignature();
	void OnRecordingStarted__DelegateSignature();
	void PauseRecordedSound(bool bPause);
	void PlayRecordedSound();
	void StartRecording(float InExpectedDuration, int32 InAsrRack, const class FString& InBusName, bool BusOutput);
	void StopRecordedSound();

	bool CanPlayRecordedSound() const;
	bool CanRecord() const;
	bool IsPausedRecordedSound() const;
	bool IsPlayingRecordedSound() const;
	bool IsRecording() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomBusSampler">();
	}
	static class UAtomBusSampler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomBusSampler>();
	}
};
static_assert(alignof(UAtomBusSampler) == 0x000008, "Wrong alignment on UAtomBusSampler");
static_assert(sizeof(UAtomBusSampler) == 0x000068, "Wrong size on UAtomBusSampler");
static_assert(offsetof(UAtomBusSampler, OnRecordingStarted) == 0x000028, "Member 'UAtomBusSampler::OnRecordingStarted' has a wrong offset!");
static_assert(offsetof(UAtomBusSampler, OnRecordingFinished) == 0x000038, "Member 'UAtomBusSampler::OnRecordingFinished' has a wrong offset!");

// Class CriWareRuntime.AtomCallback
// 0x0000 (0x0028 - 0x0028)
class IAtomCallback final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomCallback">();
	}
	static class IAtomCallback* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAtomCallback>();
	}
};
static_assert(alignof(IAtomCallback) == 0x000008, "Wrong alignment on IAtomCallback");
static_assert(sizeof(IAtomCallback) == 0x000028, "Wrong size on IAtomCallback");

// Class CriWareRuntime.AtomCallbackManager
// 0x0028 (0x0050 - 0x0028)
class UAtomCallbackManager final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void NativeBreakAtomBeatSyncInfo(const struct FAtomBeatSyncInfo& BeatSyncInfo, int32* BarCnt, int32* BeatCnt, float* BeatProgress, float* Bpm, int32* Offset, int32* NumBeats);
	static void NativeBreakAtomSequenceInfo(const struct FAtomSequenceInfo& SequenceInfo, float* Time, class FString* TagName, EAtomSequenceEventType* EventType, int32* CallbackID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomCallbackManager">();
	}
	static class UAtomCallbackManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomCallbackManager>();
	}
};
static_assert(alignof(UAtomCallbackManager) == 0x000008, "Wrong alignment on UAtomCallbackManager");
static_assert(sizeof(UAtomCallbackManager) == 0x000050, "Wrong size on UAtomCallbackManager");

// Class CriWareRuntime.AtomCategory
// 0x0000 (0x0028 - 0x0028)
class UAtomCategory final : public UBlueprintFunctionLibrary
{
public:
	static void GetAttachedAisacInfoById(int32 CategoryID, int32 AisacAttachedIndex, bool* IsSuccess, struct FAtomAisacInfo* AisacInfo);
	static void GetAttachedAisacInfoByName(const class FString& CategoryName, int32 AisacAttachedIndex, bool* IsSuccess, struct FAtomAisacInfo* AisacInfo);
	static float GetCurrentAisacControlValueById(int32 CategoryID, int32 AisacControlID);
	static float GetCurrentAisacControlValueByName(const class FString& CategoryName, const class FString& AisacControlName);
	static int32 GetNumAttachedAisacsById(int32 CategoryID);
	static int32 GetNumAttachedAisacsByName(const class FString& CategoryName);
	static float GetVolumeByName(const class FString& CategoryName);
	static bool IsPausedByName(const class FString& CategoryName);
	static void PauseByName(const class FString& CategoryName, bool bPause);
	static bool ResetAllAisacControlById(int32 CategoryID);
	static bool ResetAllAisacControlByName(const class FString& CategoryName);
	static void SetAisacControlByName(const class FString& CategoryName, const class FString& AisacName, float Value);
	static void SetVolumeByName(const class FString& CategoryName, float Volume);
	static void StopByName(const class FString& CategoryName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomCategory">();
	}
	static class UAtomCategory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomCategory>();
	}
};
static_assert(alignof(UAtomCategory) == 0x000008, "Wrong alignment on UAtomCategory");
static_assert(sizeof(UAtomCategory) == 0x000028, "Wrong size on UAtomCategory");

// Class CriWareRuntime.AtomComponent
// 0x0EA0 (0x10A0 - 0x0200)
#pragma pack(push, 0x1)
class alignas(0x10) UAtomComponent : public USceneComponent
{
public:
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          Sound;                                             // 0x0200(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtom3dRegion*                          Region;                                            // 0x0208(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoDestroy : 1;                                  // 0x0210(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPersistAcrossLevelTransition : 1;                 // 0x0210(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_210_2 : 1;                                  // 0x0210(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bStopWhenOwnerDestroyed : 1;                       // 0x0210(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsUISound : 1;                                    // 0x0210(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultVolume;                                     // 0x0214(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableMultipleSoundPlayback : 1;                  // 0x0218(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUsePlaylist : 1;                                  // 0x0218(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bIsMovable;                                        // 0x0219(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanStraddleAudioVolume;                           // 0x021A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAudioVolume;                                   // 0x021B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAreaSoundVolume;                               // 0x021C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomSoundObject*                       SoundObject;                                       // 0x0220(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultBlockIndex;                                 // 0x0228(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomAisacControlParam>         DefaultAisacControl;                               // 0x0230(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomSelectorParam>             DefaultSelectorLabel;                              // 0x0240(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EAtomLoopSetting                              LoopSetting;                                       // 0x0250(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOnly2DSound : 1;                                  // 0x0251(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnStatusChanged;                                   // 0x0258(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnAudioVolumeChanged;                              // 0x0268(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnAudioFinished;                                   // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UWorld*                                 PlayWorld;                                         // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameViewportClient*                    GameViewport;                                      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_298[0x18];                                     // 0x0298(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomSoundObject*                       DefaultSoundObject;                                // 0x02B0(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverrideAttenuation : 1;                          // 0x02B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAttenuation*                      AttenuationSettings;                               // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoundAttenuationSettings              AttenuationOverrides;                              // 0x02C8(0x03A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_668[0x9D0];                                    // 0x0668(0x09D0)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCueSheet*                     CueSheet;                                          // 0x1038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1040[0x10];                                    // 0x1040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomSoundObject*                       AppliedSoundObject;                                // 0x1050(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1058[0x20];                                    // 0x1058(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnAtomBeatSyncCallback;                            // 0x1078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnAtomSequenceCallback;                            // 0x1088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static void DestroyComponentByID(int32 TargetID);
	static class UAtomComponent* GetAtomComponentFromID(int32 TargetID);
	static bool GetDefaultAttenuationEnable();
	static void SetDefaultAttenuationEnable(bool bEnable);

	void AdjustAttenuation(const struct FSoundAttenuationSettings& InAttenuationSettings);
	void AtomBeatSyncCallbackDelegate__DelegateSignature(class UAtomComponent* AtomComponent, const struct FAtomBeatSyncInfo& BeatSyncInfo);
	void AtomSequenceCallbackDelegate__DelegateSignature(class UAtomComponent* AtomComponent, const struct FAtomSequenceInfo& SequenceInfo);
	void AttachAreaSoundVolume(class AAtomAreaSoundVolume* Sound_shape_volume);
	bool BP_GetAttenuationSettingsToApply(struct FSoundAttenuationSettings* OutAttenuationSettings);
	void ClearSelectorLabels();
	void EnqueueSound(class USoundAtomCue* NewSound);
	void FadeIn(float FadeInDuration, float FadeVolumeLevel, float StartTime);
	void FadeOut(float FadeOutDuration, float FadeVolumeLevel);
	TMap<class FString, float> GetAudioVolumeValueMap(EAtomAudioVolumeType Type);
	float GetVolume();
	void OnAudioFinished__DelegateSignature();
	void OnAudioVolumeChanged__DelegateSignature(EAtomAudioVolumeType Type, class AAtomAudioVolume* AtomAudioVolume, bool bIsCalledFromTick);
	void OnStatusChanged__DelegateSignature(EAtomComponentStatus Status, class UAtomComponent* AtomComponent);
	void Pause(bool bPause);
	void Play(float StartTime);
	void SetAisacByName(const class FString& ControlName, float ControlValue);
	void SetAsrRackID(int32 Asr_rack_id);
	void SetAsrRackIdArray(const TArray<int32>& AsrRackIDs);
	void SetBusSendLevel(int32 BusId, float Level);
	void SetBusSendLevelByName(const class FString& BusName, float Level);
	void SetBusSendLevelOffset(int32 BusId, float LevelOffset);
	void SetBusSendLevelOffsetByName(const class FString& BusName, float LevelOffset);
	void SetNextBlockIndex(int32 BlockIndex);
	void SetPitch(float Pitch);
	void SetPitchMultiplier(float NewPitchMultiplier);
	void SetRegion(class UAtom3dRegion* InRegion);
	void SetSelectorLabel(const class FString& Selector, const class FString& Label);
	void SetSound(class USoundAtomCue* NewSound);
	void SetSoundObject(class UAtomSoundObject* InSoundObject);
	void SetVolume(float Volume);
	void Stop();
	void StopWithoutReleaseTime();

	int32 GetAtomComponentID() const;
	class FString GetCueName() const;
	float GetCullDistance() const;
	float GetCullDistanceMargin() const;
	class AAtomAudioVolume* GetCurrentBelongingAudioVolume(EAtomAudioVolumeType Type, bool IsNeighbor) const;
	float GetCurrentCullingBoundaryDistance() const;
	float GetCurrentCullingMarginDistance() const;
	float GetCurrentEconomicTickBoundaryDistance() const;
	float GetCurrentEconomicTickFrequency() const;
	float GetCurrentEconomicTickMarginDistance() const;
	float GetCurrentMaxAttenuationDistance() const;
	float GetEconomicTickDistance() const;
	float GetEconomicTickDistanceMargin() const;
	float GetEconomicTickFrequency() const;
	float GetMaxAttenuationDistance() const;
	int32 GetNumQueuedSounds() const;
	float GetSequencePosition() const;
	EAtomComponentStatus GetStatus() const;
	float GetTime() const;
	struct FVector GetVelocity() const;
	bool HasBeenEconomicTick() const;
	bool IsLoop() const;
	bool IsPaused() const;
	bool IsPlaying() const;
	bool IsReducingTickFrequency() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomComponent">();
	}
	static class UAtomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomComponent>();
	}
};
#pragma pack(pop)
static_assert(alignof(UAtomComponent) == 0x000010, "Wrong alignment on UAtomComponent");
static_assert(sizeof(UAtomComponent) == 0x0010A0, "Wrong size on UAtomComponent");
static_assert(offsetof(UAtomComponent, Sound) == 0x000200, "Member 'UAtomComponent::Sound' has a wrong offset!");
static_assert(offsetof(UAtomComponent, Region) == 0x000208, "Member 'UAtomComponent::Region' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultVolume) == 0x000214, "Member 'UAtomComponent::DefaultVolume' has a wrong offset!");
static_assert(offsetof(UAtomComponent, bIsMovable) == 0x000219, "Member 'UAtomComponent::bIsMovable' has a wrong offset!");
static_assert(offsetof(UAtomComponent, bCanStraddleAudioVolume) == 0x00021A, "Member 'UAtomComponent::bCanStraddleAudioVolume' has a wrong offset!");
static_assert(offsetof(UAtomComponent, bUseAudioVolume) == 0x00021B, "Member 'UAtomComponent::bUseAudioVolume' has a wrong offset!");
static_assert(offsetof(UAtomComponent, bUseAreaSoundVolume) == 0x00021C, "Member 'UAtomComponent::bUseAreaSoundVolume' has a wrong offset!");
static_assert(offsetof(UAtomComponent, SoundObject) == 0x000220, "Member 'UAtomComponent::SoundObject' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultBlockIndex) == 0x000228, "Member 'UAtomComponent::DefaultBlockIndex' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultAisacControl) == 0x000230, "Member 'UAtomComponent::DefaultAisacControl' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultSelectorLabel) == 0x000240, "Member 'UAtomComponent::DefaultSelectorLabel' has a wrong offset!");
static_assert(offsetof(UAtomComponent, LoopSetting) == 0x000250, "Member 'UAtomComponent::LoopSetting' has a wrong offset!");
static_assert(offsetof(UAtomComponent, OnStatusChanged) == 0x000258, "Member 'UAtomComponent::OnStatusChanged' has a wrong offset!");
static_assert(offsetof(UAtomComponent, OnAudioVolumeChanged) == 0x000268, "Member 'UAtomComponent::OnAudioVolumeChanged' has a wrong offset!");
static_assert(offsetof(UAtomComponent, OnAudioFinished) == 0x000278, "Member 'UAtomComponent::OnAudioFinished' has a wrong offset!");
static_assert(offsetof(UAtomComponent, PlayWorld) == 0x000288, "Member 'UAtomComponent::PlayWorld' has a wrong offset!");
static_assert(offsetof(UAtomComponent, GameViewport) == 0x000290, "Member 'UAtomComponent::GameViewport' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultSoundObject) == 0x0002B0, "Member 'UAtomComponent::DefaultSoundObject' has a wrong offset!");
static_assert(offsetof(UAtomComponent, AttenuationSettings) == 0x0002C0, "Member 'UAtomComponent::AttenuationSettings' has a wrong offset!");
static_assert(offsetof(UAtomComponent, AttenuationOverrides) == 0x0002C8, "Member 'UAtomComponent::AttenuationOverrides' has a wrong offset!");
static_assert(offsetof(UAtomComponent, CueSheet) == 0x001038, "Member 'UAtomComponent::CueSheet' has a wrong offset!");
static_assert(offsetof(UAtomComponent, AppliedSoundObject) == 0x001050, "Member 'UAtomComponent::AppliedSoundObject' has a wrong offset!");
static_assert(offsetof(UAtomComponent, OnAtomBeatSyncCallback) == 0x001078, "Member 'UAtomComponent::OnAtomBeatSyncCallback' has a wrong offset!");
static_assert(offsetof(UAtomComponent, OnAtomSequenceCallback) == 0x001088, "Member 'UAtomComponent::OnAtomSequenceCallback' has a wrong offset!");

// Class CriWareRuntime.AtomComponentPool
// 0x0040 (0x0068 - 0x0028)
class UAtomComponentPool final : public UObject
{
public:
	TArray<class UAtomComponent*>                 Pool;                                              // 0x0028(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomComponentPool">();
	}
	static class UAtomComponentPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomComponentPool>();
	}
};
static_assert(alignof(UAtomComponentPool) == 0x000008, "Wrong alignment on UAtomComponentPool");
static_assert(sizeof(UAtomComponentPool) == 0x000068, "Wrong size on UAtomComponentPool");
static_assert(offsetof(UAtomComponentPool, Pool) == 0x000028, "Member 'UAtomComponentPool::Pool' has a wrong offset!");

// Class CriWareRuntime.AtomCueSheetLoaderComponent
// 0x0090 (0x0290 - 0x0200)
class UAtomCueSheetLoaderComponent final : public USceneComponent
{
public:
	struct FSoftObjectPath                        CueSheetReference;                                 // 0x01F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCriFsBinderComponent*                  BinderComponent;                                   // 0x0210(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLoadCompleted;                                   // 0x0218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLoadError;                                       // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_238[0x30];                                     // 0x0238(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCueSheet*                     CueSheet;                                          // 0x0268(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_270[0x20];                                     // 0x0270(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void LoadAtomCueSheet(class UObject* WorldContextObject, TSoftObjectPtr<class USoundAtomCueSheet> Asset, TDelegate<void(class USoundAtomCueSheet* Loaded)> OnLoaded, const struct FLatentActionInfo& LatentInfo);

	class USoundAtomCueSheet* GetAtomCueSheet();
	EAtomCueSheetLoaderComponentStatus GetStatus();
	void Load();
	void OnAtomCueSheetLoaded__DelegateSignature(class USoundAtomCueSheet* Loaded);
	void OnLoadCompleted__DelegateSignature();
	void OnLoadError__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomCueSheetLoaderComponent">();
	}
	static class UAtomCueSheetLoaderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomCueSheetLoaderComponent>();
	}
};
static_assert(alignof(UAtomCueSheetLoaderComponent) == 0x000010, "Wrong alignment on UAtomCueSheetLoaderComponent");
static_assert(sizeof(UAtomCueSheetLoaderComponent) == 0x000290, "Wrong size on UAtomCueSheetLoaderComponent");
static_assert(offsetof(UAtomCueSheetLoaderComponent, CueSheetReference) == 0x0001F8, "Member 'UAtomCueSheetLoaderComponent::CueSheetReference' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetLoaderComponent, BinderComponent) == 0x000210, "Member 'UAtomCueSheetLoaderComponent::BinderComponent' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetLoaderComponent, OnLoadCompleted) == 0x000218, "Member 'UAtomCueSheetLoaderComponent::OnLoadCompleted' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetLoaderComponent, OnLoadError) == 0x000228, "Member 'UAtomCueSheetLoaderComponent::OnLoadError' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetLoaderComponent, CueSheet) == 0x000268, "Member 'UAtomCueSheetLoaderComponent::CueSheet' has a wrong offset!");

// Class CriWareRuntime.AtomDeviceWatcher
// 0x0028 (0x0050 - 0x0028)
class UAtomDeviceWatcher final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnDeviceUpdated;                                   // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetDeviceChannelCount(int32 ASRRackID);
	class FString GetDeviceName();
	EAtomDeviceType GetDeviceType(int32 ASRRackID);
	void OnDeviceUpdated__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDeviceWatcher">();
	}
	static class UAtomDeviceWatcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomDeviceWatcher>();
	}
};
static_assert(alignof(UAtomDeviceWatcher) == 0x000008, "Wrong alignment on UAtomDeviceWatcher");
static_assert(sizeof(UAtomDeviceWatcher) == 0x000050, "Wrong size on UAtomDeviceWatcher");
static_assert(offsetof(UAtomDeviceWatcher, OnDeviceUpdated) == 0x000028, "Member 'UAtomDeviceWatcher::OnDeviceUpdated' has a wrong offset!");

// Class CriWareRuntime.AtomDisposer
// 0x0010 (0x0230 - 0x0220)
class AAtomDisposer final : public AActor
{
public:
	uint8                                         Pad_220[0x10];                                     // 0x0220(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDisposer">();
	}
	static class AAtomDisposer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomDisposer>();
	}
};
static_assert(alignof(AAtomDisposer) == 0x000008, "Wrong alignment on AAtomDisposer");
static_assert(sizeof(AAtomDisposer) == 0x000230, "Wrong size on AAtomDisposer");

// Class CriWareRuntime.AtomListenerFocusPoint
// 0x0010 (0x0210 - 0x0200)
class UAtomListenerFocusPoint final : public USceneComponent
{
public:
	float                                         DistanceFocusLevel;                                // 0x01F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirectionFocusLevel;                               // 0x01FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_200[0x10];                                     // 0x0200(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomListenerFocusPoint">();
	}
	static class UAtomListenerFocusPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomListenerFocusPoint>();
	}
};
static_assert(alignof(UAtomListenerFocusPoint) == 0x000010, "Wrong alignment on UAtomListenerFocusPoint");
static_assert(sizeof(UAtomListenerFocusPoint) == 0x000210, "Wrong size on UAtomListenerFocusPoint");
static_assert(offsetof(UAtomListenerFocusPoint, DistanceFocusLevel) == 0x0001F8, "Member 'UAtomListenerFocusPoint::DistanceFocusLevel' has a wrong offset!");
static_assert(offsetof(UAtomListenerFocusPoint, DirectionFocusLevel) == 0x0001FC, "Member 'UAtomListenerFocusPoint::DirectionFocusLevel' has a wrong offset!");

// Class CriWareRuntime.AtomParameterComponent
// 0x0010 (0x00C0 - 0x00B0)
class UAtomParameterComponent final : public UActorComponent
{
public:
	class UAtomSoundObject*                       SoundObject;                                       // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtom3dRegion*                          Region;                                            // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomParameterComponent">();
	}
	static class UAtomParameterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomParameterComponent>();
	}
};
static_assert(alignof(UAtomParameterComponent) == 0x000008, "Wrong alignment on UAtomParameterComponent");
static_assert(sizeof(UAtomParameterComponent) == 0x0000C0, "Wrong size on UAtomParameterComponent");
static_assert(offsetof(UAtomParameterComponent, SoundObject) == 0x0000B0, "Member 'UAtomParameterComponent::SoundObject' has a wrong offset!");
static_assert(offsetof(UAtomParameterComponent, Region) == 0x0000B8, "Member 'UAtomParameterComponent::Region' has a wrong offset!");

// Class CriWareRuntime.AtomProfileData
// 0x0000 (0x0028 - 0x0028)
class UAtomProfileData final : public UBlueprintFunctionLibrary
{
public:
	static void CriWareAdx2ProfileDataSort(const TArray<struct FAtomProfileItem>& Original_item, EAtomProfileSortType Sort_type, EAtomSortOrderType Order_type, TArray<struct FAtomProfileItem>* Sorted_item);
	static TArray<struct FAtomProfileItem> CriWareAdx2ProfileDataUpdate(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomProfileData">();
	}
	static class UAtomProfileData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomProfileData>();
	}
};
static_assert(alignof(UAtomProfileData) == 0x000008, "Wrong alignment on UAtomProfileData");
static_assert(sizeof(UAtomProfileData) == 0x000028, "Wrong size on UAtomProfileData");

// Class CriWareRuntime.AtomSound
// 0x0008 (0x0228 - 0x0220)
class AAtomSound final : public AActor
{
public:
	class UAtomComponent*                         AtomComponent;                                     // 0x0220(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSound">();
	}
	static class AAtomSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomSound>();
	}
};
static_assert(alignof(AAtomSound) == 0x000008, "Wrong alignment on AAtomSound");
static_assert(sizeof(AAtomSound) == 0x000228, "Wrong size on AAtomSound");
static_assert(offsetof(AAtomSound, AtomComponent) == 0x000220, "Member 'AAtomSound::AtomComponent' has a wrong offset!");

// Class CriWareRuntime.AtomSoundData
// 0x0010 (0x0230 - 0x0220)
class AAtomSoundData final : public AActor
{
public:
	class USoundAtomCueSheet*                     CueSheet;                                          // 0x0220(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSoundData">();
	}
	static class AAtomSoundData* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomSoundData>();
	}
};
static_assert(alignof(AAtomSoundData) == 0x000008, "Wrong alignment on AAtomSoundData");
static_assert(sizeof(AAtomSoundData) == 0x000230, "Wrong size on AAtomSoundData");
static_assert(offsetof(AAtomSoundData, CueSheet) == 0x000220, "Member 'AAtomSoundData::CueSheet' has a wrong offset!");

// Class CriWareRuntime.AtomSoundObject
// 0x0018 (0x0048 - 0x0030)
class UAtomSoundObject final : public UDataAsset
{
public:
	bool                                          EnableVoiceLimitScope;                             // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableCategoryCueLimitScope;                       // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x16];                                      // 0x0032(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSoundObject">();
	}
	static class UAtomSoundObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSoundObject>();
	}
};
static_assert(alignof(UAtomSoundObject) == 0x000008, "Wrong alignment on UAtomSoundObject");
static_assert(sizeof(UAtomSoundObject) == 0x000048, "Wrong size on UAtomSoundObject");
static_assert(offsetof(UAtomSoundObject, EnableVoiceLimitScope) == 0x000030, "Member 'UAtomSoundObject::EnableVoiceLimitScope' has a wrong offset!");
