#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DebugMenuPlugin

#include "Basic.hpp"

#include "DebugMenuPlugin_structs.hpp"


namespace SDK::Params
{

// Function DebugMenuPlugin.DebugMenuBPI.Create
// 0x0020 (0x0020 - 0x0000)
struct DebugMenuBPI_Create final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 InClass;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         X;                                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DebugMenuBPI_Create) == 0x000008, "Wrong alignment on DebugMenuBPI_Create");
static_assert(sizeof(DebugMenuBPI_Create) == 0x000020, "Wrong size on DebugMenuBPI_Create");
static_assert(offsetof(DebugMenuBPI_Create, WorldContextObject) == 0x000000, "Member 'DebugMenuBPI_Create::WorldContextObject' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_Create, InClass) == 0x000008, "Member 'DebugMenuBPI_Create::InClass' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_Create, X) == 0x000010, "Member 'DebugMenuBPI_Create::X' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_Create, Y) == 0x000014, "Member 'DebugMenuBPI_Create::Y' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_Create, ReturnValue) == 0x000018, "Member 'DebugMenuBPI_Create::ReturnValue' has a wrong offset!");

// Function DebugMenuPlugin.DebugMenuBPI.CreateBool
// 0x0050 (0x0050 - 0x0000)
struct DebugMenuBPI_CreateBool final
{
public:
	TDelegate<void(bool Value, EDebugMenuItemEventType Type)> Event;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FDebugMenuItem                         InMenuItem;                                        // 0x0010(0x0010)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 MenuName;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Default;                                           // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItem                         OutMenuItem;                                       // 0x0038(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DebugMenuBPI_CreateBool) == 0x000008, "Wrong alignment on DebugMenuBPI_CreateBool");
static_assert(sizeof(DebugMenuBPI_CreateBool) == 0x000050, "Wrong size on DebugMenuBPI_CreateBool");
static_assert(offsetof(DebugMenuBPI_CreateBool, Event) == 0x000000, "Member 'DebugMenuBPI_CreateBool::Event' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_CreateBool, InMenuItem) == 0x000010, "Member 'DebugMenuBPI_CreateBool::InMenuItem' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_CreateBool, MenuName) == 0x000020, "Member 'DebugMenuBPI_CreateBool::MenuName' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_CreateBool, Default) == 0x000030, "Member 'DebugMenuBPI_CreateBool::Default' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_CreateBool, OutMenuItem) == 0x000038, "Member 'DebugMenuBPI_CreateBool::OutMenuItem' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_CreateBool, ReturnValue) == 0x000048, "Member 'DebugMenuBPI_CreateBool::ReturnValue' has a wrong offset!");

// Function DebugMenuPlugin.DebugMenuBPI.CreateCaption
// 0x0028 (0x0028 - 0x0000)
struct DebugMenuBPI_CreateCaption final
{
public:
	class FString                                 CaptionName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDebugMenuItem                         OutMenuItem;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DebugMenuBPI_CreateCaption) == 0x000008, "Wrong alignment on DebugMenuBPI_CreateCaption");
static_assert(sizeof(DebugMenuBPI_CreateCaption) == 0x000028, "Wrong size on DebugMenuBPI_CreateCaption");
static_assert(offsetof(DebugMenuBPI_CreateCaption, CaptionName) == 0x000000, "Member 'DebugMenuBPI_CreateCaption::CaptionName' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_CreateCaption, OutMenuItem) == 0x000010, "Member 'DebugMenuBPI_CreateCaption::OutMenuItem' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_CreateCaption, ReturnValue) == 0x000020, "Member 'DebugMenuBPI_CreateCaption::ReturnValue' has a wrong offset!");

// Function DebugMenuPlugin.DebugMenuBPI.CreateMenu
// 0x0048 (0x0048 - 0x0000)
struct DebugMenuBPI_CreateMenu final
{
public:
	TDelegate<void(const struct FDebugMenuItem& MenuItem, EDebugMenuItemEventType Type)> Event;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FDebugMenuItem                         InMenuItem;                                        // 0x0010(0x0010)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 MenuName;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDebugMenuItem                         OutMenuItem;                                       // 0x0030(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DebugMenuBPI_CreateMenu) == 0x000008, "Wrong alignment on DebugMenuBPI_CreateMenu");
static_assert(sizeof(DebugMenuBPI_CreateMenu) == 0x000048, "Wrong size on DebugMenuBPI_CreateMenu");
static_assert(offsetof(DebugMenuBPI_CreateMenu, Event) == 0x000000, "Member 'DebugMenuBPI_CreateMenu::Event' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_CreateMenu, InMenuItem) == 0x000010, "Member 'DebugMenuBPI_CreateMenu::InMenuItem' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_CreateMenu, MenuName) == 0x000020, "Member 'DebugMenuBPI_CreateMenu::MenuName' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_CreateMenu, OutMenuItem) == 0x000030, "Member 'DebugMenuBPI_CreateMenu::OutMenuItem' has a wrong offset!");
static_assert(offsetof(DebugMenuBPI_CreateMenu, ReturnValue) == 0x000040, "Member 'DebugMenuBPI_CreateMenu::ReturnValue' has a wrong offset!");

// Function DebugMenuPlugin.DebugMenuBPI.Exit
// 0x0001 (0x0001 - 0x0000)
struct DebugMenuBPI_Exit final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DebugMenuBPI_Exit) == 0x000001, "Wrong alignment on DebugMenuBPI_Exit");
static_assert(sizeof(DebugMenuBPI_Exit) == 0x000001, "Wrong size on DebugMenuBPI_Exit");
static_assert(offsetof(DebugMenuBPI_Exit, ReturnValue) == 0x000000, "Member 'DebugMenuBPI_Exit::ReturnValue' has a wrong offset!");

}

