#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicMontageParams

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DynamicMontageParams.DynamicMontageParams
// 0x0018 (0x0018 - 0x0000)
struct FDynamicMontageParams final
{
public:
	class UAnimSequenceBase*                      Animation_2_5E5C122A46BA0311400556A423FC05D0;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendInTime_10_1C5E8446412E51FFA0B03AB8BD32E6E8;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendOutTime_12_79DFD9804491A7DF0813EFA923002F9C;  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayRate_5_4724216C43D83EADF735F0AFEE9947EB;       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartTime_7_3C5D7A3849D194E10AB51CA0344EBC8D;      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FDynamicMontageParams) == 0x000008, "Wrong alignment on FDynamicMontageParams");
static_assert(sizeof(FDynamicMontageParams) == 0x000018, "Wrong size on FDynamicMontageParams");
static_assert(offsetof(FDynamicMontageParams, Animation_2_5E5C122A46BA0311400556A423FC05D0) == 0x000000, "Member 'FDynamicMontageParams::Animation_2_5E5C122A46BA0311400556A423FC05D0' has a wrong offset!");
static_assert(offsetof(FDynamicMontageParams, BlendInTime_10_1C5E8446412E51FFA0B03AB8BD32E6E8) == 0x000008, "Member 'FDynamicMontageParams::BlendInTime_10_1C5E8446412E51FFA0B03AB8BD32E6E8' has a wrong offset!");
static_assert(offsetof(FDynamicMontageParams, BlendOutTime_12_79DFD9804491A7DF0813EFA923002F9C) == 0x00000C, "Member 'FDynamicMontageParams::BlendOutTime_12_79DFD9804491A7DF0813EFA923002F9C' has a wrong offset!");
static_assert(offsetof(FDynamicMontageParams, PlayRate_5_4724216C43D83EADF735F0AFEE9947EB) == 0x000010, "Member 'FDynamicMontageParams::PlayRate_5_4724216C43D83EADF735F0AFEE9947EB' has a wrong offset!");
static_assert(offsetof(FDynamicMontageParams, StartTime_7_3C5D7A3849D194E10AB51CA0344EBC8D) == 0x000014, "Member 'FDynamicMontageParams::StartTime_7_3C5D7A3849D194E10AB51CA0344EBC8D' has a wrong offset!");

}

