#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EditableMesh

#include "Basic.hpp"

#include "MeshDescription_structs.hpp"
#include "EditableMesh_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EditableMesh.EditableMesh.InvalidEdgeID
// 0x0004 (0x0004 - 0x0000)
struct EditableMesh_InvalidEdgeID final
{
public:
	struct FEdgeID                                ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_InvalidEdgeID) == 0x000004, "Wrong alignment on EditableMesh_InvalidEdgeID");
static_assert(sizeof(EditableMesh_InvalidEdgeID) == 0x000004, "Wrong size on EditableMesh_InvalidEdgeID");
static_assert(offsetof(EditableMesh_InvalidEdgeID, ReturnValue) == 0x000000, "Member 'EditableMesh_InvalidEdgeID::ReturnValue' has a wrong offset!");

// Function EditableMesh.EditableMesh.InvalidPolygonGroupID
// 0x0004 (0x0004 - 0x0000)
struct EditableMesh_InvalidPolygonGroupID final
{
public:
	struct FPolygonGroupID                        ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_InvalidPolygonGroupID) == 0x000004, "Wrong alignment on EditableMesh_InvalidPolygonGroupID");
static_assert(sizeof(EditableMesh_InvalidPolygonGroupID) == 0x000004, "Wrong size on EditableMesh_InvalidPolygonGroupID");
static_assert(offsetof(EditableMesh_InvalidPolygonGroupID, ReturnValue) == 0x000000, "Member 'EditableMesh_InvalidPolygonGroupID::ReturnValue' has a wrong offset!");

// Function EditableMesh.EditableMesh.InvalidPolygonID
// 0x0004 (0x0004 - 0x0000)
struct EditableMesh_InvalidPolygonID final
{
public:
	struct FPolygonID                             ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_InvalidPolygonID) == 0x000004, "Wrong alignment on EditableMesh_InvalidPolygonID");
static_assert(sizeof(EditableMesh_InvalidPolygonID) == 0x000004, "Wrong size on EditableMesh_InvalidPolygonID");
static_assert(offsetof(EditableMesh_InvalidPolygonID, ReturnValue) == 0x000000, "Member 'EditableMesh_InvalidPolygonID::ReturnValue' has a wrong offset!");

// Function EditableMesh.EditableMesh.InvalidVertexID
// 0x0004 (0x0004 - 0x0000)
struct EditableMesh_InvalidVertexID final
{
public:
	struct FVertexID                              ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_InvalidVertexID) == 0x000004, "Wrong alignment on EditableMesh_InvalidVertexID");
static_assert(sizeof(EditableMesh_InvalidVertexID) == 0x000004, "Wrong size on EditableMesh_InvalidVertexID");
static_assert(offsetof(EditableMesh_InvalidVertexID, ReturnValue) == 0x000000, "Member 'EditableMesh_InvalidVertexID::ReturnValue' has a wrong offset!");

// Function EditableMesh.EditableMesh.MakeEdgeID
// 0x0008 (0x0008 - 0x0000)
struct EditableMesh_MakeEdgeID final
{
public:
	int32                                         EdgeIndex;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEdgeID                                ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_MakeEdgeID) == 0x000004, "Wrong alignment on EditableMesh_MakeEdgeID");
static_assert(sizeof(EditableMesh_MakeEdgeID) == 0x000008, "Wrong size on EditableMesh_MakeEdgeID");
static_assert(offsetof(EditableMesh_MakeEdgeID, EdgeIndex) == 0x000000, "Member 'EditableMesh_MakeEdgeID::EdgeIndex' has a wrong offset!");
static_assert(offsetof(EditableMesh_MakeEdgeID, ReturnValue) == 0x000004, "Member 'EditableMesh_MakeEdgeID::ReturnValue' has a wrong offset!");

// Function EditableMesh.EditableMesh.MakePolygonGroupID
// 0x0008 (0x0008 - 0x0000)
struct EditableMesh_MakePolygonGroupID final
{
public:
	int32                                         PolygonGroupIndex;                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPolygonGroupID                        ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_MakePolygonGroupID) == 0x000004, "Wrong alignment on EditableMesh_MakePolygonGroupID");
static_assert(sizeof(EditableMesh_MakePolygonGroupID) == 0x000008, "Wrong size on EditableMesh_MakePolygonGroupID");
static_assert(offsetof(EditableMesh_MakePolygonGroupID, PolygonGroupIndex) == 0x000000, "Member 'EditableMesh_MakePolygonGroupID::PolygonGroupIndex' has a wrong offset!");
static_assert(offsetof(EditableMesh_MakePolygonGroupID, ReturnValue) == 0x000004, "Member 'EditableMesh_MakePolygonGroupID::ReturnValue' has a wrong offset!");

// Function EditableMesh.EditableMesh.MakePolygonID
// 0x0008 (0x0008 - 0x0000)
struct EditableMesh_MakePolygonID final
{
public:
	int32                                         PolygonIndex;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPolygonID                             ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_MakePolygonID) == 0x000004, "Wrong alignment on EditableMesh_MakePolygonID");
static_assert(sizeof(EditableMesh_MakePolygonID) == 0x000008, "Wrong size on EditableMesh_MakePolygonID");
static_assert(offsetof(EditableMesh_MakePolygonID, PolygonIndex) == 0x000000, "Member 'EditableMesh_MakePolygonID::PolygonIndex' has a wrong offset!");
static_assert(offsetof(EditableMesh_MakePolygonID, ReturnValue) == 0x000004, "Member 'EditableMesh_MakePolygonID::ReturnValue' has a wrong offset!");

// Function EditableMesh.EditableMesh.MakeVertexID
// 0x0008 (0x0008 - 0x0000)
struct EditableMesh_MakeVertexID final
{
public:
	int32                                         VertexIndex;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVertexID                              ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_MakeVertexID) == 0x000004, "Wrong alignment on EditableMesh_MakeVertexID");
static_assert(sizeof(EditableMesh_MakeVertexID) == 0x000008, "Wrong size on EditableMesh_MakeVertexID");
static_assert(offsetof(EditableMesh_MakeVertexID, VertexIndex) == 0x000000, "Member 'EditableMesh_MakeVertexID::VertexIndex' has a wrong offset!");
static_assert(offsetof(EditableMesh_MakeVertexID, ReturnValue) == 0x000004, "Member 'EditableMesh_MakeVertexID::ReturnValue' has a wrong offset!");

// Function EditableMesh.EditableMesh.AssignPolygonsToPolygonGroups
// 0x0018 (0x0018 - 0x0000)
struct EditableMesh_AssignPolygonsToPolygonGroups final
{
public:
	TArray<struct FPolygonGroupForPolygon>        PolygonGroupForPolygons;                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedPolygonGroups;                      // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EditableMesh_AssignPolygonsToPolygonGroups) == 0x000008, "Wrong alignment on EditableMesh_AssignPolygonsToPolygonGroups");
static_assert(sizeof(EditableMesh_AssignPolygonsToPolygonGroups) == 0x000018, "Wrong size on EditableMesh_AssignPolygonsToPolygonGroups");
static_assert(offsetof(EditableMesh_AssignPolygonsToPolygonGroups, PolygonGroupForPolygons) == 0x000000, "Member 'EditableMesh_AssignPolygonsToPolygonGroups::PolygonGroupForPolygons' has a wrong offset!");
static_assert(offsetof(EditableMesh_AssignPolygonsToPolygonGroups, bDeleteOrphanedPolygonGroups) == 0x000010, "Member 'EditableMesh_AssignPolygonsToPolygonGroups::bDeleteOrphanedPolygonGroups' has a wrong offset!");

// Function EditableMesh.EditableMesh.BevelPolygons
// 0x0038 (0x0038 - 0x0000)
struct EditableMesh_BevelPolygons final
{
public:
	TArray<struct FPolygonID>                     PolygonIDs;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         BevelFixedDistance;                                // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BevelProgressTowardCenter;                         // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPolygonID>                     OutNewCenterPolygonIDs;                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPolygonID>                     OutNewSidePolygonIDs;                              // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_BevelPolygons) == 0x000008, "Wrong alignment on EditableMesh_BevelPolygons");
static_assert(sizeof(EditableMesh_BevelPolygons) == 0x000038, "Wrong size on EditableMesh_BevelPolygons");
static_assert(offsetof(EditableMesh_BevelPolygons, PolygonIDs) == 0x000000, "Member 'EditableMesh_BevelPolygons::PolygonIDs' has a wrong offset!");
static_assert(offsetof(EditableMesh_BevelPolygons, BevelFixedDistance) == 0x000010, "Member 'EditableMesh_BevelPolygons::BevelFixedDistance' has a wrong offset!");
static_assert(offsetof(EditableMesh_BevelPolygons, BevelProgressTowardCenter) == 0x000014, "Member 'EditableMesh_BevelPolygons::BevelProgressTowardCenter' has a wrong offset!");
static_assert(offsetof(EditableMesh_BevelPolygons, OutNewCenterPolygonIDs) == 0x000018, "Member 'EditableMesh_BevelPolygons::OutNewCenterPolygonIDs' has a wrong offset!");
static_assert(offsetof(EditableMesh_BevelPolygons, OutNewSidePolygonIDs) == 0x000028, "Member 'EditableMesh_BevelPolygons::OutNewSidePolygonIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.ChangePolygonsVertexInstances
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_ChangePolygonsVertexInstances final
{
public:
	TArray<struct FChangeVertexInstancesForPolygon> VertexInstancesForPolygons;                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_ChangePolygonsVertexInstances) == 0x000008, "Wrong alignment on EditableMesh_ChangePolygonsVertexInstances");
static_assert(sizeof(EditableMesh_ChangePolygonsVertexInstances) == 0x000010, "Wrong size on EditableMesh_ChangePolygonsVertexInstances");
static_assert(offsetof(EditableMesh_ChangePolygonsVertexInstances, VertexInstancesForPolygons) == 0x000000, "Member 'EditableMesh_ChangePolygonsVertexInstances::VertexInstancesForPolygons' has a wrong offset!");

// Function EditableMesh.EditableMesh.CommitInstance
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_CommitInstance final
{
public:
	class UPrimitiveComponent*                    ComponentToInstanceTo;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditableMesh*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_CommitInstance) == 0x000008, "Wrong alignment on EditableMesh_CommitInstance");
static_assert(sizeof(EditableMesh_CommitInstance) == 0x000010, "Wrong size on EditableMesh_CommitInstance");
static_assert(offsetof(EditableMesh_CommitInstance, ComponentToInstanceTo) == 0x000000, "Member 'EditableMesh_CommitInstance::ComponentToInstanceTo' has a wrong offset!");
static_assert(offsetof(EditableMesh_CommitInstance, ReturnValue) == 0x000008, "Member 'EditableMesh_CommitInstance::ReturnValue' has a wrong offset!");

// Function EditableMesh.EditableMesh.CreateEdges
// 0x0020 (0x0020 - 0x0000)
struct EditableMesh_CreateEdges final
{
public:
	TArray<struct FEdgeToCreate>                  EdgesToCreate;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FEdgeID>                        OutNewEdgeIDs;                                     // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_CreateEdges) == 0x000008, "Wrong alignment on EditableMesh_CreateEdges");
static_assert(sizeof(EditableMesh_CreateEdges) == 0x000020, "Wrong size on EditableMesh_CreateEdges");
static_assert(offsetof(EditableMesh_CreateEdges, EdgesToCreate) == 0x000000, "Member 'EditableMesh_CreateEdges::EdgesToCreate' has a wrong offset!");
static_assert(offsetof(EditableMesh_CreateEdges, OutNewEdgeIDs) == 0x000010, "Member 'EditableMesh_CreateEdges::OutNewEdgeIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.CreateEmptyVertexRange
// 0x0018 (0x0018 - 0x0000)
struct EditableMesh_CreateEmptyVertexRange final
{
public:
	int32                                         NumVerticesToCreate;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVertexID>                      OutNewVertexIDs;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_CreateEmptyVertexRange) == 0x000008, "Wrong alignment on EditableMesh_CreateEmptyVertexRange");
static_assert(sizeof(EditableMesh_CreateEmptyVertexRange) == 0x000018, "Wrong size on EditableMesh_CreateEmptyVertexRange");
static_assert(offsetof(EditableMesh_CreateEmptyVertexRange, NumVerticesToCreate) == 0x000000, "Member 'EditableMesh_CreateEmptyVertexRange::NumVerticesToCreate' has a wrong offset!");
static_assert(offsetof(EditableMesh_CreateEmptyVertexRange, OutNewVertexIDs) == 0x000008, "Member 'EditableMesh_CreateEmptyVertexRange::OutNewVertexIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.CreateMissingPolygonPerimeterEdges
// 0x0018 (0x0018 - 0x0000)
struct EditableMesh_CreateMissingPolygonPerimeterEdges final
{
public:
	struct FPolygonID                             PolygonID;                                         // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEdgeID>                        OutNewEdgeIDs;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_CreateMissingPolygonPerimeterEdges) == 0x000008, "Wrong alignment on EditableMesh_CreateMissingPolygonPerimeterEdges");
static_assert(sizeof(EditableMesh_CreateMissingPolygonPerimeterEdges) == 0x000018, "Wrong size on EditableMesh_CreateMissingPolygonPerimeterEdges");
static_assert(offsetof(EditableMesh_CreateMissingPolygonPerimeterEdges, PolygonID) == 0x000000, "Member 'EditableMesh_CreateMissingPolygonPerimeterEdges::PolygonID' has a wrong offset!");
static_assert(offsetof(EditableMesh_CreateMissingPolygonPerimeterEdges, OutNewEdgeIDs) == 0x000008, "Member 'EditableMesh_CreateMissingPolygonPerimeterEdges::OutNewEdgeIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.CreatePolygonGroups
// 0x0020 (0x0020 - 0x0000)
struct EditableMesh_CreatePolygonGroups final
{
public:
	TArray<struct FPolygonGroupToCreate>          PolygonGroupsToCreate;                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FPolygonGroupID>                OutNewPolygonGroupIDs;                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_CreatePolygonGroups) == 0x000008, "Wrong alignment on EditableMesh_CreatePolygonGroups");
static_assert(sizeof(EditableMesh_CreatePolygonGroups) == 0x000020, "Wrong size on EditableMesh_CreatePolygonGroups");
static_assert(offsetof(EditableMesh_CreatePolygonGroups, PolygonGroupsToCreate) == 0x000000, "Member 'EditableMesh_CreatePolygonGroups::PolygonGroupsToCreate' has a wrong offset!");
static_assert(offsetof(EditableMesh_CreatePolygonGroups, OutNewPolygonGroupIDs) == 0x000010, "Member 'EditableMesh_CreatePolygonGroups::OutNewPolygonGroupIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.CreatePolygons
// 0x0030 (0x0030 - 0x0000)
struct EditableMesh_CreatePolygons final
{
public:
	TArray<struct FPolygonToCreate>               PolygonsToCreate;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FPolygonID>                     OutNewPolygonIDs;                                  // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FEdgeID>                        OutNewEdgeIDs;                                     // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_CreatePolygons) == 0x000008, "Wrong alignment on EditableMesh_CreatePolygons");
static_assert(sizeof(EditableMesh_CreatePolygons) == 0x000030, "Wrong size on EditableMesh_CreatePolygons");
static_assert(offsetof(EditableMesh_CreatePolygons, PolygonsToCreate) == 0x000000, "Member 'EditableMesh_CreatePolygons::PolygonsToCreate' has a wrong offset!");
static_assert(offsetof(EditableMesh_CreatePolygons, OutNewPolygonIDs) == 0x000010, "Member 'EditableMesh_CreatePolygons::OutNewPolygonIDs' has a wrong offset!");
static_assert(offsetof(EditableMesh_CreatePolygons, OutNewEdgeIDs) == 0x000020, "Member 'EditableMesh_CreatePolygons::OutNewEdgeIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.CreateVertexInstances
// 0x0020 (0x0020 - 0x0000)
struct EditableMesh_CreateVertexInstances final
{
public:
	TArray<struct FVertexInstanceToCreate>        VertexInstancesToCreate;                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVertexInstanceID>              OutNewVertexInstanceIDs;                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_CreateVertexInstances) == 0x000008, "Wrong alignment on EditableMesh_CreateVertexInstances");
static_assert(sizeof(EditableMesh_CreateVertexInstances) == 0x000020, "Wrong size on EditableMesh_CreateVertexInstances");
static_assert(offsetof(EditableMesh_CreateVertexInstances, VertexInstancesToCreate) == 0x000000, "Member 'EditableMesh_CreateVertexInstances::VertexInstancesToCreate' has a wrong offset!");
static_assert(offsetof(EditableMesh_CreateVertexInstances, OutNewVertexInstanceIDs) == 0x000010, "Member 'EditableMesh_CreateVertexInstances::OutNewVertexInstanceIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.CreateVertices
// 0x0020 (0x0020 - 0x0000)
struct EditableMesh_CreateVertices final
{
public:
	TArray<struct FVertexToCreate>                VerticesToCreate;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVertexID>                      OutNewVertexIDs;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_CreateVertices) == 0x000008, "Wrong alignment on EditableMesh_CreateVertices");
static_assert(sizeof(EditableMesh_CreateVertices) == 0x000020, "Wrong size on EditableMesh_CreateVertices");
static_assert(offsetof(EditableMesh_CreateVertices, VerticesToCreate) == 0x000000, "Member 'EditableMesh_CreateVertices::VerticesToCreate' has a wrong offset!");
static_assert(offsetof(EditableMesh_CreateVertices, OutNewVertexIDs) == 0x000010, "Member 'EditableMesh_CreateVertices::OutNewVertexIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.DeleteEdgeAndConnectedPolygons
// 0x0008 (0x0008 - 0x0000)
struct EditableMesh_DeleteEdgeAndConnectedPolygons final
{
public:
	struct FEdgeID                                EdgeID;                                            // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedEdges;                              // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedVertices;                           // 0x0005(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedVertexInstances;                    // 0x0006(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteEmptyPolygonGroups;                         // 0x0007(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_DeleteEdgeAndConnectedPolygons) == 0x000004, "Wrong alignment on EditableMesh_DeleteEdgeAndConnectedPolygons");
static_assert(sizeof(EditableMesh_DeleteEdgeAndConnectedPolygons) == 0x000008, "Wrong size on EditableMesh_DeleteEdgeAndConnectedPolygons");
static_assert(offsetof(EditableMesh_DeleteEdgeAndConnectedPolygons, EdgeID) == 0x000000, "Member 'EditableMesh_DeleteEdgeAndConnectedPolygons::EdgeID' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeleteEdgeAndConnectedPolygons, bDeleteOrphanedEdges) == 0x000004, "Member 'EditableMesh_DeleteEdgeAndConnectedPolygons::bDeleteOrphanedEdges' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeleteEdgeAndConnectedPolygons, bDeleteOrphanedVertices) == 0x000005, "Member 'EditableMesh_DeleteEdgeAndConnectedPolygons::bDeleteOrphanedVertices' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeleteEdgeAndConnectedPolygons, bDeleteOrphanedVertexInstances) == 0x000006, "Member 'EditableMesh_DeleteEdgeAndConnectedPolygons::bDeleteOrphanedVertexInstances' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeleteEdgeAndConnectedPolygons, bDeleteEmptyPolygonGroups) == 0x000007, "Member 'EditableMesh_DeleteEdgeAndConnectedPolygons::bDeleteEmptyPolygonGroups' has a wrong offset!");

// Function EditableMesh.EditableMesh.DeleteEdges
// 0x0018 (0x0018 - 0x0000)
struct EditableMesh_DeleteEdges final
{
public:
	TArray<struct FEdgeID>                        EdgeIDsToDelete;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedVertices;                           // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EditableMesh_DeleteEdges) == 0x000008, "Wrong alignment on EditableMesh_DeleteEdges");
static_assert(sizeof(EditableMesh_DeleteEdges) == 0x000018, "Wrong size on EditableMesh_DeleteEdges");
static_assert(offsetof(EditableMesh_DeleteEdges, EdgeIDsToDelete) == 0x000000, "Member 'EditableMesh_DeleteEdges::EdgeIDsToDelete' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeleteEdges, bDeleteOrphanedVertices) == 0x000010, "Member 'EditableMesh_DeleteEdges::bDeleteOrphanedVertices' has a wrong offset!");

// Function EditableMesh.EditableMesh.DeleteOrphanVertices
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_DeleteOrphanVertices final
{
public:
	TArray<struct FVertexID>                      VertexIDsToDelete;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_DeleteOrphanVertices) == 0x000008, "Wrong alignment on EditableMesh_DeleteOrphanVertices");
static_assert(sizeof(EditableMesh_DeleteOrphanVertices) == 0x000010, "Wrong size on EditableMesh_DeleteOrphanVertices");
static_assert(offsetof(EditableMesh_DeleteOrphanVertices, VertexIDsToDelete) == 0x000000, "Member 'EditableMesh_DeleteOrphanVertices::VertexIDsToDelete' has a wrong offset!");

// Function EditableMesh.EditableMesh.DeletePolygonGroups
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_DeletePolygonGroups final
{
public:
	TArray<struct FPolygonGroupID>                PolygonGroupIDs;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_DeletePolygonGroups) == 0x000008, "Wrong alignment on EditableMesh_DeletePolygonGroups");
static_assert(sizeof(EditableMesh_DeletePolygonGroups) == 0x000010, "Wrong size on EditableMesh_DeletePolygonGroups");
static_assert(offsetof(EditableMesh_DeletePolygonGroups, PolygonGroupIDs) == 0x000000, "Member 'EditableMesh_DeletePolygonGroups::PolygonGroupIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.DeletePolygons
// 0x0018 (0x0018 - 0x0000)
struct EditableMesh_DeletePolygons final
{
public:
	TArray<struct FPolygonID>                     PolygonIDsToDelete;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedEdges;                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedVertices;                           // 0x0011(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedVertexInstances;                    // 0x0012(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteEmptyPolygonGroups;                         // 0x0013(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EditableMesh_DeletePolygons) == 0x000008, "Wrong alignment on EditableMesh_DeletePolygons");
static_assert(sizeof(EditableMesh_DeletePolygons) == 0x000018, "Wrong size on EditableMesh_DeletePolygons");
static_assert(offsetof(EditableMesh_DeletePolygons, PolygonIDsToDelete) == 0x000000, "Member 'EditableMesh_DeletePolygons::PolygonIDsToDelete' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeletePolygons, bDeleteOrphanedEdges) == 0x000010, "Member 'EditableMesh_DeletePolygons::bDeleteOrphanedEdges' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeletePolygons, bDeleteOrphanedVertices) == 0x000011, "Member 'EditableMesh_DeletePolygons::bDeleteOrphanedVertices' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeletePolygons, bDeleteOrphanedVertexInstances) == 0x000012, "Member 'EditableMesh_DeletePolygons::bDeleteOrphanedVertexInstances' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeletePolygons, bDeleteEmptyPolygonGroups) == 0x000013, "Member 'EditableMesh_DeletePolygons::bDeleteEmptyPolygonGroups' has a wrong offset!");

// Function EditableMesh.EditableMesh.DeleteVertexAndConnectedEdgesAndPolygons
// 0x0008 (0x0008 - 0x0000)
struct EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons final
{
public:
	struct FVertexID                              VertexID;                                          // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedEdges;                              // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedVertices;                           // 0x0005(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedVertexInstances;                    // 0x0006(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteEmptyPolygonGroups;                         // 0x0007(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons) == 0x000004, "Wrong alignment on EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons");
static_assert(sizeof(EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons) == 0x000008, "Wrong size on EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons");
static_assert(offsetof(EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons, VertexID) == 0x000000, "Member 'EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons::VertexID' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons, bDeleteOrphanedEdges) == 0x000004, "Member 'EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons::bDeleteOrphanedEdges' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons, bDeleteOrphanedVertices) == 0x000005, "Member 'EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons::bDeleteOrphanedVertices' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons, bDeleteOrphanedVertexInstances) == 0x000006, "Member 'EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons::bDeleteOrphanedVertexInstances' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons, bDeleteEmptyPolygonGroups) == 0x000007, "Member 'EditableMesh_DeleteVertexAndConnectedEdgesAndPolygons::bDeleteEmptyPolygonGroups' has a wrong offset!");

// Function EditableMesh.EditableMesh.DeleteVertexInstances
// 0x0018 (0x0018 - 0x0000)
struct EditableMesh_DeleteVertexInstances final
{
public:
	TArray<struct FVertexInstanceID>              VertexInstanceIDsToDelete;                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bDeleteOrphanedVertices;                           // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EditableMesh_DeleteVertexInstances) == 0x000008, "Wrong alignment on EditableMesh_DeleteVertexInstances");
static_assert(sizeof(EditableMesh_DeleteVertexInstances) == 0x000018, "Wrong size on EditableMesh_DeleteVertexInstances");
static_assert(offsetof(EditableMesh_DeleteVertexInstances, VertexInstanceIDsToDelete) == 0x000000, "Member 'EditableMesh_DeleteVertexInstances::VertexInstanceIDsToDelete' has a wrong offset!");
static_assert(offsetof(EditableMesh_DeleteVertexInstances, bDeleteOrphanedVertices) == 0x000010, "Member 'EditableMesh_DeleteVertexInstances::bDeleteOrphanedVertices' has a wrong offset!");

// Function EditableMesh.EditableMesh.EndModification
// 0x0001 (0x0001 - 0x0000)
struct EditableMesh_EndModification final
{
public:
	bool                                          bFromUndo;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_EndModification) == 0x000001, "Wrong alignment on EditableMesh_EndModification");
static_assert(sizeof(EditableMesh_EndModification) == 0x000001, "Wrong size on EditableMesh_EndModification");
static_assert(offsetof(EditableMesh_EndModification, bFromUndo) == 0x000000, "Member 'EditableMesh_EndModification::bFromUndo' has a wrong offset!");

// Function EditableMesh.EditableMesh.ExtendEdges
// 0x0028 (0x0028 - 0x0000)
struct EditableMesh_ExtendEdges final
{
public:
	TArray<struct FEdgeID>                        EdgeIDs;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bWeldNeighbors;                                    // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEdgeID>                        OutNewExtendedEdgeIDs;                             // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_ExtendEdges) == 0x000008, "Wrong alignment on EditableMesh_ExtendEdges");
static_assert(sizeof(EditableMesh_ExtendEdges) == 0x000028, "Wrong size on EditableMesh_ExtendEdges");
static_assert(offsetof(EditableMesh_ExtendEdges, EdgeIDs) == 0x000000, "Member 'EditableMesh_ExtendEdges::EdgeIDs' has a wrong offset!");
static_assert(offsetof(EditableMesh_ExtendEdges, bWeldNeighbors) == 0x000010, "Member 'EditableMesh_ExtendEdges::bWeldNeighbors' has a wrong offset!");
static_assert(offsetof(EditableMesh_ExtendEdges, OutNewExtendedEdgeIDs) == 0x000018, "Member 'EditableMesh_ExtendEdges::OutNewExtendedEdgeIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.ExtendVertices
// 0x0030 (0x0030 - 0x0000)
struct EditableMesh_ExtendVertices final
{
public:
	TArray<struct FVertexID>                      VertexIDs;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOnlyExtendClosestEdge;                            // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReferencePosition;                                 // 0x0014(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVertexID>                      OutNewExtendedVertexIDs;                           // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_ExtendVertices) == 0x000008, "Wrong alignment on EditableMesh_ExtendVertices");
static_assert(sizeof(EditableMesh_ExtendVertices) == 0x000030, "Wrong size on EditableMesh_ExtendVertices");
static_assert(offsetof(EditableMesh_ExtendVertices, VertexIDs) == 0x000000, "Member 'EditableMesh_ExtendVertices::VertexIDs' has a wrong offset!");
static_assert(offsetof(EditableMesh_ExtendVertices, bOnlyExtendClosestEdge) == 0x000010, "Member 'EditableMesh_ExtendVertices::bOnlyExtendClosestEdge' has a wrong offset!");
static_assert(offsetof(EditableMesh_ExtendVertices, ReferencePosition) == 0x000014, "Member 'EditableMesh_ExtendVertices::ReferencePosition' has a wrong offset!");
static_assert(offsetof(EditableMesh_ExtendVertices, OutNewExtendedVertexIDs) == 0x000020, "Member 'EditableMesh_ExtendVertices::OutNewExtendedVertexIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.ExtrudePolygons
// 0x0028 (0x0028 - 0x0000)
struct EditableMesh_ExtrudePolygons final
{
public:
	TArray<struct FPolygonID>                     Polygons;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ExtrudeDistance;                                   // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepNeighborsTogether;                            // 0x0014(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPolygonID>                     OutNewExtrudedFrontPolygons;                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_ExtrudePolygons) == 0x000008, "Wrong alignment on EditableMesh_ExtrudePolygons");
static_assert(sizeof(EditableMesh_ExtrudePolygons) == 0x000028, "Wrong size on EditableMesh_ExtrudePolygons");
static_assert(offsetof(EditableMesh_ExtrudePolygons, Polygons) == 0x000000, "Member 'EditableMesh_ExtrudePolygons::Polygons' has a wrong offset!");
static_assert(offsetof(EditableMesh_ExtrudePolygons, ExtrudeDistance) == 0x000010, "Member 'EditableMesh_ExtrudePolygons::ExtrudeDistance' has a wrong offset!");
static_assert(offsetof(EditableMesh_ExtrudePolygons, bKeepNeighborsTogether) == 0x000014, "Member 'EditableMesh_ExtrudePolygons::bKeepNeighborsTogether' has a wrong offset!");
static_assert(offsetof(EditableMesh_ExtrudePolygons, OutNewExtrudedFrontPolygons) == 0x000018, "Member 'EditableMesh_ExtrudePolygons::OutNewExtrudedFrontPolygons' has a wrong offset!");

// Function EditableMesh.EditableMesh.FlipPolygons
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_FlipPolygons final
{
public:
	TArray<struct FPolygonID>                     PolygonIDs;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_FlipPolygons) == 0x000008, "Wrong alignment on EditableMesh_FlipPolygons");
static_assert(sizeof(EditableMesh_FlipPolygons) == 0x000010, "Wrong size on EditableMesh_FlipPolygons");
static_assert(offsetof(EditableMesh_FlipPolygons, PolygonIDs) == 0x000000, "Member 'EditableMesh_FlipPolygons::PolygonIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.GeneratePolygonTangentsAndNormals
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_GeneratePolygonTangentsAndNormals final
{
public:
	TArray<struct FPolygonID>                     PolygonIDs;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_GeneratePolygonTangentsAndNormals) == 0x000008, "Wrong alignment on EditableMesh_GeneratePolygonTangentsAndNormals");
static_assert(sizeof(EditableMesh_GeneratePolygonTangentsAndNormals) == 0x000010, "Wrong size on EditableMesh_GeneratePolygonTangentsAndNormals");
static_assert(offsetof(EditableMesh_GeneratePolygonTangentsAndNormals, PolygonIDs) == 0x000000, "Member 'EditableMesh_GeneratePolygonTangentsAndNormals::PolygonIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.InsertEdgeLoop
// 0x0028 (0x0028 - 0x0000)
struct EditableMesh_InsertEdgeLoop final
{
public:
	struct FEdgeID                                EdgeID;                                            // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Splits;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FEdgeID>                        OutNewEdgeIDs;                                     // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_InsertEdgeLoop) == 0x000008, "Wrong alignment on EditableMesh_InsertEdgeLoop");
static_assert(sizeof(EditableMesh_InsertEdgeLoop) == 0x000028, "Wrong size on EditableMesh_InsertEdgeLoop");
static_assert(offsetof(EditableMesh_InsertEdgeLoop, EdgeID) == 0x000000, "Member 'EditableMesh_InsertEdgeLoop::EdgeID' has a wrong offset!");
static_assert(offsetof(EditableMesh_InsertEdgeLoop, Splits) == 0x000008, "Member 'EditableMesh_InsertEdgeLoop::Splits' has a wrong offset!");
static_assert(offsetof(EditableMesh_InsertEdgeLoop, OutNewEdgeIDs) == 0x000018, "Member 'EditableMesh_InsertEdgeLoop::OutNewEdgeIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.InsetPolygons
// 0x0040 (0x0040 - 0x0000)
struct EditableMesh_InsetPolygons final
{
public:
	TArray<struct FPolygonID>                     PolygonIDs;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         InsetFixedDistance;                                // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InsetProgressTowardCenter;                         // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInsetPolygonsMode                            Mode;                                              // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPolygonID>                     OutNewCenterPolygonIDs;                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPolygonID>                     OutNewSidePolygonIDs;                              // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_InsetPolygons) == 0x000008, "Wrong alignment on EditableMesh_InsetPolygons");
static_assert(sizeof(EditableMesh_InsetPolygons) == 0x000040, "Wrong size on EditableMesh_InsetPolygons");
static_assert(offsetof(EditableMesh_InsetPolygons, PolygonIDs) == 0x000000, "Member 'EditableMesh_InsetPolygons::PolygonIDs' has a wrong offset!");
static_assert(offsetof(EditableMesh_InsetPolygons, InsetFixedDistance) == 0x000010, "Member 'EditableMesh_InsetPolygons::InsetFixedDistance' has a wrong offset!");
static_assert(offsetof(EditableMesh_InsetPolygons, InsetProgressTowardCenter) == 0x000014, "Member 'EditableMesh_InsetPolygons::InsetProgressTowardCenter' has a wrong offset!");
static_assert(offsetof(EditableMesh_InsetPolygons, Mode) == 0x000018, "Member 'EditableMesh_InsetPolygons::Mode' has a wrong offset!");
static_assert(offsetof(EditableMesh_InsetPolygons, OutNewCenterPolygonIDs) == 0x000020, "Member 'EditableMesh_InsetPolygons::OutNewCenterPolygonIDs' has a wrong offset!");
static_assert(offsetof(EditableMesh_InsetPolygons, OutNewSidePolygonIDs) == 0x000030, "Member 'EditableMesh_InsetPolygons::OutNewSidePolygonIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.MoveVertices
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_MoveVertices final
{
public:
	TArray<struct FVertexToMove>                  VerticesToMove;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_MoveVertices) == 0x000008, "Wrong alignment on EditableMesh_MoveVertices");
static_assert(sizeof(EditableMesh_MoveVertices) == 0x000010, "Wrong size on EditableMesh_MoveVertices");
static_assert(offsetof(EditableMesh_MoveVertices, VerticesToMove) == 0x000000, "Member 'EditableMesh_MoveVertices::VerticesToMove' has a wrong offset!");

// Function EditableMesh.EditableMesh.QuadrangulateMesh
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_QuadrangulateMesh final
{
public:
	TArray<struct FPolygonID>                     OutNewPolygonIDs;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_QuadrangulateMesh) == 0x000008, "Wrong alignment on EditableMesh_QuadrangulateMesh");
static_assert(sizeof(EditableMesh_QuadrangulateMesh) == 0x000010, "Wrong size on EditableMesh_QuadrangulateMesh");
static_assert(offsetof(EditableMesh_QuadrangulateMesh, OutNewPolygonIDs) == 0x000000, "Member 'EditableMesh_QuadrangulateMesh::OutNewPolygonIDs' has a wrong offset!");

// Function EditableMesh.EditableMesh.RevertInstance
// 0x0008 (0x0008 - 0x0000)
struct EditableMesh_RevertInstance final
{
public:
	class UEditableMesh*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_RevertInstance) == 0x000008, "Wrong alignment on EditableMesh_RevertInstance");
static_assert(sizeof(EditableMesh_RevertInstance) == 0x000008, "Wrong size on EditableMesh_RevertInstance");
static_assert(offsetof(EditableMesh_RevertInstance, ReturnValue) == 0x000000, "Member 'EditableMesh_RevertInstance::ReturnValue' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetAllowCompact
// 0x0001 (0x0001 - 0x0000)
struct EditableMesh_SetAllowCompact final
{
public:
	bool                                          bInAllowCompact;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetAllowCompact) == 0x000001, "Wrong alignment on EditableMesh_SetAllowCompact");
static_assert(sizeof(EditableMesh_SetAllowCompact) == 0x000001, "Wrong size on EditableMesh_SetAllowCompact");
static_assert(offsetof(EditableMesh_SetAllowCompact, bInAllowCompact) == 0x000000, "Member 'EditableMesh_SetAllowCompact::bInAllowCompact' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetAllowSpatialDatabase
// 0x0001 (0x0001 - 0x0000)
struct EditableMesh_SetAllowSpatialDatabase final
{
public:
	bool                                          bInAllowSpatialDatabase;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetAllowSpatialDatabase) == 0x000001, "Wrong alignment on EditableMesh_SetAllowSpatialDatabase");
static_assert(sizeof(EditableMesh_SetAllowSpatialDatabase) == 0x000001, "Wrong size on EditableMesh_SetAllowSpatialDatabase");
static_assert(offsetof(EditableMesh_SetAllowSpatialDatabase, bInAllowSpatialDatabase) == 0x000000, "Member 'EditableMesh_SetAllowSpatialDatabase::bInAllowSpatialDatabase' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetAllowUndo
// 0x0001 (0x0001 - 0x0000)
struct EditableMesh_SetAllowUndo final
{
public:
	bool                                          bInAllowUndo;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetAllowUndo) == 0x000001, "Wrong alignment on EditableMesh_SetAllowUndo");
static_assert(sizeof(EditableMesh_SetAllowUndo) == 0x000001, "Wrong size on EditableMesh_SetAllowUndo");
static_assert(offsetof(EditableMesh_SetAllowUndo, bInAllowUndo) == 0x000000, "Member 'EditableMesh_SetAllowUndo::bInAllowUndo' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetEdgesAttributes
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_SetEdgesAttributes final
{
public:
	TArray<struct FAttributesForEdge>             AttributesForEdges;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetEdgesAttributes) == 0x000008, "Wrong alignment on EditableMesh_SetEdgesAttributes");
static_assert(sizeof(EditableMesh_SetEdgesAttributes) == 0x000010, "Wrong size on EditableMesh_SetEdgesAttributes");
static_assert(offsetof(EditableMesh_SetEdgesAttributes, AttributesForEdges) == 0x000000, "Member 'EditableMesh_SetEdgesAttributes::AttributesForEdges' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetEdgesCreaseSharpness
// 0x0020 (0x0020 - 0x0000)
struct EditableMesh_SetEdgesCreaseSharpness final
{
public:
	TArray<struct FEdgeID>                        EdgeIDs;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 EdgesNewCreaseSharpness;                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetEdgesCreaseSharpness) == 0x000008, "Wrong alignment on EditableMesh_SetEdgesCreaseSharpness");
static_assert(sizeof(EditableMesh_SetEdgesCreaseSharpness) == 0x000020, "Wrong size on EditableMesh_SetEdgesCreaseSharpness");
static_assert(offsetof(EditableMesh_SetEdgesCreaseSharpness, EdgeIDs) == 0x000000, "Member 'EditableMesh_SetEdgesCreaseSharpness::EdgeIDs' has a wrong offset!");
static_assert(offsetof(EditableMesh_SetEdgesCreaseSharpness, EdgesNewCreaseSharpness) == 0x000010, "Member 'EditableMesh_SetEdgesCreaseSharpness::EdgesNewCreaseSharpness' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetEdgesHardness
// 0x0020 (0x0020 - 0x0000)
struct EditableMesh_SetEdgesHardness final
{
public:
	TArray<struct FEdgeID>                        EdgeIDs;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<bool>                                  EdgesNewIsHard;                                    // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetEdgesHardness) == 0x000008, "Wrong alignment on EditableMesh_SetEdgesHardness");
static_assert(sizeof(EditableMesh_SetEdgesHardness) == 0x000020, "Wrong size on EditableMesh_SetEdgesHardness");
static_assert(offsetof(EditableMesh_SetEdgesHardness, EdgeIDs) == 0x000000, "Member 'EditableMesh_SetEdgesHardness::EdgeIDs' has a wrong offset!");
static_assert(offsetof(EditableMesh_SetEdgesHardness, EdgesNewIsHard) == 0x000010, "Member 'EditableMesh_SetEdgesHardness::EdgesNewIsHard' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetEdgesHardnessAutomatically
// 0x0018 (0x0018 - 0x0000)
struct EditableMesh_SetEdgesHardnessAutomatically final
{
public:
	TArray<struct FEdgeID>                        EdgeIDs;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         MaxDotProductForSoftEdge;                          // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EditableMesh_SetEdgesHardnessAutomatically) == 0x000008, "Wrong alignment on EditableMesh_SetEdgesHardnessAutomatically");
static_assert(sizeof(EditableMesh_SetEdgesHardnessAutomatically) == 0x000018, "Wrong size on EditableMesh_SetEdgesHardnessAutomatically");
static_assert(offsetof(EditableMesh_SetEdgesHardnessAutomatically, EdgeIDs) == 0x000000, "Member 'EditableMesh_SetEdgesHardnessAutomatically::EdgeIDs' has a wrong offset!");
static_assert(offsetof(EditableMesh_SetEdgesHardnessAutomatically, MaxDotProductForSoftEdge) == 0x000010, "Member 'EditableMesh_SetEdgesHardnessAutomatically::MaxDotProductForSoftEdge' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetPolygonsVertexAttributes
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_SetPolygonsVertexAttributes final
{
public:
	TArray<struct FVertexAttributesForPolygon>    VertexAttributesForPolygons;                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetPolygonsVertexAttributes) == 0x000008, "Wrong alignment on EditableMesh_SetPolygonsVertexAttributes");
static_assert(sizeof(EditableMesh_SetPolygonsVertexAttributes) == 0x000010, "Wrong size on EditableMesh_SetPolygonsVertexAttributes");
static_assert(offsetof(EditableMesh_SetPolygonsVertexAttributes, VertexAttributesForPolygons) == 0x000000, "Member 'EditableMesh_SetPolygonsVertexAttributes::VertexAttributesForPolygons' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetSubdivisionCount
// 0x0004 (0x0004 - 0x0000)
struct EditableMesh_SetSubdivisionCount final
{
public:
	int32                                         NewSubdivisionCount;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetSubdivisionCount) == 0x000004, "Wrong alignment on EditableMesh_SetSubdivisionCount");
static_assert(sizeof(EditableMesh_SetSubdivisionCount) == 0x000004, "Wrong size on EditableMesh_SetSubdivisionCount");
static_assert(offsetof(EditableMesh_SetSubdivisionCount, NewSubdivisionCount) == 0x000000, "Member 'EditableMesh_SetSubdivisionCount::NewSubdivisionCount' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetTextureCoordinateCount
// 0x0004 (0x0004 - 0x0000)
struct EditableMesh_SetTextureCoordinateCount final
{
public:
	int32                                         NumTexCoords;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetTextureCoordinateCount) == 0x000004, "Wrong alignment on EditableMesh_SetTextureCoordinateCount");
static_assert(sizeof(EditableMesh_SetTextureCoordinateCount) == 0x000004, "Wrong size on EditableMesh_SetTextureCoordinateCount");
static_assert(offsetof(EditableMesh_SetTextureCoordinateCount, NumTexCoords) == 0x000000, "Member 'EditableMesh_SetTextureCoordinateCount::NumTexCoords' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetVertexInstancesAttributes
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_SetVertexInstancesAttributes final
{
public:
	TArray<struct FAttributesForVertexInstance>   AttributesForVertexInstances;                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetVertexInstancesAttributes) == 0x000008, "Wrong alignment on EditableMesh_SetVertexInstancesAttributes");
static_assert(sizeof(EditableMesh_SetVertexInstancesAttributes) == 0x000010, "Wrong size on EditableMesh_SetVertexInstancesAttributes");
static_assert(offsetof(EditableMesh_SetVertexInstancesAttributes, AttributesForVertexInstances) == 0x000000, "Member 'EditableMesh_SetVertexInstancesAttributes::AttributesForVertexInstances' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetVerticesAttributes
// 0x0010 (0x0010 - 0x0000)
struct EditableMesh_SetVerticesAttributes final
{
public:
	TArray<struct FAttributesForVertex>           AttributesForVertices;                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetVerticesAttributes) == 0x000008, "Wrong alignment on EditableMesh_SetVerticesAttributes");
static_assert(sizeof(EditableMesh_SetVerticesAttributes) == 0x000010, "Wrong size on EditableMesh_SetVerticesAttributes");
static_assert(offsetof(EditableMesh_SetVerticesAttributes, AttributesForVertices) == 0x000000, "Member 'EditableMesh_SetVerticesAttributes::AttributesForVertices' has a wrong offset!");

// Function EditableMesh.EditableMesh.SetVerticesCornerSharpness
// 0x0020 (0x0020 - 0x0000)
struct EditableMesh_SetVerticesCornerSharpness final
{
public:
	TArray<struct FVertexID>                      VertexIDs;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 VerticesNewCornerSharpness;                        // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EditableMesh_SetVerticesCornerSharpness) == 0x000008, "Wrong alignment on EditableMesh_SetVerticesCornerSharpness");
