#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBtlTheurgiaSeq

#include "Basic.hpp"

#include "Xrd777_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FBtlTheurgiaSeq.FBtlTheurgiaSeq
// 0x00A0 (0x00A0 - 0x0000)
struct FFBtlTheurgiaSeq final
{
public:
	TSoftObjectPtr<class ULevelSequence>          Sequence_2_26964328411A6E1A018E81B212F5D456;       // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          SequenceEvolved_16_3D9191B04959B8B877FB2FA22F7FB5FC; // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          SequenceSound_19_F9578EE34CA60F9BED1AA1979AEE03E7; // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                PersonaScaleA_5_BCC4D85844633FEB60181DAE457F2BE0;  // 0x0078(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PersonaScaleB_7_811CCF4E4FD39CB083A881A386038085;  // 0x0084(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtlPersonaSceneAnimationType                 PersonaLoopAnimType_10_B07000C2465CB9D998B298B19CBDBBBA; // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedCommonSkillSceneFromTheurgia_13_FC5D562B485020B749AABEA6578E2989; // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TheurgiaVoiceIndex_23_83F000654FBC2733DABADCB244B3F7D9; // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableLOD_26_1A521D9E4FE1BEF9E5039983382FC125;    // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFBtlTheurgiaSeq) == 0x000008, "Wrong alignment on FFBtlTheurgiaSeq");
static_assert(sizeof(FFBtlTheurgiaSeq) == 0x0000A0, "Wrong size on FFBtlTheurgiaSeq");
static_assert(offsetof(FFBtlTheurgiaSeq, Sequence_2_26964328411A6E1A018E81B212F5D456) == 0x000000, "Member 'FFBtlTheurgiaSeq::Sequence_2_26964328411A6E1A018E81B212F5D456' has a wrong offset!");
static_assert(offsetof(FFBtlTheurgiaSeq, SequenceEvolved_16_3D9191B04959B8B877FB2FA22F7FB5FC) == 0x000028, "Member 'FFBtlTheurgiaSeq::SequenceEvolved_16_3D9191B04959B8B877FB2FA22F7FB5FC' has a wrong offset!");
static_assert(offsetof(FFBtlTheurgiaSeq, SequenceSound_19_F9578EE34CA60F9BED1AA1979AEE03E7) == 0x000050, "Member 'FFBtlTheurgiaSeq::SequenceSound_19_F9578EE34CA60F9BED1AA1979AEE03E7' has a wrong offset!");
static_assert(offsetof(FFBtlTheurgiaSeq, PersonaScaleA_5_BCC4D85844633FEB60181DAE457F2BE0) == 0x000078, "Member 'FFBtlTheurgiaSeq::PersonaScaleA_5_BCC4D85844633FEB60181DAE457F2BE0' has a wrong offset!");
static_assert(offsetof(FFBtlTheurgiaSeq, PersonaScaleB_7_811CCF4E4FD39CB083A881A386038085) == 0x000084, "Member 'FFBtlTheurgiaSeq::PersonaScaleB_7_811CCF4E4FD39CB083A881A386038085' has a wrong offset!");
static_assert(offsetof(FFBtlTheurgiaSeq, PersonaLoopAnimType_10_B07000C2465CB9D998B298B19CBDBBBA) == 0x000090, "Member 'FFBtlTheurgiaSeq::PersonaLoopAnimType_10_B07000C2465CB9D998B298B19CBDBBBA' has a wrong offset!");
static_assert(offsetof(FFBtlTheurgiaSeq, NeedCommonSkillSceneFromTheurgia_13_FC5D562B485020B749AABEA6578E2989) == 0x000091, "Member 'FFBtlTheurgiaSeq::NeedCommonSkillSceneFromTheurgia_13_FC5D562B485020B749AABEA6578E2989' has a wrong offset!");
static_assert(offsetof(FFBtlTheurgiaSeq, TheurgiaVoiceIndex_23_83F000654FBC2733DABADCB244B3F7D9) == 0x000094, "Member 'FFBtlTheurgiaSeq::TheurgiaVoiceIndex_23_83F000654FBC2733DABADCB244B3F7D9' has a wrong offset!");
static_assert(offsetof(FFBtlTheurgiaSeq, DisableLOD_26_1A521D9E4FE1BEF9E5039983382FC125) == 0x000098, "Member 'FFBtlTheurgiaSeq::DisableLOD_26_1A521D9E4FE1BEF9E5039983382FC125' has a wrong offset!");

}

