#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBtlAttackSEParam

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FBtlAttackSEParam.FBtlAttackSEParam
// 0x000C (0x000C - 0x0000)
struct FFBtlAttackSEParam final
{
public:
	int32                                         SENoAttack_2_2711C465434A0E449D0BA2A55A458694;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SENoAttackLong_4_D32E54614A2987EE9430CBAD2E0CDBC6; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SENoAttackCritical_6_7F3949C14EF28533047E3CA656DAC74B; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFBtlAttackSEParam) == 0x000004, "Wrong alignment on FFBtlAttackSEParam");
static_assert(sizeof(FFBtlAttackSEParam) == 0x00000C, "Wrong size on FFBtlAttackSEParam");
static_assert(offsetof(FFBtlAttackSEParam, SENoAttack_2_2711C465434A0E449D0BA2A55A458694) == 0x000000, "Member 'FFBtlAttackSEParam::SENoAttack_2_2711C465434A0E449D0BA2A55A458694' has a wrong offset!");
static_assert(offsetof(FFBtlAttackSEParam, SENoAttackLong_4_D32E54614A2987EE9430CBAD2E0CDBC6) == 0x000004, "Member 'FFBtlAttackSEParam::SENoAttackLong_4_D32E54614A2987EE9430CBAD2E0CDBC6' has a wrong offset!");
static_assert(offsetof(FFBtlAttackSEParam, SENoAttackCritical_6_7F3949C14EF28533047E3CA656DAC74B) == 0x000008, "Member 'FFBtlAttackSEParam::SENoAttackCritical_6_7F3949C14EF28533047E3CA656DAC74B' has a wrong offset!");

}

