#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBtlAlloutFinishTexture

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FBtlAlloutFinishTexture.FBtlAlloutFinishTexture
// 0x00F0 (0x00F0 - 0x0000)
struct FFBtlAlloutFinishTexture final
{
public:
	TSoftObjectPtr<class UTexture>                TextureNormal_4_6B79397D40E13E1D77C805A9B5855349;  // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                TextureNormalMask_13_C6929FB843313D3EF03330B4CB2D7A8A; // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                TextureSpecialOutfit_6_72E39B634A13D6251EEA5AAEA2445666; // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                TextureSpecialOutfitMask_15_3389D2C346DF78522D9F28A79660E9FE; // 0x0078(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                TextureText_7_782F5C60458A9DD5290CE6BD8DBCABB3;    // 0x00A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 TextPlg_10_F1AEBEA748AECF71859A9A84AE30FD65;       // 0x00C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FFBtlAlloutFinishTexture) == 0x000008, "Wrong alignment on FFBtlAlloutFinishTexture");
static_assert(sizeof(FFBtlAlloutFinishTexture) == 0x0000F0, "Wrong size on FFBtlAlloutFinishTexture");
static_assert(offsetof(FFBtlAlloutFinishTexture, TextureNormal_4_6B79397D40E13E1D77C805A9B5855349) == 0x000000, "Member 'FFBtlAlloutFinishTexture::TextureNormal_4_6B79397D40E13E1D77C805A9B5855349' has a wrong offset!");
static_assert(offsetof(FFBtlAlloutFinishTexture, TextureNormalMask_13_C6929FB843313D3EF03330B4CB2D7A8A) == 0x000028, "Member 'FFBtlAlloutFinishTexture::TextureNormalMask_13_C6929FB843313D3EF03330B4CB2D7A8A' has a wrong offset!");
static_assert(offsetof(FFBtlAlloutFinishTexture, TextureSpecialOutfit_6_72E39B634A13D6251EEA5AAEA2445666) == 0x000050, "Member 'FFBtlAlloutFinishTexture::TextureSpecialOutfit_6_72E39B634A13D6251EEA5AAEA2445666' has a wrong offset!");
static_assert(offsetof(FFBtlAlloutFinishTexture, TextureSpecialOutfitMask_15_3389D2C346DF78522D9F28A79660E9FE) == 0x000078, "Member 'FFBtlAlloutFinishTexture::TextureSpecialOutfitMask_15_3389D2C346DF78522D9F28A79660E9FE' has a wrong offset!");
static_assert(offsetof(FFBtlAlloutFinishTexture, TextureText_7_782F5C60458A9DD5290CE6BD8DBCABB3) == 0x0000A0, "Member 'FFBtlAlloutFinishTexture::TextureText_7_782F5C60458A9DD5290CE6BD8DBCABB3' has a wrong offset!");
static_assert(offsetof(FFBtlAlloutFinishTexture, TextPlg_10_F1AEBEA748AECF71859A9A84AE30FD65) == 0x0000C8, "Member 'FFBtlAlloutFinishTexture::TextPlg_10_F1AEBEA748AECF71859A9A84AE30FD65' has a wrong offset!");

}

