#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBtlCalcParam

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FBtlCalcParam.FBtlCalcParam
// 0x0028 (0x0028 - 0x0000)
struct FFBtlCalcParam final
{
public:
	float                                         DamageRateToEnemy_8_E8218A1045468EDA04CAF1877EF40D95; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageRateToPlayer_9_3F89DD1840E814EF751C94B12778160A; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExpRate_10_8CBA31F0430A7FDD116509A4E1A38463;       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageRateToEnemyWeak_13_FED8996D4C318E5C24CCDB89FE4E9987; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageRateToPlayerWeak_15_169FC07B488454B06DC341ABC603184B; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageRateToEnemyCritical_20_73619B7847B5C5E49E6A28BAB66D4E36; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageRateToPlayerCritical_19_EF7B592D4EF6129C9D0BBC863F113AE8; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoneyRateToMaterials_23_9F2533D24722C44FC66CDCA2316CC834; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BadStatusHitRateFromEnemy_29_11445CCC4D2C7BD007323DB8A81F4D72; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BadStatusHitRateFromPlayer_30_AB45C786458F332999054899683026E2; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFBtlCalcParam) == 0x000004, "Wrong alignment on FFBtlCalcParam");
static_assert(sizeof(FFBtlCalcParam) == 0x000028, "Wrong size on FFBtlCalcParam");
static_assert(offsetof(FFBtlCalcParam, DamageRateToEnemy_8_E8218A1045468EDA04CAF1877EF40D95) == 0x000000, "Member 'FFBtlCalcParam::DamageRateToEnemy_8_E8218A1045468EDA04CAF1877EF40D95' has a wrong offset!");
static_assert(offsetof(FFBtlCalcParam, DamageRateToPlayer_9_3F89DD1840E814EF751C94B12778160A) == 0x000004, "Member 'FFBtlCalcParam::DamageRateToPlayer_9_3F89DD1840E814EF751C94B12778160A' has a wrong offset!");
static_assert(offsetof(FFBtlCalcParam, ExpRate_10_8CBA31F0430A7FDD116509A4E1A38463) == 0x000008, "Member 'FFBtlCalcParam::ExpRate_10_8CBA31F0430A7FDD116509A4E1A38463' has a wrong offset!");
static_assert(offsetof(FFBtlCalcParam, DamageRateToEnemyWeak_13_FED8996D4C318E5C24CCDB89FE4E9987) == 0x00000C, "Member 'FFBtlCalcParam::DamageRateToEnemyWeak_13_FED8996D4C318E5C24CCDB89FE4E9987' has a wrong offset!");
static_assert(offsetof(FFBtlCalcParam, DamageRateToPlayerWeak_15_169FC07B488454B06DC341ABC603184B) == 0x000010, "Member 'FFBtlCalcParam::DamageRateToPlayerWeak_15_169FC07B488454B06DC341ABC603184B' has a wrong offset!");
static_assert(offsetof(FFBtlCalcParam, DamageRateToEnemyCritical_20_73619B7847B5C5E49E6A28BAB66D4E36) == 0x000014, "Member 'FFBtlCalcParam::DamageRateToEnemyCritical_20_73619B7847B5C5E49E6A28BAB66D4E36' has a wrong offset!");
static_assert(offsetof(FFBtlCalcParam, DamageRateToPlayerCritical_19_EF7B592D4EF6129C9D0BBC863F113AE8) == 0x000018, "Member 'FFBtlCalcParam::DamageRateToPlayerCritical_19_EF7B592D4EF6129C9D0BBC863F113AE8' has a wrong offset!");
static_assert(offsetof(FFBtlCalcParam, MoneyRateToMaterials_23_9F2533D24722C44FC66CDCA2316CC834) == 0x00001C, "Member 'FFBtlCalcParam::MoneyRateToMaterials_23_9F2533D24722C44FC66CDCA2316CC834' has a wrong offset!");
static_assert(offsetof(FFBtlCalcParam, BadStatusHitRateFromEnemy_29_11445CCC4D2C7BD007323DB8A81F4D72) == 0x000020, "Member 'FFBtlCalcParam::BadStatusHitRateFromEnemy_29_11445CCC4D2C7BD007323DB8A81F4D72' has a wrong offset!");
static_assert(offsetof(FFBtlCalcParam, BadStatusHitRateFromPlayer_30_AB45C786458F332999054899683026E2) == 0x000024, "Member 'FFBtlCalcParam::BadStatusHitRateFromPlayer_30_AB45C786458F332999054899683026E2' has a wrong offset!");

}

