#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBtlTopUIParam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FBtlTopUIParam.FBtlTopUIParam
// 0x0040 (0x0040 - 0x0000)
struct FFBtlTopUIParam final
{
public:
	struct FVector2D                              MoonOffset_4_D5BEB1784016C04EF62588B8E794DBFF;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoonScale_9_C78DB5354B96C3D2B883C2A4E0060045;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CommandOffset_6_C984F550407BBE41439D2AB4BBCA4917;  // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CommandScale_11_CAA9FC804AAD90646149649427FF0105;  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OracleOffset_25_9D9E32B34FF4B94B3027CC868685A855;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              KoromaruMoonOffset_15_D66275554EEFE43429EF48B74A993468; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KoromaruMoonScale_20_ABDD881E4F5CB5CB184A7E92497B44DA; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              KoromaruCommandOffset_17_5C86BC6649066098768F488A88680550; // 0x002C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KoromaruCommandScale_22_0EB948F942922B4E3A1C988F43630E38; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              KoromaruOracleOffset_27_FA76ABD14E466CDDF6FC33850E03F5F0; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFBtlTopUIParam) == 0x000004, "Wrong alignment on FFBtlTopUIParam");
static_assert(sizeof(FFBtlTopUIParam) == 0x000040, "Wrong size on FFBtlTopUIParam");
static_assert(offsetof(FFBtlTopUIParam, MoonOffset_4_D5BEB1784016C04EF62588B8E794DBFF) == 0x000000, "Member 'FFBtlTopUIParam::MoonOffset_4_D5BEB1784016C04EF62588B8E794DBFF' has a wrong offset!");
static_assert(offsetof(FFBtlTopUIParam, MoonScale_9_C78DB5354B96C3D2B883C2A4E0060045) == 0x000008, "Member 'FFBtlTopUIParam::MoonScale_9_C78DB5354B96C3D2B883C2A4E0060045' has a wrong offset!");
static_assert(offsetof(FFBtlTopUIParam, CommandOffset_6_C984F550407BBE41439D2AB4BBCA4917) == 0x00000C, "Member 'FFBtlTopUIParam::CommandOffset_6_C984F550407BBE41439D2AB4BBCA4917' has a wrong offset!");
static_assert(offsetof(FFBtlTopUIParam, CommandScale_11_CAA9FC804AAD90646149649427FF0105) == 0x000014, "Member 'FFBtlTopUIParam::CommandScale_11_CAA9FC804AAD90646149649427FF0105' has a wrong offset!");
static_assert(offsetof(FFBtlTopUIParam, OracleOffset_25_9D9E32B34FF4B94B3027CC868685A855) == 0x000018, "Member 'FFBtlTopUIParam::OracleOffset_25_9D9E32B34FF4B94B3027CC868685A855' has a wrong offset!");
static_assert(offsetof(FFBtlTopUIParam, KoromaruMoonOffset_15_D66275554EEFE43429EF48B74A993468) == 0x000020, "Member 'FFBtlTopUIParam::KoromaruMoonOffset_15_D66275554EEFE43429EF48B74A993468' has a wrong offset!");
static_assert(offsetof(FFBtlTopUIParam, KoromaruMoonScale_20_ABDD881E4F5CB5CB184A7E92497B44DA) == 0x000028, "Member 'FFBtlTopUIParam::KoromaruMoonScale_20_ABDD881E4F5CB5CB184A7E92497B44DA' has a wrong offset!");
static_assert(offsetof(FFBtlTopUIParam, KoromaruCommandOffset_17_5C86BC6649066098768F488A88680550) == 0x00002C, "Member 'FFBtlTopUIParam::KoromaruCommandOffset_17_5C86BC6649066098768F488A88680550' has a wrong offset!");
static_assert(offsetof(FFBtlTopUIParam, KoromaruCommandScale_22_0EB948F942922B4E3A1C988F43630E38) == 0x000034, "Member 'FFBtlTopUIParam::KoromaruCommandScale_22_0EB948F942922B4E3A1C988F43630E38' has a wrong offset!");
static_assert(offsetof(FFBtlTopUIParam, KoromaruOracleOffset_27_FA76ABD14E466CDDF6FC33850E03F5F0) == 0x000038, "Member 'FFBtlTopUIParam::KoromaruOracleOffset_27_FA76ABD14E466CDDF6FC33850E03F5F0' has a wrong offset!");

}

