#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBtlVector3

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FBtlVector3.FBtlVector3
// 0x000C (0x000C - 0x0000)
struct FFBtlVector3 final
{
public:
	float                                         X_2_61690A0C49AE65EEBEA3F1869ED7C8B0;              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y_4_99EA40724D71AB71DA2E298FBE765633;              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z_7_3931AEC34F09EC9204600DB26430DD22;              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFBtlVector3) == 0x000004, "Wrong alignment on FFBtlVector3");
static_assert(sizeof(FFBtlVector3) == 0x00000C, "Wrong size on FFBtlVector3");
static_assert(offsetof(FFBtlVector3, X_2_61690A0C49AE65EEBEA3F1869ED7C8B0) == 0x000000, "Member 'FFBtlVector3::X_2_61690A0C49AE65EEBEA3F1869ED7C8B0' has a wrong offset!");
static_assert(offsetof(FFBtlVector3, Y_4_99EA40724D71AB71DA2E298FBE765633) == 0x000004, "Member 'FFBtlVector3::Y_4_99EA40724D71AB71DA2E298FBE765633' has a wrong offset!");
static_assert(offsetof(FFBtlVector3, Z_7_3931AEC34F09EC9204600DB26430DD22) == 0x000008, "Member 'FFBtlVector3::Z_7_3931AEC34F09EC9204600DB26430DD22' has a wrong offset!");

}

