#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBtlCommandCamera

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FBtlCommandCamera.FBtlCommandCamera
// 0x0018 (0x0018 - 0x0000)
struct FFBtlCommandCamera final
{
public:
	float                                         CameraHeight_2_AADD98674F15237B0DF705A4B98B84D3;   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraRoll_5_5232DF944C9C95046D5FF79AA9FC827C;     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraYaw_7_F26676A2438DE7003F72849CB662B164;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CranePitch_10_971DE53F4E95B2C4931F3A9BB376E0BE;    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CraneYaw_12_B638F73C48A9653C54D73FAF22197C2D;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CraneLength_14_B4B3940149D0262456F7E28BB8DE6A8C;   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFBtlCommandCamera) == 0x000004, "Wrong alignment on FFBtlCommandCamera");
static_assert(sizeof(FFBtlCommandCamera) == 0x000018, "Wrong size on FFBtlCommandCamera");
static_assert(offsetof(FFBtlCommandCamera, CameraHeight_2_AADD98674F15237B0DF705A4B98B84D3) == 0x000000, "Member 'FFBtlCommandCamera::CameraHeight_2_AADD98674F15237B0DF705A4B98B84D3' has a wrong offset!");
static_assert(offsetof(FFBtlCommandCamera, CameraRoll_5_5232DF944C9C95046D5FF79AA9FC827C) == 0x000004, "Member 'FFBtlCommandCamera::CameraRoll_5_5232DF944C9C95046D5FF79AA9FC827C' has a wrong offset!");
static_assert(offsetof(FFBtlCommandCamera, CameraYaw_7_F26676A2438DE7003F72849CB662B164) == 0x000008, "Member 'FFBtlCommandCamera::CameraYaw_7_F26676A2438DE7003F72849CB662B164' has a wrong offset!");
static_assert(offsetof(FFBtlCommandCamera, CranePitch_10_971DE53F4E95B2C4931F3A9BB376E0BE) == 0x00000C, "Member 'FFBtlCommandCamera::CranePitch_10_971DE53F4E95B2C4931F3A9BB376E0BE' has a wrong offset!");
static_assert(offsetof(FFBtlCommandCamera, CraneYaw_12_B638F73C48A9653C54D73FAF22197C2D) == 0x000010, "Member 'FFBtlCommandCamera::CraneYaw_12_B638F73C48A9653C54D73FAF22197C2D' has a wrong offset!");
static_assert(offsetof(FFBtlCommandCamera, CraneLength_14_B4B3940149D0262456F7E28BB8DE6A8C) == 0x000014, "Member 'FFBtlCommandCamera::CraneLength_14_B4B3940149D0262456F7E28BB8DE6A8C' has a wrong offset!");

}

