#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBtlSkillRequest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FBtlSkillRequest.FBtlSkillRequest
// 0x0070 (0x0070 - 0x0000)
struct FFBtlSkillRequest final
{
public:
	class UNiagaraSystem*                         VFX_12_FC0A46E7401CEF15234852853252F8F8;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaitTime_5_A0E35DD448B73849EDC8CCA2B84394C5;       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform_8_1ED9777944BC75B064410DBC4720D3E5;      // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	bool                                          AlreadyRequested_11_4D9F0A764DD28D671E1D04ADEBC72398; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      VFXObjectReference_15_48157CDF40E7ADEB0B4561891B4444E6; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          SkillSE_18_36669D1E484E156FE96E83BBD1EE5057;       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SoundVolumeRatio_21_CD65BC84445812231A3A56A450F7D248; // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         SKillSEObjectReference_24_3D85F515417C98E6AC8DCCBC337AF731; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSECameraRangeParam_27_06FBC19747FA6FEA430094BC256513B8; // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SECameraRangeMax_30_B0B76DDD4A1FD7AE9E20E0AFC160F733; // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFBtlSkillRequest) == 0x000010, "Wrong alignment on FFBtlSkillRequest");
static_assert(sizeof(FFBtlSkillRequest) == 0x000070, "Wrong size on FFBtlSkillRequest");
static_assert(offsetof(FFBtlSkillRequest, VFX_12_FC0A46E7401CEF15234852853252F8F8) == 0x000000, "Member 'FFBtlSkillRequest::VFX_12_FC0A46E7401CEF15234852853252F8F8' has a wrong offset!");
static_assert(offsetof(FFBtlSkillRequest, WaitTime_5_A0E35DD448B73849EDC8CCA2B84394C5) == 0x000008, "Member 'FFBtlSkillRequest::WaitTime_5_A0E35DD448B73849EDC8CCA2B84394C5' has a wrong offset!");
static_assert(offsetof(FFBtlSkillRequest, Transform_8_1ED9777944BC75B064410DBC4720D3E5) == 0x000010, "Member 'FFBtlSkillRequest::Transform_8_1ED9777944BC75B064410DBC4720D3E5' has a wrong offset!");
static_assert(offsetof(FFBtlSkillRequest, AlreadyRequested_11_4D9F0A764DD28D671E1D04ADEBC72398) == 0x000040, "Member 'FFBtlSkillRequest::AlreadyRequested_11_4D9F0A764DD28D671E1D04ADEBC72398' has a wrong offset!");
static_assert(offsetof(FFBtlSkillRequest, VFXObjectReference_15_48157CDF40E7ADEB0B4561891B4444E6) == 0x000048, "Member 'FFBtlSkillRequest::VFXObjectReference_15_48157CDF40E7ADEB0B4561891B4444E6' has a wrong offset!");
static_assert(offsetof(FFBtlSkillRequest, SkillSE_18_36669D1E484E156FE96E83BBD1EE5057) == 0x000050, "Member 'FFBtlSkillRequest::SkillSE_18_36669D1E484E156FE96E83BBD1EE5057' has a wrong offset!");
static_assert(offsetof(FFBtlSkillRequest, SoundVolumeRatio_21_CD65BC84445812231A3A56A450F7D248) == 0x000058, "Member 'FFBtlSkillRequest::SoundVolumeRatio_21_CD65BC84445812231A3A56A450F7D248' has a wrong offset!");
static_assert(offsetof(FFBtlSkillRequest, SKillSEObjectReference_24_3D85F515417C98E6AC8DCCBC337AF731) == 0x000060, "Member 'FFBtlSkillRequest::SKillSEObjectReference_24_3D85F515417C98E6AC8DCCBC337AF731' has a wrong offset!");
static_assert(offsetof(FFBtlSkillRequest, UseSECameraRangeParam_27_06FBC19747FA6FEA430094BC256513B8) == 0x000068, "Member 'FFBtlSkillRequest::UseSECameraRangeParam_27_06FBC19747FA6FEA430094BC256513B8' has a wrong offset!");
static_assert(offsetof(FFBtlSkillRequest, SECameraRangeMax_30_B0B76DDD4A1FD7AE9E20E0AFC160F733) == 0x00006C, "Member 'FFBtlSkillRequest::SECameraRangeMax_30_B0B76DDD4A1FD7AE9E20E0AFC160F733' has a wrong offset!");

}

