#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBtlSkillControl

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FBtlSkillControl.FBtlSkillControl
// 0x000C (0x000C - 0x0000)
struct FFBtlSkillControl final
{
public:
	bool                                          IsPlay_1_78A12810461BC38553D1319F787E7F08;         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VFXIndex_4_3CA23E1A4F1CD5821697D8BD895D64BC;       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCamera_6_DD1E9C60436EE1159213CAB84229E8CE;      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFBtlSkillControl) == 0x000004, "Wrong alignment on FFBtlSkillControl");
static_assert(sizeof(FFBtlSkillControl) == 0x00000C, "Wrong size on FFBtlSkillControl");
static_assert(offsetof(FFBtlSkillControl, IsPlay_1_78A12810461BC38553D1319F787E7F08) == 0x000000, "Member 'FFBtlSkillControl::IsPlay_1_78A12810461BC38553D1319F787E7F08' has a wrong offset!");
static_assert(offsetof(FFBtlSkillControl, VFXIndex_4_3CA23E1A4F1CD5821697D8BD895D64BC) == 0x000004, "Member 'FFBtlSkillControl::VFXIndex_4_3CA23E1A4F1CD5821697D8BD895D64BC' has a wrong offset!");
static_assert(offsetof(FFBtlSkillControl, UseCamera_6_DD1E9C60436EE1159213CAB84229E8CE) == 0x000008, "Member 'FFBtlSkillControl::UseCamera_6_DD1E9C60436EE1159213CAB84229E8CE' has a wrong offset!");

}

