#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FEqualizerSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FEqualizerSettings.FEqualizerSettings
// 0x0014 (0x0014 - 0x0000)
struct FFEqualizerSettings final
{
public:
	int32                                         BgmID_2_525BC9F0470D5D47A6A92680314C2ED7;          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IconType_10_6C609F2D43B71E1C336C41A906F8A438;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpeedType_5_80B8F65E47E7EAD3C5A862A5DFC6D870;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ColorType_7_4BAAF918444F48E2006812B298894CB3;      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTextureEx_12_9D55A4104B78EE0A0113A3875F65C9F6;   // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFEqualizerSettings) == 0x000004, "Wrong alignment on FFEqualizerSettings");
static_assert(sizeof(FFEqualizerSettings) == 0x000014, "Wrong size on FFEqualizerSettings");
static_assert(offsetof(FFEqualizerSettings, BgmID_2_525BC9F0470D5D47A6A92680314C2ED7) == 0x000000, "Member 'FFEqualizerSettings::BgmID_2_525BC9F0470D5D47A6A92680314C2ED7' has a wrong offset!");
static_assert(offsetof(FFEqualizerSettings, IconType_10_6C609F2D43B71E1C336C41A906F8A438) == 0x000004, "Member 'FFEqualizerSettings::IconType_10_6C609F2D43B71E1C336C41A906F8A438' has a wrong offset!");
static_assert(offsetof(FFEqualizerSettings, SpeedType_5_80B8F65E47E7EAD3C5A862A5DFC6D870) == 0x000008, "Member 'FFEqualizerSettings::SpeedType_5_80B8F65E47E7EAD3C5A862A5DFC6D870' has a wrong offset!");
static_assert(offsetof(FFEqualizerSettings, ColorType_7_4BAAF918444F48E2006812B298894CB3) == 0x00000C, "Member 'FFEqualizerSettings::ColorType_7_4BAAF918444F48E2006812B298894CB3' has a wrong offset!");
static_assert(offsetof(FFEqualizerSettings, IsTextureEx_12_9D55A4104B78EE0A0113A3875F65C9F6) == 0x000010, "Member 'FFEqualizerSettings::IsTextureEx_12_9D55A4104B78EE0A0113A3875F65C9F6' has a wrong offset!");

}

