#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FontStyleAssetPlugin

#include "Basic.hpp"

#include "FontStyleAssetPlugin_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class FontStyleAssetPlugin.FontStyleAsset
// 0x0048 (0x0070 - 0x0028)
class UFontStyleAsset final : public UObject
{
public:
	struct FFontStyleData                         MediumStyle;                                       // 0x0028(0x0014)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FFontStyleData                         SmallStyle;                                        // 0x003C(0x0014)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FFontStyleData                         SSmallStyle;                                       // 0x0050(0x0014)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ItalicOffset;                                      // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PersonaStatusItalicOffset;                         // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TheurgiaItalicOffset;                              // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FontStyleAsset">();
	}
	static class UFontStyleAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFontStyleAsset>();
	}
};
static_assert(alignof(UFontStyleAsset) == 0x000008, "Wrong alignment on UFontStyleAsset");
static_assert(sizeof(UFontStyleAsset) == 0x000070, "Wrong size on UFontStyleAsset");
static_assert(offsetof(UFontStyleAsset, MediumStyle) == 0x000028, "Member 'UFontStyleAsset::MediumStyle' has a wrong offset!");
static_assert(offsetof(UFontStyleAsset, SmallStyle) == 0x00003C, "Member 'UFontStyleAsset::SmallStyle' has a wrong offset!");
static_assert(offsetof(UFontStyleAsset, SSmallStyle) == 0x000050, "Member 'UFontStyleAsset::SSmallStyle' has a wrong offset!");
static_assert(offsetof(UFontStyleAsset, ItalicOffset) == 0x000064, "Member 'UFontStyleAsset::ItalicOffset' has a wrong offset!");
static_assert(offsetof(UFontStyleAsset, PersonaStatusItalicOffset) == 0x000068, "Member 'UFontStyleAsset::PersonaStatusItalicOffset' has a wrong offset!");
static_assert(offsetof(UFontStyleAsset, TheurgiaItalicOffset) == 0x00006C, "Member 'UFontStyleAsset::TheurgiaItalicOffset' has a wrong offset!");

}

