#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_FMain_Gameplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LV_FMain_Gameplay.LV_FMain_Gameplay_C
// 0x0058 (0x0280 - 0x0228)
class ALV_FMain_Gameplay_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 PlayerClass;                                       // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraClass;                                       // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DungeonPlayerClass;                                // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DungeonCameraClass;                                // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DngEntranceCameraClassAstrea;                      // 0x0250(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 FollowerClass;                                     // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 FollowerKoromaruClass;                             // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TransCameraClass;                                  // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DungeonPlayerClassAstrea;                          // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class AFldCameraBase>             DngFinalFloorCameraClassAstrea;                    // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LV_FMain_Gameplay(int32 EntryPoint);
	void ReceiveBeginPlay();
	void CheckDebugShortcut(bool* Return);
	void CheckEventDebugShortcut(bool* Return);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LV_FMain_Gameplay_C">();
	}
	static class ALV_FMain_Gameplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALV_FMain_Gameplay_C>();
	}
};
static_assert(alignof(ALV_FMain_Gameplay_C) == 0x000008, "Wrong alignment on ALV_FMain_Gameplay_C");
static_assert(sizeof(ALV_FMain_Gameplay_C) == 0x000280, "Wrong size on ALV_FMain_Gameplay_C");
static_assert(offsetof(ALV_FMain_Gameplay_C, UberGraphFrame) == 0x000228, "Member 'ALV_FMain_Gameplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALV_FMain_Gameplay_C, PlayerClass) == 0x000230, "Member 'ALV_FMain_Gameplay_C::PlayerClass' has a wrong offset!");
static_assert(offsetof(ALV_FMain_Gameplay_C, CameraClass) == 0x000238, "Member 'ALV_FMain_Gameplay_C::CameraClass' has a wrong offset!");
static_assert(offsetof(ALV_FMain_Gameplay_C, DungeonPlayerClass) == 0x000240, "Member 'ALV_FMain_Gameplay_C::DungeonPlayerClass' has a wrong offset!");
static_assert(offsetof(ALV_FMain_Gameplay_C, DungeonCameraClass) == 0x000248, "Member 'ALV_FMain_Gameplay_C::DungeonCameraClass' has a wrong offset!");
static_assert(offsetof(ALV_FMain_Gameplay_C, DngEntranceCameraClassAstrea) == 0x000250, "Member 'ALV_FMain_Gameplay_C::DngEntranceCameraClassAstrea' has a wrong offset!");
static_assert(offsetof(ALV_FMain_Gameplay_C, FollowerClass) == 0x000258, "Member 'ALV_FMain_Gameplay_C::FollowerClass' has a wrong offset!");
static_assert(offsetof(ALV_FMain_Gameplay_C, FollowerKoromaruClass) == 0x000260, "Member 'ALV_FMain_Gameplay_C::FollowerKoromaruClass' has a wrong offset!");
static_assert(offsetof(ALV_FMain_Gameplay_C, TransCameraClass) == 0x000268, "Member 'ALV_FMain_Gameplay_C::TransCameraClass' has a wrong offset!");
static_assert(offsetof(ALV_FMain_Gameplay_C, DungeonPlayerClassAstrea) == 0x000270, "Member 'ALV_FMain_Gameplay_C::DungeonPlayerClassAstrea' has a wrong offset!");
static_assert(offsetof(ALV_FMain_Gameplay_C, DngFinalFloorCameraClassAstrea) == 0x000278, "Member 'ALV_FMain_Gameplay_C::DngFinalFloorCameraClassAstrea' has a wrong offset!");

}

