#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Monitorsnap

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct monitorsnap.MonitorHandle
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FMonitorHandle final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMonitorHandle) == 0x000008, "Wrong alignment on FMonitorHandle");
static_assert(sizeof(FMonitorHandle) == 0x000008, "Wrong size on FMonitorHandle");

// ScriptStruct monitorsnap.MonitorResolution
// 0x0010 (0x0010 - 0x0000)
struct FMonitorResolution final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RefreshRateNumerator;                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RefreshRateDenominator;                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMonitorResolution) == 0x000004, "Wrong alignment on FMonitorResolution");
static_assert(sizeof(FMonitorResolution) == 0x000010, "Wrong size on FMonitorResolution");
static_assert(offsetof(FMonitorResolution, Width) == 0x000000, "Member 'FMonitorResolution::Width' has a wrong offset!");
static_assert(offsetof(FMonitorResolution, Height) == 0x000004, "Member 'FMonitorResolution::Height' has a wrong offset!");
static_assert(offsetof(FMonitorResolution, RefreshRateNumerator) == 0x000008, "Member 'FMonitorResolution::RefreshRateNumerator' has a wrong offset!");
static_assert(offsetof(FMonitorResolution, RefreshRateDenominator) == 0x00000C, "Member 'FMonitorResolution::RefreshRateDenominator' has a wrong offset!");

}

