#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovementSettings_State

#include "Basic.hpp"

#include "MovementSettings_Stance_structs.hpp"


namespace SDK
{

// UserDefinedStruct MovementSettings_State.MovementSettings_State
// 0x00C0 (0x00C0 - 0x0000)
struct FMovementSettings_State final
{
public:
	struct FMovementSettings_Stance               VelocityDirection_17_291919F34C61D6D2C253D3B80934D9D2; // 0x0000(0x0040)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovementSettings_Stance               LookingDirection_18_DEF8FDDA4324E7EF87C9DE8D07831456; // 0x0040(0x0040)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovementSettings_Stance               Aiming_21_D7B17FD043E721735EF6CCA049CD9E66;        // 0x0080(0x0040)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FMovementSettings_State) == 0x000008, "Wrong alignment on FMovementSettings_State");
static_assert(sizeof(FMovementSettings_State) == 0x0000C0, "Wrong size on FMovementSettings_State");
static_assert(offsetof(FMovementSettings_State, VelocityDirection_17_291919F34C61D6D2C253D3B80934D9D2) == 0x000000, "Member 'FMovementSettings_State::VelocityDirection_17_291919F34C61D6D2C253D3B80934D9D2' has a wrong offset!");
static_assert(offsetof(FMovementSettings_State, LookingDirection_18_DEF8FDDA4324E7EF87C9DE8D07831456) == 0x000040, "Member 'FMovementSettings_State::LookingDirection_18_DEF8FDDA4324E7EF87C9DE8D07831456' has a wrong offset!");
static_assert(offsetof(FMovementSettings_State, Aiming_21_D7B17FD043E721735EF6CCA049CD9E66) == 0x000080, "Member 'FMovementSettings_State::Aiming_21_D7B17FD043E721735EF6CCA049CD9E66' has a wrong offset!");

}

