#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraExtends

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Niagara_structs.hpp"


namespace SDK::Params
{

// Function NiagaraExtends.AnimNotify_PlayNiagaraEffectEx.GetSpawnedEffect
// 0x0008 (0x0008 - 0x0000)
struct AnimNotify_PlayNiagaraEffectEx_GetSpawnedEffect final
{
public:
	class UNiagaraComponent*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotify_PlayNiagaraEffectEx_GetSpawnedEffect) == 0x000008, "Wrong alignment on AnimNotify_PlayNiagaraEffectEx_GetSpawnedEffect");
static_assert(sizeof(AnimNotify_PlayNiagaraEffectEx_GetSpawnedEffect) == 0x000008, "Wrong size on AnimNotify_PlayNiagaraEffectEx_GetSpawnedEffect");
static_assert(offsetof(AnimNotify_PlayNiagaraEffectEx_GetSpawnedEffect, ReturnValue) == 0x000000, "Member 'AnimNotify_PlayNiagaraEffectEx_GetSpawnedEffect::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraActorExtends.CreateNiagaraActorExtends
// 0x0020 (0x0020 - 0x0000)
struct NiagaraActorExtends_CreateNiagaraActorExtends final
{
public:
	class APlayerController*                      InPC;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         InAsset;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InSpeed;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ANiagaraActorExtends*                   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraActorExtends_CreateNiagaraActorExtends) == 0x000008, "Wrong alignment on NiagaraActorExtends_CreateNiagaraActorExtends");
static_assert(sizeof(NiagaraActorExtends_CreateNiagaraActorExtends) == 0x000020, "Wrong size on NiagaraActorExtends_CreateNiagaraActorExtends");
static_assert(offsetof(NiagaraActorExtends_CreateNiagaraActorExtends, InPC) == 0x000000, "Member 'NiagaraActorExtends_CreateNiagaraActorExtends::InPC' has a wrong offset!");
static_assert(offsetof(NiagaraActorExtends_CreateNiagaraActorExtends, InAsset) == 0x000008, "Member 'NiagaraActorExtends_CreateNiagaraActorExtends::InAsset' has a wrong offset!");
static_assert(offsetof(NiagaraActorExtends_CreateNiagaraActorExtends, InSpeed) == 0x000010, "Member 'NiagaraActorExtends_CreateNiagaraActorExtends::InSpeed' has a wrong offset!");
static_assert(offsetof(NiagaraActorExtends_CreateNiagaraActorExtends, ReturnValue) == 0x000018, "Member 'NiagaraActorExtends_CreateNiagaraActorExtends::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraActorExtends.GetParameterCollectionInstance
// 0x0008 (0x0008 - 0x0000)
struct NiagaraActorExtends_GetParameterCollectionInstance final
{
public:
	class UNiagaraParameterCollectionInstance*    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraActorExtends_GetParameterCollectionInstance) == 0x000008, "Wrong alignment on NiagaraActorExtends_GetParameterCollectionInstance");
static_assert(sizeof(NiagaraActorExtends_GetParameterCollectionInstance) == 0x000008, "Wrong size on NiagaraActorExtends_GetParameterCollectionInstance");
static_assert(offsetof(NiagaraActorExtends_GetParameterCollectionInstance, ReturnValue) == 0x000000, "Member 'NiagaraActorExtends_GetParameterCollectionInstance::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraActorExtends.OnComplete
// 0x0008 (0x0008 - 0x0000)
struct NiagaraActorExtends_OnComplete final
{
public:
	class UNiagaraComponent*                      PSystem;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraActorExtends_OnComplete) == 0x000008, "Wrong alignment on NiagaraActorExtends_OnComplete");
static_assert(sizeof(NiagaraActorExtends_OnComplete) == 0x000008, "Wrong size on NiagaraActorExtends_OnComplete");
static_assert(offsetof(NiagaraActorExtends_OnComplete, PSystem) == 0x000000, "Member 'NiagaraActorExtends_OnComplete::PSystem' has a wrong offset!");

// Function NiagaraExtends.NiagaraActorExtends.SetDesiredAge
// 0x0004 (0x0004 - 0x0000)
struct NiagaraActorExtends_SetDesiredAge final
{
public:
	float                                         InDeltTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraActorExtends_SetDesiredAge) == 0x000004, "Wrong alignment on NiagaraActorExtends_SetDesiredAge");
static_assert(sizeof(NiagaraActorExtends_SetDesiredAge) == 0x000004, "Wrong size on NiagaraActorExtends_SetDesiredAge");
static_assert(offsetof(NiagaraActorExtends_SetDesiredAge, InDeltTime) == 0x000000, "Member 'NiagaraActorExtends_SetDesiredAge::InDeltTime' has a wrong offset!");

// Function NiagaraExtends.NiagaraActorExtends.SetVisibleDebugArrow_DebugOnly
// 0x0001 (0x0001 - 0x0000)
struct NiagaraActorExtends_SetVisibleDebugArrow_DebugOnly final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraActorExtends_SetVisibleDebugArrow_DebugOnly) == 0x000001, "Wrong alignment on NiagaraActorExtends_SetVisibleDebugArrow_DebugOnly");
static_assert(sizeof(NiagaraActorExtends_SetVisibleDebugArrow_DebugOnly) == 0x000001, "Wrong size on NiagaraActorExtends_SetVisibleDebugArrow_DebugOnly");
static_assert(offsetof(NiagaraActorExtends_SetVisibleDebugArrow_DebugOnly, InVisible) == 0x000000, "Member 'NiagaraActorExtends_SetVisibleDebugArrow_DebugOnly::InVisible' has a wrong offset!");

// Function NiagaraExtends.NiagaraActorExtends.SpawnNiagaraSystem
// 0x0010 (0x0010 - 0x0000)
struct NiagaraActorExtends_SpawnNiagaraSystem final
{
public:
	class UNiagaraSystem*                         InAsset;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InSpeed;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraActorExtends_SpawnNiagaraSystem) == 0x000008, "Wrong alignment on NiagaraActorExtends_SpawnNiagaraSystem");
static_assert(sizeof(NiagaraActorExtends_SpawnNiagaraSystem) == 0x000010, "Wrong size on NiagaraActorExtends_SpawnNiagaraSystem");
static_assert(offsetof(NiagaraActorExtends_SpawnNiagaraSystem, InAsset) == 0x000000, "Member 'NiagaraActorExtends_SpawnNiagaraSystem::InAsset' has a wrong offset!");
static_assert(offsetof(NiagaraActorExtends_SpawnNiagaraSystem, InSpeed) == 0x000008, "Member 'NiagaraActorExtends_SpawnNiagaraSystem::InSpeed' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.GetEmitterNames
// 0x0018 (0x0018 - 0x0000)
struct NiagaraExtendsFunctionLibrary_GetEmitterNames final
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_GetEmitterNames) == 0x000008, "Wrong alignment on NiagaraExtendsFunctionLibrary_GetEmitterNames");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_GetEmitterNames) == 0x000018, "Wrong size on NiagaraExtendsFunctionLibrary_GetEmitterNames");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetEmitterNames, NiagaraComponent) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_GetEmitterNames::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetEmitterNames, ReturnValue) == 0x000008, "Member 'NiagaraExtendsFunctionLibrary_GetEmitterNames::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.GetFinalPostProcessSettings
// 0x0570 (0x0570 - 0x0000)
struct NiagaraExtendsFunctionLibrary_GetFinalPostProcessSettings final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   ReturnValue;                                       // 0x0010(0x0560)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_GetFinalPostProcessSettings) == 0x000010, "Wrong alignment on NiagaraExtendsFunctionLibrary_GetFinalPostProcessSettings");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_GetFinalPostProcessSettings) == 0x000570, "Wrong size on NiagaraExtendsFunctionLibrary_GetFinalPostProcessSettings");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetFinalPostProcessSettings, World) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_GetFinalPostProcessSettings::World' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetFinalPostProcessSettings, ReturnValue) == 0x000010, "Member 'NiagaraExtendsFunctionLibrary_GetFinalPostProcessSettings::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.GetNiagaraEmitterBoolValue
// 0x0030 (0x0030 - 0x0000)
struct NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue final
{
public:
	const class UNiagaraComponent*                NiagaraComponent;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InEmitterName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValueName;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue) == 0x000008, "Wrong alignment on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue) == 0x000030, "Wrong size on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue, NiagaraComponent) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue, InEmitterName) == 0x000008, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue, InValueName) == 0x000018, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue::InValueName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue, ReturnValue) == 0x000028, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterBoolValue::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.GetNiagaraEmitterFloatValue
// 0x0030 (0x0030 - 0x0000)
struct NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue final
{
public:
	const class UNiagaraComponent*                NiagaraComponent;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InEmitterName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValueName;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue) == 0x000008, "Wrong alignment on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue) == 0x000030, "Wrong size on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue, NiagaraComponent) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue, InEmitterName) == 0x000008, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue, InValueName) == 0x000018, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue::InValueName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue, ReturnValue) == 0x000028, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterFloatValue::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.GetNiagaraEmitterIntValue
// 0x0030 (0x0030 - 0x0000)
struct NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue final
{
public:
	const class UNiagaraComponent*                NiagaraComponent;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InEmitterName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValueName;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue) == 0x000008, "Wrong alignment on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue) == 0x000030, "Wrong size on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue, NiagaraComponent) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue, InEmitterName) == 0x000008, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue, InValueName) == 0x000018, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue::InValueName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue, ReturnValue) == 0x000028, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterIntValue::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.GetNiagaraEmitterMatrixValue
// 0x0070 (0x0070 - 0x0000)
struct NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue final
{
public:
	const class UNiagaraComponent*                NiagaraComponent;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InEmitterName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValueName;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatrix                                ReturnValue;                                       // 0x0030(0x0040)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue) == 0x000010, "Wrong alignment on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue) == 0x000070, "Wrong size on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue, NiagaraComponent) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue, InEmitterName) == 0x000008, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue, InValueName) == 0x000018, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue::InValueName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue, ReturnValue) == 0x000030, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterMatrixValue::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.GetNiagaraEmitterQuatValue
// 0x0040 (0x0040 - 0x0000)
struct NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue final
{
public:
	const class UNiagaraComponent*                NiagaraComponent;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InEmitterName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValueName;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue) == 0x000010, "Wrong alignment on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue) == 0x000040, "Wrong size on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue, NiagaraComponent) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue, InEmitterName) == 0x000008, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue, InValueName) == 0x000018, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue::InValueName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue, ReturnValue) == 0x000030, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterQuatValue::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.GetNiagaraEmitterVectorValue
// 0x0038 (0x0038 - 0x0000)
struct NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue final
{
public:
	const class UNiagaraComponent*                NiagaraComponent;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InEmitterName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValueName;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue) == 0x000008, "Wrong alignment on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue) == 0x000038, "Wrong size on NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue, NiagaraComponent) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue, InEmitterName) == 0x000008, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue, InValueName) == 0x000018, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue::InValueName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue, ReturnValue) == 0x000028, "Member 'NiagaraExtendsFunctionLibrary_GetNiagaraEmitterVectorValue::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.GetWarldLevelNames
// 0x0020 (0x0020 - 0x0000)
struct NiagaraExtendsFunctionLibrary_GetWarldLevelNames final
{
public:
	class FString                                 WorldAssetPath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_GetWarldLevelNames) == 0x000008, "Wrong alignment on NiagaraExtendsFunctionLibrary_GetWarldLevelNames");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_GetWarldLevelNames) == 0x000020, "Wrong size on NiagaraExtendsFunctionLibrary_GetWarldLevelNames");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetWarldLevelNames, WorldAssetPath) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_GetWarldLevelNames::WorldAssetPath' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_GetWarldLevelNames, ReturnValue) == 0x000010, "Member 'NiagaraExtendsFunctionLibrary_GetWarldLevelNames::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.OpenAssetEditorWindowFromAsset
// 0x0008 (0x0008 - 0x0000)
struct NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromAsset final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromAsset) == 0x000008, "Wrong alignment on NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromAsset");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromAsset) == 0x000008, "Wrong size on NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromAsset");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromAsset, Asset) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromAsset::Asset' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.OpenAssetEditorWindowFromPath
// 0x0010 (0x0010 - 0x0000)
struct NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromPath final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromPath) == 0x000008, "Wrong alignment on NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromPath");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromPath) == 0x000010, "Wrong size on NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromPath");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromPath, FilePath) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_OpenAssetEditorWindowFromPath::FilePath' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.SetAllNiagaraPaused
// 0x0010 (0x0010 - 0x0000)
struct NiagaraExtendsFunctionLibrary_SetAllNiagaraPaused final
{
public:
	const class UObject*                          InWorldContextObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InPaused;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_SetAllNiagaraPaused) == 0x000008, "Wrong alignment on NiagaraExtendsFunctionLibrary_SetAllNiagaraPaused");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_SetAllNiagaraPaused) == 0x000010, "Wrong size on NiagaraExtendsFunctionLibrary_SetAllNiagaraPaused");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SetAllNiagaraPaused, InWorldContextObject) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_SetAllNiagaraPaused::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SetAllNiagaraPaused, InPaused) == 0x000008, "Member 'NiagaraExtendsFunctionLibrary_SetAllNiagaraPaused::InPaused' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.SpawnActorFromBP
// 0x0060 (0x0060 - 0x0000)
struct NiagaraExtendsFunctionLibrary_SpawnActorFromBP final
{
public:
	class APlayerController*                      InPC;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InBaseAssetPath;                                   // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InBaseTransform;                                   // 0x0020(0x0030)(ConstParm, Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_SpawnActorFromBP) == 0x000010, "Wrong alignment on NiagaraExtendsFunctionLibrary_SpawnActorFromBP");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_SpawnActorFromBP) == 0x000060, "Wrong size on NiagaraExtendsFunctionLibrary_SpawnActorFromBP");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnActorFromBP, InPC) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_SpawnActorFromBP::InPC' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnActorFromBP, InBaseAssetPath) == 0x000008, "Member 'NiagaraExtendsFunctionLibrary_SpawnActorFromBP::InBaseAssetPath' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnActorFromBP, InBaseTransform) == 0x000020, "Member 'NiagaraExtendsFunctionLibrary_SpawnActorFromBP::InBaseTransform' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnActorFromBP, ReturnValue) == 0x000050, "Member 'NiagaraExtendsFunctionLibrary_SpawnActorFromBP::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.SpawnSystemAttached
// 0x0040 (0x0040 - 0x0000)
struct NiagaraExtendsFunctionLibrary_SpawnSystemAttached final
{
public:
	class UNiagaraSystem*                         SystemTemplate;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        AttachToComponent;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachPointName;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EAttachLocation                               LocationType;                                      // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoDestroy;                                      // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteLocation;                                 // 0x0032(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteRotation;                                 // 0x0033(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteScale;                                    // 0x0034(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoActivate;                                     // 0x0035(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENCPoolMethod                                 PoolingMethod;                                     // 0x0036(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreCullCheck;                                     // 0x0037(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      ReturnValue;                                       // 0x0038(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached) == 0x000008, "Wrong alignment on NiagaraExtendsFunctionLibrary_SpawnSystemAttached");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached) == 0x000040, "Wrong size on NiagaraExtendsFunctionLibrary_SpawnSystemAttached");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, SystemTemplate) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::SystemTemplate' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, AttachToComponent) == 0x000008, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::AttachToComponent' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, AttachPointName) == 0x000010, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::AttachPointName' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, Location) == 0x000018, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::Location' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, Rotation) == 0x000024, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::Rotation' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, LocationType) == 0x000030, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::LocationType' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, bAutoDestroy) == 0x000031, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::bAutoDestroy' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, bAbsoluteLocation) == 0x000032, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::bAbsoluteLocation' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, bAbsoluteRotation) == 0x000033, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::bAbsoluteRotation' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, bAbsoluteScale) == 0x000034, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::bAbsoluteScale' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, bAutoActivate) == 0x000035, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::bAutoActivate' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, PoolingMethod) == 0x000036, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::PoolingMethod' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, bPreCullCheck) == 0x000037, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::bPreCullCheck' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttached, ReturnValue) == 0x000038, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttached::ReturnValue' has a wrong offset!");

// Function NiagaraExtends.NiagaraExtendsFunctionLibrary.SpawnSystemAttachedOnCamera
// 0x0018 (0x0018 - 0x0000)
struct NiagaraExtendsFunctionLibrary_SpawnSystemAttachedOnCamera final
{
public:
	class FString                                 WorldAssetPath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraExtendsFunctionLibrary_SpawnSystemAttachedOnCamera) == 0x000008, "Wrong alignment on NiagaraExtendsFunctionLibrary_SpawnSystemAttachedOnCamera");
static_assert(sizeof(NiagaraExtendsFunctionLibrary_SpawnSystemAttachedOnCamera) == 0x000018, "Wrong size on NiagaraExtendsFunctionLibrary_SpawnSystemAttachedOnCamera");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttachedOnCamera, WorldAssetPath) == 0x000000, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttachedOnCamera::WorldAssetPath' has a wrong offset!");
static_assert(offsetof(NiagaraExtendsFunctionLibrary_SpawnSystemAttachedOnCamera, ReturnValue) == 0x000010, "Member 'NiagaraExtendsFunctionLibrary_SpawnSystemAttachedOnCamera::ReturnValue' has a wrong offset!");

}

