#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NiagaraCore_structs.hpp"
#include "NiagaraShader_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum Niagara.ENiagaraSystemSpawnSectionEndBehavior
// NumValues: 0x0004
enum class ENiagaraSystemSpawnSectionEndBehavior : uint32
{
	SetSystemInactive                        = 0,
	Deactivate                               = 1,
	None                                     = 2,
	ENiagaraSystemSpawnSectionEndBehavior_MAX = 3,
};

// Enum Niagara.ENiagaraSystemSpawnSectionEvaluateBehavior
// NumValues: 0x0003
enum class ENiagaraSystemSpawnSectionEvaluateBehavior : uint32
{
	ActivateIfInactive                       = 0,
	None                                     = 1,
	ENiagaraSystemSpawnSectionEvaluateBehavior_MAX = 2,
};

// Enum Niagara.ENiagaraSystemSpawnSectionStartBehavior
// NumValues: 0x0002
enum class ENiagaraSystemSpawnSectionStartBehavior : uint32
{
	Activate                                 = 0,
	ENiagaraSystemSpawnSectionStartBehavior_MAX = 1,
};

// Enum Niagara.ENiagaraBakerViewMode
// NumValues: 0x0009
enum class ENiagaraBakerViewMode : uint32
{
	Perspective                              = 0,
	OrthoFront                               = 1,
	OrthoBack                                = 2,
	OrthoLeft                                = 3,
	OrthoRight                               = 4,
	OrthoTop                                 = 5,
	OrthoBottom                              = 6,
	Num                                      = 7,
	ENiagaraBakerViewMode_MAX                = 8,
};

// Enum Niagara.ENiagaraCollisionMode
// NumValues: 0x0005
enum class ENiagaraCollisionMode : uint8
{
	None                                     = 0,
	SceneGeometry                            = 1,
	DepthBuffer                              = 2,
	DistanceField                            = 3,
	ENiagaraCollisionMode_MAX                = 4,
};

// Enum Niagara.ENiagaraFunctionDebugState
// NumValues: 0x0003
enum class ENiagaraFunctionDebugState : uint8
{
	NoDebug                                  = 0,
	Basic                                    = 1,
	ENiagaraFunctionDebugState_MAX           = 2,
};

// Enum Niagara.ENiagaraSystemInstanceState
// NumValues: 0x0008
enum class ENiagaraSystemInstanceState : uint8
{
	None                                     = 0,
	PendingSpawn                             = 1,
	PendingSpawnPaused                       = 2,
	Spawning                                 = 3,
	Running                                  = 4,
	Paused                                   = 5,
	Num                                      = 6,
	ENiagaraSystemInstanceState_MAX          = 7,
};

// Enum Niagara.ENCPoolMethod
// NumValues: 0x0006
enum class ENCPoolMethod : uint8
{
	None                                     = 0,
	AutoRelease                              = 1,
	ManualRelease                            = 2,
	ManualRelease_OnComplete                 = 3,
	FreeInPool                               = 4,
	ENCPoolMethod_MAX                        = 5,
};

// Enum Niagara.ENiagaraLegacyTrailWidthMode
// NumValues: 0x0004
enum class ENiagaraLegacyTrailWidthMode : uint8
{
	FromCentre                               = 0,
	FromFirst                                = 1,
	FromSecond                               = 2,
	ENiagaraLegacyTrailWidthMode_MAX         = 3,
};

// Enum Niagara.ENiagaraRendererSourceDataMode
// NumValues: 0x0003
enum class ENiagaraRendererSourceDataMode : uint8
{
	Particles                                = 0,
	Emitter                                  = 1,
	ENiagaraRendererSourceDataMode_MAX       = 2,
};

// Enum Niagara.ENiagaraBindingSource
// NumValues: 0x0007
enum class ENiagaraBindingSource : uint8
{
	ImplicitFromSource                       = 0,
	ExplicitParticles                        = 1,
	ExplicitEmitter                          = 2,
	ExplicitSystem                           = 3,
	ExplicitUser                             = 4,
	MaxBindingSource                         = 5,
	ENiagaraBindingSource_MAX                = 6,
};

// Enum Niagara.ENiagaraIterationSource
// NumValues: 0x0003
enum class ENiagaraIterationSource : uint8
{
	Particles                                = 0,
	DataInterface                            = 1,
	ENiagaraIterationSource_MAX              = 2,
};

// Enum Niagara.ENiagaraScriptGroup
// NumValues: 0x0004
enum class ENiagaraScriptGroup : uint8
{
	Particle                                 = 0,
	Emitter                                  = 1,
	System                                   = 2,
	Max                                      = 3,
};

// Enum Niagara.ENiagaraScriptContextStaticSwitch
// NumValues: 0x0004
enum class ENiagaraScriptContextStaticSwitch : uint8
{
	System                                   = 0,
	Emitter                                  = 1,
	Particle                                 = 2,
	ENiagaraScriptContextStaticSwitch_MAX    = 3,
};

// Enum Niagara.ENiagaraCompileUsageStaticSwitch
// NumValues: 0x0006
enum class ENiagaraCompileUsageStaticSwitch : uint8
{
	Spawn                                    = 0,
	Update                                   = 1,
	Event                                    = 2,
	SimulationStage                          = 3,
	Default                                  = 4,
	ENiagaraCompileUsageStaticSwitch_MAX     = 5,
};

// Enum Niagara.ENiagaraScriptUsage
// NumValues: 0x000E
enum class ENiagaraScriptUsage : uint8
{
	Function                                 = 0,
	Module                                   = 1,
	DynamicInput                             = 2,
	ParticleSpawnScript                      = 3,
	ParticleSpawnScriptInterpolated          = 4,
	ParticleUpdateScript                     = 5,
	ParticleEventScript                      = 6,
	ParticleSimulationStageScript            = 7,
	ParticleGPUComputeScript                 = 8,
	EmitterSpawnScript                       = 9,
	EmitterUpdateScript                      = 10,
	SystemSpawnScript                        = 11,
	SystemUpdateScript                       = 12,
	ENiagaraScriptUsage_MAX                  = 13,
};

// Enum Niagara.ENiagaraScriptCompileStatus
// NumValues: 0x0008
enum class ENiagaraScriptCompileStatus : uint8
{
	NCS_Unknown                              = 0,
	NCS_Dirty                                = 1,
	NCS_Error                                = 2,
	NCS_UpToDate                             = 3,
	NCS_BeingCreated                         = 4,
	NCS_UpToDateWithWarnings                 = 5,
	NCS_ComputeUpToDateWithWarnings          = 6,
	NCS_MAX                                  = 7,
};

// Enum Niagara.ENiagaraInputNodeUsage
// NumValues: 0x0007
enum class ENiagaraInputNodeUsage : uint8
{
	Undefined                                = 0,
	Parameter                                = 1,
	Attribute                                = 2,
	SystemConstant                           = 3,
	TranslatorConstant                       = 4,
	RapidIterationParameter                  = 5,
	ENiagaraInputNodeUsage_MAX               = 6,
};

// Enum Niagara.ENiagaraDataSetType
// NumValues: 0x0004
enum class ENiagaraDataSetType : uint8
{
	ParticleData                             = 0,
	Shared                                   = 1,
	Event                                    = 2,
	ENiagaraDataSetType_MAX                  = 3,
};

// Enum Niagara.ENiagaraStatDisplayMode
// NumValues: 0x0003
enum class ENiagaraStatDisplayMode : uint8
{
	Percent                                  = 0,
	Absolute                                 = 1,
	ENiagaraStatDisplayMode_MAX              = 2,
};

// Enum Niagara.ENiagaraStatEvaluationType
// NumValues: 0x0003
enum class ENiagaraStatEvaluationType : uint8
{
	Average                                  = 0,
	Maximum                                  = 1,
	ENiagaraStatEvaluationType_MAX           = 2,
};

// Enum Niagara.ENiagaraAgeUpdateMode
// NumValues: 0x0004
enum class ENiagaraAgeUpdateMode : uint8
{
	TickDeltaTime                            = 0,
	DesiredAge                               = 1,
	DesiredAgeNoSeek                         = 2,
	ENiagaraAgeUpdateMode_MAX                = 3,
};

// Enum Niagara.ENiagaraSimTarget
// NumValues: 0x0003
enum class ENiagaraSimTarget : uint8
{
	CPUSim                                   = 0,
	GPUComputeSim                            = 1,
	ENiagaraSimTarget_MAX                    = 2,
};

// Enum Niagara.ENiagaraRendererMotionVectorSetting
// NumValues: 0x0005
enum class ENiagaraRendererMotionVectorSetting : uint32
{
	AutoDetect                               = 0,
	Precise                                  = 1,
	Approximate                              = 2,
	Disable                                  = 3,
	ENiagaraRendererMotionVectorSetting_MAX  = 4,
};

// Enum Niagara.ENiagaraDefaultRendererMotionVectorSetting
// NumValues: 0x0003
enum class ENiagaraDefaultRendererMotionVectorSetting : uint32
{
	Precise                                  = 0,
	Approximate                              = 1,
	ENiagaraDefaultRendererMotionVectorSetting_MAX = 2,
};

// Enum Niagara.ENiagaraDefaultMode
// NumValues: 0x0005
enum class ENiagaraDefaultMode : uint8
{
	Value                                    = 0,
	Binding                                  = 1,
	Custom                                   = 2,
	FailIfPreviouslyNotSet                   = 3,
	ENiagaraDefaultMode_MAX                  = 4,
};

// Enum Niagara.ENiagaraMipMapGeneration
// NumValues: 0x0004
enum class ENiagaraMipMapGeneration : uint8
{
	Disabled                                 = 0,
	PostStage                                = 1,
	PostSimulate                             = 2,
	ENiagaraMipMapGeneration_MAX             = 3,
};

// Enum Niagara.ENiagaraGpuBufferFormat
// NumValues: 0x0004
enum class ENiagaraGpuBufferFormat : uint8
{
	Float                                    = 0,
	HalfFloat                                = 1,
	UnsignedNormalizedByte                   = 2,
	Max                                      = 3,
};

// Enum Niagara.ENiagaraTickBehavior
// NumValues: 0x0005
enum class ENiagaraTickBehavior : uint8
{
	UsePrereqs                               = 0,
	UseComponentTickGroup                    = 1,
	ForceTickFirst                           = 2,
	ForceTickLast                            = 3,
	ENiagaraTickBehavior_MAX                 = 4,
};

// Enum Niagara.ENDIExport_GPUAllocationMode
// NumValues: 0x0003
enum class ENDIExport_GPUAllocationMode : uint8
{
	FixedSize                                = 0,
	PerParticle                              = 1,
	ENDIExport_MAX                           = 2,
};

// Enum Niagara.ENDILandscape_SourceMode
// NumValues: 0x0004
enum class ENDILandscape_SourceMode : uint8
{
	Default                                  = 0,
	Source                                   = 1,
	AttachParent                             = 2,
	ENDILandscape_MAX                        = 3,
};

// Enum Niagara.ESetResolutionMethod
// NumValues: 0x0004
enum class ESetResolutionMethod : uint32
{
	Independent                              = 0,
	MaxAxis                                  = 1,
	CellSize                                 = 2,
	ESetResolutionMethod_MAX                 = 3,
};

// Enum Niagara.ENDISkeletalMesh_SkinningMode
// NumValues: 0x0005
enum class ENDISkeletalMesh_SkinningMode : uint8
{
	Invalid                                  = 255,
	None                                     = 0,
	SkinOnTheFly                             = 1,
	PreSkin                                  = 2,
	ENDISkeletalMesh_MAX                     = 256,
};

// Enum Niagara.ENDISkeletalMesh_SourceMode
// NumValues: 0x0004
enum class ENDISkeletalMesh_SourceMode : uint8
{
	Default                                  = 0,
	Source                                   = 1,
	AttachParent                             = 2,
	ENDISkeletalMesh_MAX                     = 3,
};

// Enum Niagara.ENDIStaticMesh_SourceMode
// NumValues: 0x0005
enum class ENDIStaticMesh_SourceMode : uint8
{
	Default                                  = 0,
	Source                                   = 1,
	AttachParent                             = 2,
	DefaultMeshOnly                          = 3,
	ENDIStaticMesh_MAX                       = 4,
};

// Enum Niagara.ENiagaraDebugHudVerbosity
// NumValues: 0x0004
enum class ENiagaraDebugHudVerbosity : uint32
{
	None                                     = 0,
	Basic                                    = 1,
	Verbose                                  = 2,
	ENiagaraDebugHudVerbosity_MAX            = 3,
};

// Enum Niagara.ENiagaraDebugHudFont
// NumValues: 0x0003
enum class ENiagaraDebugHudFont : uint32
{
	Small                                    = 0,
	Normal                                   = 1,
	ENiagaraDebugHudFont_MAX                 = 2,
};

// Enum Niagara.ENiagaraDebugHudVAlign
// NumValues: 0x0004
enum class ENiagaraDebugHudVAlign : uint8
{
	Top                                      = 0,
	Center                                   = 1,
	Bottom                                   = 2,
	ENiagaraDebugHudVAlign_MAX               = 3,
};

// Enum Niagara.ENiagaraDebugHudHAlign
// NumValues: 0x0004
enum class ENiagaraDebugHudHAlign : uint8
{
	Left                                     = 0,
	Center                                   = 1,
	Right                                    = 2,
	ENiagaraDebugHudHAlign_MAX               = 3,
};

// Enum Niagara.ENiagaraDebugPlaybackMode
// NumValues: 0x0005
enum class ENiagaraDebugPlaybackMode : uint8
{
	Play                                     = 0,
	Loop                                     = 1,
	Paused                                   = 2,
	Step                                     = 3,
	ENiagaraDebugPlaybackMode_MAX            = 4,
};

// Enum Niagara.ENiagaraScalabilityUpdateFrequency
// NumValues: 0x0006
enum class ENiagaraScalabilityUpdateFrequency : uint32
{
	SpawnOnly                                = 0,
	Low                                      = 1,
	Medium                                   = 2,
	High                                     = 3,
	Continuous                               = 4,
	ENiagaraScalabilityUpdateFrequency_MAX   = 5,
};

// Enum Niagara.ENiagaraCullReaction
// NumValues: 0x0005
enum class ENiagaraCullReaction : uint32
{
	Deactivate                               = 0,
	DeactivateImmediate                      = 1,
	DeactivateResume                         = 2,
	DeactivateImmediateResume                = 3,
	ENiagaraCullReaction_MAX                 = 4,
};

// Enum Niagara.EParticleAllocationMode
// NumValues: 0x0003
enum class EParticleAllocationMode : uint8
{
	AutomaticEstimate                        = 0,
	ManualEstimate                           = 1,
	EParticleAllocationMode_MAX              = 2,
};

// Enum Niagara.EScriptExecutionMode
// NumValues: 0x0004
enum class EScriptExecutionMode : uint8
{
	EveryParticle                            = 0,
	SpawnedParticles                         = 1,
	SingleParticle                           = 2,
	EScriptExecutionMode_MAX                 = 3,
};

// Enum Niagara.ENiagaraSortMode
// NumValues: 0x0006
enum class ENiagaraSortMode : uint8
{
	None                                     = 0,
	ViewDepth                                = 1,
	ViewDistance                             = 2,
	CustomAscending                          = 3,
	CustomDecending                          = 4,
	ENiagaraSortMode_MAX                     = 5,
};

// Enum Niagara.ENiagaraMeshLockedAxisSpace
// NumValues: 0x0004
enum class ENiagaraMeshLockedAxisSpace : uint8
{
	Simulation                               = 0,
	World                                    = 1,
	Local                                    = 2,
	ENiagaraMeshLockedAxisSpace_MAX          = 3,
};

// Enum Niagara.ENiagaraMeshPivotOffsetSpace
// NumValues: 0x0005
enum class ENiagaraMeshPivotOffsetSpace : uint8
{
	Mesh                                     = 0,
	Simulation                               = 1,
	World                                    = 2,
	Local                                    = 3,
	ENiagaraMeshPivotOffsetSpace_MAX         = 4,
};

// Enum Niagara.ENiagaraMeshFacingMode
// NumValues: 0x0005
enum class ENiagaraMeshFacingMode : uint8
{
	Default                                  = 0,
	Velocity                                 = 1,
	CameraPosition                           = 2,
	CameraPlane                              = 3,
	ENiagaraMeshFacingMode_MAX               = 4,
};

// Enum Niagara.ENiagaraPlatformSetState
// NumValues: 0x0005
enum class ENiagaraPlatformSetState : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Active                                   = 2,
	Unknown                                  = 3,
	ENiagaraPlatformSetState_MAX             = 4,
};

// Enum Niagara.ENiagaraPlatformSelectionState
// NumValues: 0x0004
enum class ENiagaraPlatformSelectionState : uint8
{
	Default                                  = 0,
	Enabled                                  = 1,
	Disabled                                 = 2,
	ENiagaraPlatformSelectionState_MAX       = 3,
};

// Enum Niagara.ENiagaraPreviewGridResetMode
// NumValues: 0x0004
enum class ENiagaraPreviewGridResetMode : uint8
{
	Never                                    = 0,
	Individual                               = 1,
	All                                      = 2,
	ENiagaraPreviewGridResetMode_MAX         = 3,
};

// Enum Niagara.ENiagaraRibbonUVDistributionMode
// NumValues: 0x0005
enum class ENiagaraRibbonUVDistributionMode : uint32
{
	ScaledUniformly                          = 0,
	ScaledUsingRibbonSegmentLength           = 1,
	TiledOverRibbonLength                    = 2,
	TiledFromStartOverRibbonLength           = 3,
	ENiagaraRibbonUVDistributionMode_MAX     = 4,
};

// Enum Niagara.ENiagaraRibbonUVEdgeMode
// NumValues: 0x0003
enum class ENiagaraRibbonUVEdgeMode : uint32
{
	SmoothTransition                         = 0,
	Locked                                   = 1,
	ENiagaraRibbonUVEdgeMode_MAX             = 2,
};

// Enum Niagara.ENiagaraRibbonTessellationMode
// NumValues: 0x0004
enum class ENiagaraRibbonTessellationMode : uint8
{
	Automatic                                = 0,
	Custom                                   = 1,
	Disabled                                 = 2,
	ENiagaraRibbonTessellationMode_MAX       = 3,
};

// Enum Niagara.ENiagaraRibbonShapeMode
// NumValues: 0x0005
enum class ENiagaraRibbonShapeMode : uint8
{
	Plane                                    = 0,
	MultiPlane                               = 1,
	Tube                                     = 2,
	Custom                                   = 3,
	ENiagaraRibbonShapeMode_MAX              = 4,
};

// Enum Niagara.ENiagaraRibbonDrawDirection
// NumValues: 0x0003
enum class ENiagaraRibbonDrawDirection : uint8
{
	FrontToBack                              = 0,
	BackToFront                              = 1,
	ENiagaraRibbonDrawDirection_MAX          = 2,
};

// Enum Niagara.ENiagaraRibbonAgeOffsetMode
// NumValues: 0x0003
enum class ENiagaraRibbonAgeOffsetMode : uint8
{
	Scale                                    = 0,
	Clip                                     = 1,
	ENiagaraRibbonAgeOffsetMode_MAX          = 2,
};

// Enum Niagara.ENiagaraRibbonFacingMode
// NumValues: 0x0004
enum class ENiagaraRibbonFacingMode : uint8
{
	Screen                                   = 0,
	Custom                                   = 1,
	CustomSideVector                         = 2,
	ENiagaraRibbonFacingMode_MAX             = 3,
};

// Enum Niagara.ENiagaraScriptTemplateSpecification
// NumValues: 0x0004
enum class ENiagaraScriptTemplateSpecification : uint8
{
	None                                     = 0,
	Template                                 = 1,
	Behavior                                 = 2,
	ENiagaraScriptTemplateSpecification_MAX  = 3,
};

// Enum Niagara.ENiagaraScriptLibraryVisibility
// NumValues: 0x0005
enum class ENiagaraScriptLibraryVisibility : uint8
{
	Invalid                                  = 0,
	Unexposed                                = 1,
	Library                                  = 2,
	Hidden                                   = 3,
	ENiagaraScriptLibraryVisibility_MAX      = 4,
};

// Enum Niagara.ENiagaraModuleDependencyScriptConstraint
// NumValues: 0x0003
enum class ENiagaraModuleDependencyScriptConstraint : uint8
{
	SameScript                               = 0,
	AllScripts                               = 1,
	ENiagaraModuleDependencyScriptConstraint_MAX = 2,
};

// Enum Niagara.ENiagaraModuleDependencyType
// NumValues: 0x0003
enum class ENiagaraModuleDependencyType : uint8
{
	PreDependency                            = 0,
	PostDependency                           = 1,
	ENiagaraModuleDependencyType_MAX         = 2,
};

// Enum Niagara.EUnusedAttributeBehaviour
// NumValues: 0x0006
enum class EUnusedAttributeBehaviour : uint8
{
	Copy                                     = 0,
	Zero                                     = 1,
	None                                     = 2,
	MarkInvalid                              = 3,
	PassThrough                              = 4,
	EUnusedAttributeBehaviour_MAX            = 5,
};

// Enum Niagara.ENDISkelMesh_AdjacencyTriangleIndexFormat
// NumValues: 0x0003
enum class ENDISkelMesh_AdjacencyTriangleIndexFormat : uint8
{
	Full                                     = 0,
	Half                                     = 1,
	ENDISkelMesh_MAX                         = 2,
};

// Enum Niagara.ENDISkelMesh_GpuUniformSamplingFormat
// NumValues: 0x0004
enum class ENDISkelMesh_GpuUniformSamplingFormat : uint8
{
	Full                                     = 0,
	Limited_24_8                             = 1,
	Limited_23_9                             = 2,
	ENDISkelMesh_MAX                         = 3,
};

// Enum Niagara.ENDISkelMesh_GpuMaxInfluences
// NumValues: 0x0004
enum class ENDISkelMesh_GpuMaxInfluences : uint8
{
	AllowMax4                                = 0,
	AllowMax8                                = 1,
	Unlimited                                = 2,
	ENDISkelMesh_MAX                         = 3,
};

// Enum Niagara.ENiagaraSpriteFacingMode
// NumValues: 0x0006
enum class ENiagaraSpriteFacingMode : uint8
{
	FaceCamera                               = 0,
	FaceCameraPlane                          = 1,
	CustomFacingVector                       = 2,
	FaceCameraPosition                       = 3,
	FaceCameraDistanceBlend                  = 4,
	ENiagaraSpriteFacingMode_MAX             = 5,
};

// Enum Niagara.ENiagaraSpriteAlignment
// NumValues: 0x0004
enum class ENiagaraSpriteAlignment : uint8
{
	Unaligned                                = 0,
	VelocityAligned                          = 1,
	CustomAlignment                          = 2,
	ENiagaraSpriteAlignment_MAX              = 3,
};

// Enum Niagara.ENiagaraOrientationAxis
// NumValues: 0x0004
enum class ENiagaraOrientationAxis : uint8
{
	XAxis                                    = 0,
	YAxis                                    = 1,
	ZAxis                                    = 2,
	ENiagaraOrientationAxis_MAX              = 3,
};

// Enum Niagara.ENiagaraPythonUpdateScriptReference
// NumValues: 0x0004
enum class ENiagaraPythonUpdateScriptReference : uint8
{
	None                                     = 0,
	ScriptAsset                              = 1,
	DirectTextEntry                          = 2,
	ENiagaraPythonUpdateScriptReference_MAX  = 3,
};

// Enum Niagara.ENiagaraCoordinateSpace
// NumValues: 0x0004
enum class ENiagaraCoordinateSpace : uint8
{
	Simulation                               = 0,
	World                                    = 1,
	Local                                    = 2,
	ENiagaraCoordinateSpace_MAX              = 3,
};

// Enum Niagara.ENiagaraExecutionState
// NumValues: 0x0007
enum class ENiagaraExecutionState : uint32
{
	Active                                   = 0,
	Inactive                                 = 1,
	InactiveClear                            = 2,
	Complete                                 = 3,
	Disabled                                 = 4,
	Num                                      = 5,
	ENiagaraExecutionState_MAX               = 6,
};

// Enum Niagara.ENiagaraExecutionStateSource
// NumValues: 0x0005
enum class ENiagaraExecutionStateSource : uint8
{
	Scalability                              = 0,
	Internal                                 = 1,
	Owner                                    = 2,
	InternalCompletion                       = 3,
	ENiagaraExecutionStateSource_MAX         = 4,
};

// Enum Niagara.ENiagaraNumericOutputTypeSelectionMode
// NumValues: 0x0005
enum class ENiagaraNumericOutputTypeSelectionMode : uint8
{
	None                                     = 0,
	Largest                                  = 1,
	Smallest                                 = 2,
	Scalar                                   = 3,
	ENiagaraNumericOutputTypeSelectionMode_MAX = 4,
};

// Enum Niagara.ENiagaraVariantMode
// NumValues: 0x0005
enum class ENiagaraVariantMode : uint32
{
	None                                     = 0,
	Object                                   = 1,
	DataInterface                            = 2,
	Bytes                                    = 3,
	ENiagaraVariantMode_MAX                  = 4,
};

// ScriptStruct Niagara.NiagaraOutlinerEmitterInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FNiagaraOutlinerEmitterInstanceData final
{
public:
	class FString                                 EmitterName;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraSimTarget                             SimTarget;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ENiagaraExecutionState                        ExecState;                                         // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumParticles;                                      // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraOutlinerEmitterInstanceData) == 0x000008, "Wrong alignment on FNiagaraOutlinerEmitterInstanceData");
static_assert(sizeof(FNiagaraOutlinerEmitterInstanceData) == 0x000020, "Wrong size on FNiagaraOutlinerEmitterInstanceData");
static_assert(offsetof(FNiagaraOutlinerEmitterInstanceData, EmitterName) == 0x000000, "Member 'FNiagaraOutlinerEmitterInstanceData::EmitterName' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerEmitterInstanceData, SimTarget) == 0x000010, "Member 'FNiagaraOutlinerEmitterInstanceData::SimTarget' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerEmitterInstanceData, ExecState) == 0x000014, "Member 'FNiagaraOutlinerEmitterInstanceData::ExecState' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerEmitterInstanceData, NumParticles) == 0x000018, "Member 'FNiagaraOutlinerEmitterInstanceData::NumParticles' has a wrong offset!");

// ScriptStruct Niagara.NiagaraScalabilityState
// 0x0008 (0x0008 - 0x0000)
struct FNiagaraScalabilityState final
{
public:
	float                                         Significance;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCulled : 1;                                       // 0x0004(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPreviousCulled : 1;                               // 0x0004(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCulledByDistance : 1;                             // 0x0004(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCulledByInstanceCount : 1;                        // 0x0004(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCulledByVisibility : 1;                           // 0x0004(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCulledByGlobalBudget : 1;                         // 0x0004(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraScalabilityState) == 0x000004, "Wrong alignment on FNiagaraScalabilityState");
static_assert(sizeof(FNiagaraScalabilityState) == 0x000008, "Wrong size on FNiagaraScalabilityState");
static_assert(offsetof(FNiagaraScalabilityState, Significance) == 0x000000, "Member 'FNiagaraScalabilityState::Significance' has a wrong offset!");

// ScriptStruct Niagara.NiagaraOutlinerTimingData
// 0x0008 (0x0008 - 0x0000)
struct FNiagaraOutlinerTimingData final
{
public:
	float                                         GameThread;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RenderThread;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraOutlinerTimingData) == 0x000004, "Wrong alignment on FNiagaraOutlinerTimingData");
static_assert(sizeof(FNiagaraOutlinerTimingData) == 0x000008, "Wrong size on FNiagaraOutlinerTimingData");
static_assert(offsetof(FNiagaraOutlinerTimingData, GameThread) == 0x000000, "Member 'FNiagaraOutlinerTimingData::GameThread' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerTimingData, RenderThread) == 0x000004, "Member 'FNiagaraOutlinerTimingData::RenderThread' has a wrong offset!");

// ScriptStruct Niagara.NiagaraOutlinerSystemInstanceData
// 0x0048 (0x0048 - 0x0000)
struct FNiagaraOutlinerSystemInstanceData final
{
public:
	class FString                                 ComponentName;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraOutlinerEmitterInstanceData> Emitters;                                          // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	ENiagaraExecutionState                        ActualExecutionState;                              // 0x0020(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraExecutionState                        RequestedExecutionState;                           // 0x0024(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraScalabilityState               ScalabilityState;                                  // 0x0028(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bPendingKill : 1;                                  // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ENCPoolMethod                                 PoolMethod;                                        // 0x0034(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraOutlinerTimingData             AverageTime;                                       // 0x0038(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FNiagaraOutlinerTimingData             MaxTime;                                           // 0x0040(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraOutlinerSystemInstanceData) == 0x000008, "Wrong alignment on FNiagaraOutlinerSystemInstanceData");
static_assert(sizeof(FNiagaraOutlinerSystemInstanceData) == 0x000048, "Wrong size on FNiagaraOutlinerSystemInstanceData");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, ComponentName) == 0x000000, "Member 'FNiagaraOutlinerSystemInstanceData::ComponentName' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, Emitters) == 0x000010, "Member 'FNiagaraOutlinerSystemInstanceData::Emitters' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, ActualExecutionState) == 0x000020, "Member 'FNiagaraOutlinerSystemInstanceData::ActualExecutionState' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, RequestedExecutionState) == 0x000024, "Member 'FNiagaraOutlinerSystemInstanceData::RequestedExecutionState' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, ScalabilityState) == 0x000028, "Member 'FNiagaraOutlinerSystemInstanceData::ScalabilityState' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, PoolMethod) == 0x000034, "Member 'FNiagaraOutlinerSystemInstanceData::PoolMethod' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, AverageTime) == 0x000038, "Member 'FNiagaraOutlinerSystemInstanceData::AverageTime' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, MaxTime) == 0x000040, "Member 'FNiagaraOutlinerSystemInstanceData::MaxTime' has a wrong offset!");

// ScriptStruct Niagara.NiagaraTypeDefinitionHandle
// 0x0004 (0x0004 - 0x0000)
struct FNiagaraTypeDefinitionHandle final
{
public:
	int32                                         RegisteredTypeIndex;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FNiagaraTypeDefinitionHandle) == 0x000004, "Wrong alignment on FNiagaraTypeDefinitionHandle");
static_assert(sizeof(FNiagaraTypeDefinitionHandle) == 0x000004, "Wrong size on FNiagaraTypeDefinitionHandle");
static_assert(offsetof(FNiagaraTypeDefinitionHandle, RegisteredTypeIndex) == 0x000000, "Member 'FNiagaraTypeDefinitionHandle::RegisteredTypeIndex' has a wrong offset!");

// ScriptStruct Niagara.NiagaraVariableBase
// 0x000C (0x000C - 0x0000)
struct FNiagaraVariableBase
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNiagaraTypeDefinitionHandle           TypeDefHandle;                                     // 0x0008(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FNiagaraVariableBase) == 0x000004, "Wrong alignment on FNiagaraVariableBase");
static_assert(sizeof(FNiagaraVariableBase) == 0x00000C, "Wrong size on FNiagaraVariableBase");
static_assert(offsetof(FNiagaraVariableBase, Name) == 0x000000, "Member 'FNiagaraVariableBase::Name' has a wrong offset!");
static_assert(offsetof(FNiagaraVariableBase, TypeDefHandle) == 0x000008, "Member 'FNiagaraVariableBase::TypeDefHandle' has a wrong offset!");

// ScriptStruct Niagara.NiagaraVariable
// 0x0014 (0x0020 - 0x000C)
struct FNiagaraVariable final : public FNiagaraVariableBase
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 VarData;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FNiagaraVariable) == 0x000008, "Wrong alignment on FNiagaraVariable");
static_assert(sizeof(FNiagaraVariable) == 0x000020, "Wrong size on FNiagaraVariable");
static_assert(offsetof(FNiagaraVariable, VarData) == 0x000010, "Member 'FNiagaraVariable::VarData' has a wrong offset!");

// ScriptStruct Niagara.MovieSceneNiagaraParameterSectionTemplate
// 0x0020 (0x0040 - 0x0020)
struct FMovieSceneNiagaraParameterSectionTemplate : public FMovieSceneEvalTemplate
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x0020(0x0020)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FMovieSceneNiagaraParameterSectionTemplate) == 0x000008, "Wrong alignment on FMovieSceneNiagaraParameterSectionTemplate");
static_assert(sizeof(FMovieSceneNiagaraParameterSectionTemplate) == 0x000040, "Wrong size on FMovieSceneNiagaraParameterSectionTemplate");
static_assert(offsetof(FMovieSceneNiagaraParameterSectionTemplate, Parameter) == 0x000020, "Member 'FMovieSceneNiagaraParameterSectionTemplate::Parameter' has a wrong offset!");

// ScriptStruct Niagara.NiagaraDebuggerExecuteConsoleCommand
// 0x0018 (0x0018 - 0x0000)
struct FNiagaraDebuggerExecuteConsoleCommand final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequiresWorld;                                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraDebuggerExecuteConsoleCommand) == 0x000008, "Wrong alignment on FNiagaraDebuggerExecuteConsoleCommand");
static_assert(sizeof(FNiagaraDebuggerExecuteConsoleCommand) == 0x000018, "Wrong size on FNiagaraDebuggerExecuteConsoleCommand");
static_assert(offsetof(FNiagaraDebuggerExecuteConsoleCommand, Command) == 0x000000, "Member 'FNiagaraDebuggerExecuteConsoleCommand::Command' has a wrong offset!");
static_assert(offsetof(FNiagaraDebuggerExecuteConsoleCommand, bRequiresWorld) == 0x000010, "Member 'FNiagaraDebuggerExecuteConsoleCommand::bRequiresWorld' has a wrong offset!");

// ScriptStruct Niagara.NiagaraDebuggerConnectionClosed
// 0x0020 (0x0020 - 0x0000)
struct FNiagaraDebuggerConnectionClosed final
{
public:
	struct FGuid                                  SessionId;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  InstanceId;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraDebuggerConnectionClosed) == 0x000004, "Wrong alignment on FNiagaraDebuggerConnectionClosed");
static_assert(sizeof(FNiagaraDebuggerConnectionClosed) == 0x000020, "Wrong size on FNiagaraDebuggerConnectionClosed");
static_assert(offsetof(FNiagaraDebuggerConnectionClosed, SessionId) == 0x000000, "Member 'FNiagaraDebuggerConnectionClosed::SessionId' has a wrong offset!");
static_assert(offsetof(FNiagaraDebuggerConnectionClosed, InstanceId) == 0x000010, "Member 'FNiagaraDebuggerConnectionClosed::InstanceId' has a wrong offset!");

// ScriptStruct Niagara.NiagaraDebuggerAcceptConnection
// 0x0020 (0x0020 - 0x0000)
struct FNiagaraDebuggerAcceptConnection final
{
public:
	struct FGuid                                  SessionId;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  InstanceId;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraDebuggerAcceptConnection) == 0x000004, "Wrong alignment on FNiagaraDebuggerAcceptConnection");
static_assert(sizeof(FNiagaraDebuggerAcceptConnection) == 0x000020, "Wrong size on FNiagaraDebuggerAcceptConnection");
static_assert(offsetof(FNiagaraDebuggerAcceptConnection, SessionId) == 0x000000, "Member 'FNiagaraDebuggerAcceptConnection::SessionId' has a wrong offset!");
static_assert(offsetof(FNiagaraDebuggerAcceptConnection, InstanceId) == 0x000010, "Member 'FNiagaraDebuggerAcceptConnection::InstanceId' has a wrong offset!");

// ScriptStruct Niagara.MovieSceneNiagaraBoolParameterSectionTemplate
// 0x0090 (0x00D0 - 0x0040)
struct FMovieSceneNiagaraBoolParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneBoolChannel                 BoolChannel;                                       // 0x0040(0x0090)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FMovieSceneNiagaraBoolParameterSectionTemplate) == 0x000008, "Wrong alignment on FMovieSceneNiagaraBoolParameterSectionTemplate");
static_assert(sizeof(FMovieSceneNiagaraBoolParameterSectionTemplate) == 0x0000D0, "Wrong size on FMovieSceneNiagaraBoolParameterSectionTemplate");
static_assert(offsetof(FMovieSceneNiagaraBoolParameterSectionTemplate, BoolChannel) == 0x000040, "Member 'FMovieSceneNiagaraBoolParameterSectionTemplate::BoolChannel' has a wrong offset!");

// ScriptStruct Niagara.NiagaraDeviceProfileStateEntry
// 0x0010 (0x0010 - 0x0000)
struct FNiagaraDeviceProfileStateEntry final
{
public:
	class FName                                   ProfileName;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        QualityLevelMask;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SetQualityLevelMask;                               // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraDeviceProfileStateEntry) == 0x000004, "Wrong alignment on FNiagaraDeviceProfileStateEntry");
static_assert(sizeof(FNiagaraDeviceProfileStateEntry) == 0x000010, "Wrong size on FNiagaraDeviceProfileStateEntry");
static_assert(offsetof(FNiagaraDeviceProfileStateEntry, ProfileName) == 0x000000, "Member 'FNiagaraDeviceProfileStateEntry::ProfileName' has a wrong offset!");
static_assert(offsetof(FNiagaraDeviceProfileStateEntry, QualityLevelMask) == 0x000008, "Member 'FNiagaraDeviceProfileStateEntry::QualityLevelMask' has a wrong offset!");
static_assert(offsetof(FNiagaraDeviceProfileStateEntry, SetQualityLevelMask) == 0x00000C, "Member 'FNiagaraDeviceProfileStateEntry::SetQualityLevelMask' has a wrong offset!");

// ScriptStruct Niagara.NiagaraPlatformSetCVarCondition
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FNiagaraPlatformSetCVarCondition final
{
public:
	class FName                                   CVarName;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinInt;                                            // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxInt;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinFloat;                                          // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxFloat;                                          // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseMinInt : 1;                                    // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseMaxInt : 1;                                    // 0x001C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseMinFloat : 1;                                  // 0x001C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseMaxFloat : 1;                                  // 0x001C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1D[0xB];                                       // 0x001D(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraPlatformSetCVarCondition) == 0x000008, "Wrong alignment on FNiagaraPlatformSetCVarCondition");
static_assert(sizeof(FNiagaraPlatformSetCVarCondition) == 0x000028, "Wrong size on FNiagaraPlatformSetCVarCondition");
static_assert(offsetof(FNiagaraPlatformSetCVarCondition, CVarName) == 0x000000, "Member 'FNiagaraPlatformSetCVarCondition::CVarName' has a wrong offset!");
static_assert(offsetof(FNiagaraPlatformSetCVarCondition, Value) == 0x000008, "Member 'FNiagaraPlatformSetCVarCondition::Value' has a wrong offset!");
static_assert(offsetof(FNiagaraPlatformSetCVarCondition, MinInt) == 0x00000C, "Member 'FNiagaraPlatformSetCVarCondition::MinInt' has a wrong offset!");
static_assert(offsetof(FNiagaraPlatformSetCVarCondition, MaxInt) == 0x000010, "Member 'FNiagaraPlatformSetCVarCondition::MaxInt' has a wrong offset!");
static_assert(offsetof(FNiagaraPlatformSetCVarCondition, MinFloat) == 0x000014, "Member 'FNiagaraPlatformSetCVarCondition::MinFloat' has a wrong offset!");
static_assert(offsetof(FNiagaraPlatformSetCVarCondition, MaxFloat) == 0x000018, "Member 'FNiagaraPlatformSetCVarCondition::MaxFloat' has a wrong offset!");

// ScriptStruct Niagara.NiagaraPlatformSet
// 0x0030 (0x0030 - 0x0000)
struct FNiagaraPlatformSet final
{
public:
	int32                                         QualityLevelMask;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNiagaraDeviceProfileStateEntry> DeviceProfileStates;                               // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraPlatformSetCVarCondition> CVarConditions;                                    // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraPlatformSet) == 0x000008, "Wrong alignment on FNiagaraPlatformSet");
static_assert(sizeof(FNiagaraPlatformSet) == 0x000030, "Wrong size on FNiagaraPlatformSet");
static_assert(offsetof(FNiagaraPlatformSet, QualityLevelMask) == 0x000000, "Member 'FNiagaraPlatformSet::QualityLevelMask' has a wrong offset!");
static_assert(offsetof(FNiagaraPlatformSet, DeviceProfileStates) == 0x000008, "Member 'FNiagaraPlatformSet::DeviceProfileStates' has a wrong offset!");
static_assert(offsetof(FNiagaraPlatformSet, CVarConditions) == 0x000018, "Member 'FNiagaraPlatformSet::CVarConditions' has a wrong offset!");

// ScriptStruct Niagara.NiagaraEmitterScalabilitySettings
// 0x0038 (0x0038 - 0x0000)
struct FNiagaraEmitterScalabilitySettings
{
public:
	struct FNiagaraPlatformSet                    Platforms;                                         // 0x0000(0x0030)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bScaleSpawnCount : 1;                              // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpawnCountScale;                                   // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraEmitterScalabilitySettings) == 0x000008, "Wrong alignment on FNiagaraEmitterScalabilitySettings");
static_assert(sizeof(FNiagaraEmitterScalabilitySettings) == 0x000038, "Wrong size on FNiagaraEmitterScalabilitySettings");
static_assert(offsetof(FNiagaraEmitterScalabilitySettings, Platforms) == 0x000000, "Member 'FNiagaraEmitterScalabilitySettings::Platforms' has a wrong offset!");
static_assert(offsetof(FNiagaraEmitterScalabilitySettings, SpawnCountScale) == 0x000034, "Member 'FNiagaraEmitterScalabilitySettings::SpawnCountScale' has a wrong offset!");

// ScriptStruct Niagara.NiagaraEmitterScalabilityOverride
// 0x0008 (0x0040 - 0x0038)
struct FNiagaraEmitterScalabilityOverride final : public FNiagaraEmitterScalabilitySettings
{
public:
	uint8                                         bOverrideSpawnCountScale : 1;                      // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraEmitterScalabilityOverride) == 0x000008, "Wrong alignment on FNiagaraEmitterScalabilityOverride");
static_assert(sizeof(FNiagaraEmitterScalabilityOverride) == 0x000040, "Wrong size on FNiagaraEmitterScalabilityOverride");

// ScriptStruct Niagara.NiagaraEmitterScalabilityOverrides
// 0x0010 (0x0010 - 0x0000)
struct FNiagaraEmitterScalabilityOverrides final
{
public:
	TArray<struct FNiagaraEmitterScalabilityOverride> Overrides;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraEmitterScalabilityOverrides) == 0x000008, "Wrong alignment on FNiagaraEmitterScalabilityOverrides");
static_assert(sizeof(FNiagaraEmitterScalabilityOverrides) == 0x000010, "Wrong size on FNiagaraEmitterScalabilityOverrides");
static_assert(offsetof(FNiagaraEmitterScalabilityOverrides, Overrides) == 0x000000, "Member 'FNiagaraEmitterScalabilityOverrides::Overrides' has a wrong offset!");

// ScriptStruct Niagara.MovieSceneNiagaraColorParameterSectionTemplate
// 0x0280 (0x02C0 - 0x0040)
struct FMovieSceneNiagaraColorParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneFloatChannel                RedChannel;                                        // 0x0040(0x00A0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                GreenChannel;                                      // 0x00E0(0x00A0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                BlueChannel;                                       // 0x0180(0x00A0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                AlphaChannel;                                      // 0x0220(0x00A0)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FMovieSceneNiagaraColorParameterSectionTemplate) == 0x000008, "Wrong alignment on FMovieSceneNiagaraColorParameterSectionTemplate");
static_assert(sizeof(FMovieSceneNiagaraColorParameterSectionTemplate) == 0x0002C0, "Wrong size on FMovieSceneNiagaraColorParameterSectionTemplate");
static_assert(offsetof(FMovieSceneNiagaraColorParameterSectionTemplate, RedChannel) == 0x000040, "Member 'FMovieSceneNiagaraColorParameterSectionTemplate::RedChannel' has a wrong offset!");
static_assert(offsetof(FMovieSceneNiagaraColorParameterSectionTemplate, GreenChannel) == 0x0000E0, "Member 'FMovieSceneNiagaraColorParameterSectionTemplate::GreenChannel' has a wrong offset!");
static_assert(offsetof(FMovieSceneNiagaraColorParameterSectionTemplate, BlueChannel) == 0x000180, "Member 'FMovieSceneNiagaraColorParameterSectionTemplate::BlueChannel' has a wrong offset!");
static_assert(offsetof(FMovieSceneNiagaraColorParameterSectionTemplate, AlphaChannel) == 0x000220, "Member 'FMovieSceneNiagaraColorParameterSectionTemplate::AlphaChannel' has a wrong offset!");

// ScriptStruct Niagara.MovieSceneNiagaraFloatParameterSectionTemplate
// 0x00A0 (0x00E0 - 0x0040)
struct FMovieSceneNiagaraFloatParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneFloatChannel                FloatChannel;                                      // 0x0040(0x00A0)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FMovieSceneNiagaraFloatParameterSectionTemplate) == 0x000008, "Wrong alignment on FMovieSceneNiagaraFloatParameterSectionTemplate");
static_assert(sizeof(FMovieSceneNiagaraFloatParameterSectionTemplate) == 0x0000E0, "Wrong size on FMovieSceneNiagaraFloatParameterSectionTemplate");
static_assert(offsetof(FMovieSceneNiagaraFloatParameterSectionTemplate, FloatChannel) == 0x000040, "Member 'FMovieSceneNiagaraFloatParameterSectionTemplate::FloatChannel' has a wrong offset!");

// ScriptStruct Niagara.NiagaraHalfVector2
// 0x0004 (0x0004 - 0x0000)
struct FNiagaraHalfVector2 final
{
public:
	uint16                                        X;                                                 // 0x0000(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        Y;                                                 // 0x0002(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraHalfVector2) == 0x000002, "Wrong alignment on FNiagaraHalfVector2");
static_assert(sizeof(FNiagaraHalfVector2) == 0x000004, "Wrong size on FNiagaraHalfVector2");
static_assert(offsetof(FNiagaraHalfVector2, X) == 0x000000, "Member 'FNiagaraHalfVector2::X' has a wrong offset!");
static_assert(offsetof(FNiagaraHalfVector2, Y) == 0x000002, "Member 'FNiagaraHalfVector2::Y' has a wrong offset!");

// ScriptStruct Niagara.MovieSceneNiagaraIntegerParameterSectionTemplate
// 0x0090 (0x00D0 - 0x0040)
struct FMovieSceneNiagaraIntegerParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneIntegerChannel              IntegerChannel;                                    // 0x0040(0x0090)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FMovieSceneNiagaraIntegerParameterSectionTemplate) == 0x000008, "Wrong alignment on FMovieSceneNiagaraIntegerParameterSectionTemplate");
static_assert(sizeof(FMovieSceneNiagaraIntegerParameterSectionTemplate) == 0x0000D0, "Wrong size on FMovieSceneNiagaraIntegerParameterSectionTemplate");
static_assert(offsetof(FMovieSceneNiagaraIntegerParameterSectionTemplate, IntegerChannel) == 0x000040, "Member 'FMovieSceneNiagaraIntegerParameterSectionTemplate::IntegerChannel' has a wrong offset!");

// ScriptStruct Niagara.MovieSceneNiagaraSystemTrackImplementation
// 0x0018 (0x0028 - 0x0010)
struct FMovieSceneNiagaraSystemTrackImplementation final : public FMovieSceneTrackImplementation
{
public:
	struct FFrameNumber                           SpawnSectionStartFrame;                            // 0x0010(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameNumber                           SpawnSectionEndFrame;                              // 0x0014(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionStartBehavior       SpawnSectionStartBehavior;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEvaluateBehavior    SpawnSectionEvaluateBehavior;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEndBehavior         SpawnSectionEndBehavior;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraAgeUpdateMode                         AgeUpdateMode;                                     // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMovieSceneNiagaraSystemTrackImplementation) == 0x000008, "Wrong alignment on FMovieSceneNiagaraSystemTrackImplementation");
static_assert(sizeof(FMovieSceneNiagaraSystemTrackImplementation) == 0x000028, "Wrong size on FMovieSceneNiagaraSystemTrackImplementation");
static_assert(offsetof(FMovieSceneNiagaraSystemTrackImplementation, SpawnSectionStartFrame) == 0x000010, "Member 'FMovieSceneNiagaraSystemTrackImplementation::SpawnSectionStartFrame' has a wrong offset!");
static_assert(offsetof(FMovieSceneNiagaraSystemTrackImplementation, SpawnSectionEndFrame) == 0x000014, "Member 'FMovieSceneNiagaraSystemTrackImplementation::SpawnSectionEndFrame' has a wrong offset!");
static_assert(offsetof(FMovieSceneNiagaraSystemTrackImplementation, SpawnSectionStartBehavior) == 0x000018, "Member 'FMovieSceneNiagaraSystemTrackImplementation::SpawnSectionStartBehavior' has a wrong offset!");
