#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "MovieScene_classes.hpp"
#include "Niagara_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "NiagaraShader_classes.hpp"
#include "NiagaraCore_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class Niagara.NiagaraDataInterface
// 0x0010 (0x0038 - 0x0028)
class UNiagaraDataInterface : public UNiagaraDataInterfaceBase
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterface">();
	}
	static class UNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface>();
	}
};
static_assert(alignof(UNiagaraDataInterface) == 0x000008, "Wrong alignment on UNiagaraDataInterface");
static_assert(sizeof(UNiagaraDataInterface) == 0x000038, "Wrong size on UNiagaraDataInterface");

// Class Niagara.NiagaraDataInterfaceSpline
// 0x0028 (0x0060 - 0x0038)
class UNiagaraDataInterfaceSpline final : public UNiagaraDataInterface
{
public:
	class AActor*                                 Source;                                            // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraUserParameterBinding           SplineUserParameter;                               // 0x0040(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceSpline">();
	}
	static class UNiagaraDataInterfaceSpline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceSpline>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceSpline) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceSpline");
static_assert(sizeof(UNiagaraDataInterfaceSpline) == 0x000060, "Wrong size on UNiagaraDataInterfaceSpline");
static_assert(offsetof(UNiagaraDataInterfaceSpline, Source) == 0x000038, "Member 'UNiagaraDataInterfaceSpline::Source' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSpline, SplineUserParameter) == 0x000040, "Member 'UNiagaraDataInterfaceSpline::SplineUserParameter' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraTrack
// 0x0010 (0x00A0 - 0x0090)
class UMovieSceneNiagaraTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0090(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraTrack">();
	}
	static class UMovieSceneNiagaraTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraTrack");
static_assert(sizeof(UMovieSceneNiagaraTrack) == 0x0000A0, "Wrong size on UMovieSceneNiagaraTrack");
static_assert(offsetof(UMovieSceneNiagaraTrack, Sections) == 0x000090, "Member 'UMovieSceneNiagaraTrack::Sections' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraSystemTrack
// 0x0008 (0x00A8 - 0x00A0)
class UMovieSceneNiagaraSystemTrack final : public UMovieSceneNiagaraTrack
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraSystemTrack">();
	}
	static class UMovieSceneNiagaraSystemTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraSystemTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraSystemTrack");
static_assert(sizeof(UMovieSceneNiagaraSystemTrack) == 0x0000A8, "Wrong size on UMovieSceneNiagaraSystemTrack");

// Class Niagara.NiagaraDataInterfaceRWBase
// 0x00A0 (0x00D8 - 0x0038)
class UNiagaraDataInterfaceRWBase : public UNiagaraDataInterface
{
public:
	TSet<int32>                                   OutputShaderStages;                                // 0x0038(0x0050)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	TSet<int32>                                   IterationShaderStages;                             // 0x0088(0x0050)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceRWBase">();
	}
	static class UNiagaraDataInterfaceRWBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRWBase>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceRWBase) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceRWBase");
static_assert(sizeof(UNiagaraDataInterfaceRWBase) == 0x0000D8, "Wrong size on UNiagaraDataInterfaceRWBase");
static_assert(offsetof(UNiagaraDataInterfaceRWBase, OutputShaderStages) == 0x000038, "Member 'UNiagaraDataInterfaceRWBase::OutputShaderStages' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRWBase, IterationShaderStages) == 0x000088, "Member 'UNiagaraDataInterfaceRWBase::IterationShaderStages' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceParticleRead
// 0x0010 (0x00E8 - 0x00D8)
class UNiagaraDataInterfaceParticleRead final : public UNiagaraDataInterfaceRWBase
{
public:
	class FString                                 EmitterName;                                       // 0x00D8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceParticleRead">();
	}
	static class UNiagaraDataInterfaceParticleRead* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceParticleRead>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceParticleRead) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceParticleRead");
static_assert(sizeof(UNiagaraDataInterfaceParticleRead) == 0x0000E8, "Wrong size on UNiagaraDataInterfaceParticleRead");
static_assert(offsetof(UNiagaraDataInterfaceParticleRead, EmitterName) == 0x0000D8, "Member 'UNiagaraDataInterfaceParticleRead::EmitterName' has a wrong offset!");

// Class Niagara.NiagaraDataInterfacePlatformSet
// 0x0030 (0x0068 - 0x0038)
class UNiagaraDataInterfacePlatformSet final : public UNiagaraDataInterface
{
public:
	struct FNiagaraPlatformSet                    Platforms;                                         // 0x0038(0x0030)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfacePlatformSet">();
	}
	static class UNiagaraDataInterfacePlatformSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfacePlatformSet>();
	}
};
static_assert(alignof(UNiagaraDataInterfacePlatformSet) == 0x000008, "Wrong alignment on UNiagaraDataInterfacePlatformSet");
static_assert(sizeof(UNiagaraDataInterfacePlatformSet) == 0x000068, "Wrong size on UNiagaraDataInterfacePlatformSet");
static_assert(offsetof(UNiagaraDataInterfacePlatformSet, Platforms) == 0x000038, "Member 'UNiagaraDataInterfacePlatformSet::Platforms' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraParameterTrack
// 0x0020 (0x00C0 - 0x00A0)
class UMovieSceneNiagaraParameterTrack : public UMovieSceneNiagaraTrack
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x00A0(0x0020)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraParameterTrack">();
	}
	static class UMovieSceneNiagaraParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraParameterTrack) == 0x0000C0, "Wrong size on UMovieSceneNiagaraParameterTrack");
static_assert(offsetof(UMovieSceneNiagaraParameterTrack, Parameter) == 0x0000A0, "Member 'UMovieSceneNiagaraParameterTrack::Parameter' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceRenderTarget2D
// 0x00D0 (0x01A8 - 0x00D8)
class UNiagaraDataInterfaceRenderTarget2D final : public UNiagaraDataInterfaceRWBase
{
public:
	struct FIntPoint                              Size;                                              // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraMipMapGeneration                      MipMapGeneration;                                  // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureRenderTargetFormat                    OverrideRenderTargetFormat;                        // 0x00E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInheritUserParameterSettings : 1;                 // 0x00E2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideFormat : 1;                               // 0x00E2(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraUserParameterBinding           RenderTargetUserParameter;                         // 0x00E8(0x0020)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x50];                                     // 0x0108(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint64, class UTextureRenderTarget2D*>   ManagedRenderTargets;                              // 0x0158(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceRenderTarget2D">();
	}
	static class UNiagaraDataInterfaceRenderTarget2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRenderTarget2D>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceRenderTarget2D) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceRenderTarget2D");
static_assert(sizeof(UNiagaraDataInterfaceRenderTarget2D) == 0x0001A8, "Wrong size on UNiagaraDataInterfaceRenderTarget2D");
static_assert(offsetof(UNiagaraDataInterfaceRenderTarget2D, Size) == 0x0000D8, "Member 'UNiagaraDataInterfaceRenderTarget2D::Size' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTarget2D, MipMapGeneration) == 0x0000E0, "Member 'UNiagaraDataInterfaceRenderTarget2D::MipMapGeneration' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTarget2D, OverrideRenderTargetFormat) == 0x0000E1, "Member 'UNiagaraDataInterfaceRenderTarget2D::OverrideRenderTargetFormat' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTarget2D, RenderTargetUserParameter) == 0x0000E8, "Member 'UNiagaraDataInterfaceRenderTarget2D::RenderTargetUserParameter' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTarget2D, ManagedRenderTargets) == 0x000158, "Member 'UNiagaraDataInterfaceRenderTarget2D::ManagedRenderTargets' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraBoolParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraBoolParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraBoolParameterTrack">();
	}
	static class UMovieSceneNiagaraBoolParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraBoolParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraBoolParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraBoolParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraBoolParameterTrack) == 0x0000C8, "Wrong size on UMovieSceneNiagaraBoolParameterTrack");

// Class Niagara.NiagaraDataInterfaceRenderTarget2DArray
// 0x0080 (0x0158 - 0x00D8)
class UNiagaraDataInterfaceRenderTarget2DArray final : public UNiagaraDataInterfaceRWBase
{
public:
	struct FIntVector                             Size;                                              // 0x00D8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureRenderTargetFormat                    OverrideRenderTargetFormat;                        // 0x00E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInheritUserParameterSettings : 1;                 // 0x00E5(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideFormat : 1;                               // 0x00E5(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraUserParameterBinding           RenderTargetUserParameter;                         // 0x00E8(0x0020)(Edit, NativeAccessSpecifierPublic)
	TMap<uint64, class UTextureRenderTarget2DArray*> ManagedRenderTargets;                              // 0x0108(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceRenderTarget2DArray">();
	}
	static class UNiagaraDataInterfaceRenderTarget2DArray* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRenderTarget2DArray>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceRenderTarget2DArray) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceRenderTarget2DArray");
static_assert(sizeof(UNiagaraDataInterfaceRenderTarget2DArray) == 0x000158, "Wrong size on UNiagaraDataInterfaceRenderTarget2DArray");
static_assert(offsetof(UNiagaraDataInterfaceRenderTarget2DArray, Size) == 0x0000D8, "Member 'UNiagaraDataInterfaceRenderTarget2DArray::Size' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTarget2DArray, OverrideRenderTargetFormat) == 0x0000E4, "Member 'UNiagaraDataInterfaceRenderTarget2DArray::OverrideRenderTargetFormat' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTarget2DArray, RenderTargetUserParameter) == 0x0000E8, "Member 'UNiagaraDataInterfaceRenderTarget2DArray::RenderTargetUserParameter' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTarget2DArray, ManagedRenderTargets) == 0x000108, "Member 'UNiagaraDataInterfaceRenderTarget2DArray::ManagedRenderTargets' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraColorParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraColorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraColorParameterTrack">();
	}
	static class UMovieSceneNiagaraColorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraColorParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraColorParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraColorParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraColorParameterTrack) == 0x0000C8, "Wrong size on UMovieSceneNiagaraColorParameterTrack");

// Class Niagara.NiagaraDataInterfaceRenderTargetCube
// 0x0078 (0x0150 - 0x00D8)
class UNiagaraDataInterfaceRenderTargetCube final : public UNiagaraDataInterfaceRWBase
{
public:
	int32                                         Size;                                              // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureRenderTargetFormat                    OverrideRenderTargetFormat;                        // 0x00DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInheritUserParameterSettings : 1;                 // 0x00DD(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideFormat : 1;                               // 0x00DD(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraUserParameterBinding           RenderTargetUserParameter;                         // 0x00E0(0x0020)(Edit, NativeAccessSpecifierPublic)
	TMap<uint64, class UTextureRenderTargetCube*> ManagedRenderTargets;                              // 0x0100(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceRenderTargetCube">();
	}
	static class UNiagaraDataInterfaceRenderTargetCube* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRenderTargetCube>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceRenderTargetCube) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceRenderTargetCube");
static_assert(sizeof(UNiagaraDataInterfaceRenderTargetCube) == 0x000150, "Wrong size on UNiagaraDataInterfaceRenderTargetCube");
static_assert(offsetof(UNiagaraDataInterfaceRenderTargetCube, Size) == 0x0000D8, "Member 'UNiagaraDataInterfaceRenderTargetCube::Size' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTargetCube, OverrideRenderTargetFormat) == 0x0000DC, "Member 'UNiagaraDataInterfaceRenderTargetCube::OverrideRenderTargetFormat' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTargetCube, RenderTargetUserParameter) == 0x0000E0, "Member 'UNiagaraDataInterfaceRenderTargetCube::RenderTargetUserParameter' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTargetCube, ManagedRenderTargets) == 0x000100, "Member 'UNiagaraDataInterfaceRenderTargetCube::ManagedRenderTargets' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraFloatParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraFloatParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraFloatParameterTrack">();
	}
	static class UMovieSceneNiagaraFloatParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraFloatParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraFloatParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraFloatParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraFloatParameterTrack) == 0x0000C8, "Wrong size on UMovieSceneNiagaraFloatParameterTrack");

// Class Niagara.NiagaraDataInterfaceRenderTargetVolume
// 0x0080 (0x0158 - 0x00D8)
class UNiagaraDataInterfaceRenderTargetVolume final : public UNiagaraDataInterfaceRWBase
{
public:
	struct FIntVector                             Size;                                              // 0x00D8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureRenderTargetFormat                    OverrideRenderTargetFormat;                        // 0x00E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInheritUserParameterSettings : 1;                 // 0x00E5(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideFormat : 1;                               // 0x00E5(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraUserParameterBinding           RenderTargetUserParameter;                         // 0x00E8(0x0020)(Edit, NativeAccessSpecifierPublic)
	TMap<uint64, class UTextureRenderTargetVolume*> ManagedRenderTargets;                              // 0x0108(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceRenderTargetVolume">();
	}
	static class UNiagaraDataInterfaceRenderTargetVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRenderTargetVolume>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceRenderTargetVolume) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceRenderTargetVolume");
static_assert(sizeof(UNiagaraDataInterfaceRenderTargetVolume) == 0x000158, "Wrong size on UNiagaraDataInterfaceRenderTargetVolume");
static_assert(offsetof(UNiagaraDataInterfaceRenderTargetVolume, Size) == 0x0000D8, "Member 'UNiagaraDataInterfaceRenderTargetVolume::Size' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTargetVolume, OverrideRenderTargetFormat) == 0x0000E4, "Member 'UNiagaraDataInterfaceRenderTargetVolume::OverrideRenderTargetFormat' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTargetVolume, RenderTargetUserParameter) == 0x0000E8, "Member 'UNiagaraDataInterfaceRenderTargetVolume::RenderTargetUserParameter' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRenderTargetVolume, ManagedRenderTargets) == 0x000108, "Member 'UNiagaraDataInterfaceRenderTargetVolume::ManagedRenderTargets' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraIntegerParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraIntegerParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraIntegerParameterTrack">();
	}
	static class UMovieSceneNiagaraIntegerParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraIntegerParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraIntegerParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraIntegerParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraIntegerParameterTrack) == 0x0000C8, "Wrong size on UMovieSceneNiagaraIntegerParameterTrack");

// Class Niagara.NiagaraDataInterfaceSkeletalMesh
// 0x0090 (0x00C8 - 0x0038)
class UNiagaraDataInterfaceSkeletalMesh final : public UNiagaraDataInterface
{
public:
	ENDISkeletalMesh_SourceMode                   SourceMode;                                        // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Source;                                            // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraUserParameterBinding           MeshUserParameter;                                 // 0x0048(0x0020)(Edit, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SourceComponent;                                   // 0x0068(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENDISkeletalMesh_SkinningMode                 SkinningMode;                                      // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SamplingRegions;                                   // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         WholeMeshLOD;                                      // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           FilteredBones;                                     // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           FilteredSockets;                                   // 0x00A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   ExcludeBoneName;                                   // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bExcludeBone : 1;                                  // 0x00B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UvSetIndex;                                        // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireCurrentFrameData;                          // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceSkeletalMesh">();
	}
	static class UNiagaraDataInterfaceSkeletalMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceSkeletalMesh>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceSkeletalMesh) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceSkeletalMesh");
static_assert(sizeof(UNiagaraDataInterfaceSkeletalMesh) == 0x0000C8, "Wrong size on UNiagaraDataInterfaceSkeletalMesh");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, SourceMode) == 0x000038, "Member 'UNiagaraDataInterfaceSkeletalMesh::SourceMode' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, Source) == 0x000040, "Member 'UNiagaraDataInterfaceSkeletalMesh::Source' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, MeshUserParameter) == 0x000048, "Member 'UNiagaraDataInterfaceSkeletalMesh::MeshUserParameter' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, SourceComponent) == 0x000068, "Member 'UNiagaraDataInterfaceSkeletalMesh::SourceComponent' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, SkinningMode) == 0x000070, "Member 'UNiagaraDataInterfaceSkeletalMesh::SkinningMode' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, SamplingRegions) == 0x000078, "Member 'UNiagaraDataInterfaceSkeletalMesh::SamplingRegions' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, WholeMeshLOD) == 0x000088, "Member 'UNiagaraDataInterfaceSkeletalMesh::WholeMeshLOD' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, FilteredBones) == 0x000090, "Member 'UNiagaraDataInterfaceSkeletalMesh::FilteredBones' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, FilteredSockets) == 0x0000A0, "Member 'UNiagaraDataInterfaceSkeletalMesh::FilteredSockets' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, ExcludeBoneName) == 0x0000B0, "Member 'UNiagaraDataInterfaceSkeletalMesh::ExcludeBoneName' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, UvSetIndex) == 0x0000BC, "Member 'UNiagaraDataInterfaceSkeletalMesh::UvSetIndex' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceSkeletalMesh, bRequireCurrentFrameData) == 0x0000C0, "Member 'UNiagaraDataInterfaceSkeletalMesh::bRequireCurrentFrameData' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraSystemSpawnSection
// 0x0010 (0x00F8 - 0x00E8)
class UMovieSceneNiagaraSystemSpawnSection final : public UMovieSceneSection
{
public:
	ENiagaraSystemSpawnSectionStartBehavior       SectionStartBehavior;                              // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEvaluateBehavior    SectionEvaluateBehavior;                           // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEndBehavior         SectionEndBehavior;                                // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraAgeUpdateMode                         AgeUpdateMode;                                     // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraSystemSpawnSection">();
	}
	static class UMovieSceneNiagaraSystemSpawnSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemSpawnSection>();
	}
};
static_assert(alignof(UMovieSceneNiagaraSystemSpawnSection) == 0x000008, "Wrong alignment on UMovieSceneNiagaraSystemSpawnSection");
static_assert(sizeof(UMovieSceneNiagaraSystemSpawnSection) == 0x0000F8, "Wrong size on UMovieSceneNiagaraSystemSpawnSection");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionStartBehavior) == 0x0000E8, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionStartBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionEvaluateBehavior) == 0x0000EC, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionEvaluateBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionEndBehavior) == 0x0000F0, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionEndBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, AgeUpdateMode) == 0x0000F4, "Member 'UMovieSceneNiagaraSystemSpawnSection::AgeUpdateMode' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraVectorParameterTrack
// 0x0010 (0x00D0 - 0x00C0)
class UMovieSceneNiagaraVectorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChannelsUsed;                                      // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraVectorParameterTrack">();
	}
	static class UMovieSceneNiagaraVectorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraVectorParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraVectorParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraVectorParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraVectorParameterTrack) == 0x0000D0, "Wrong size on UMovieSceneNiagaraVectorParameterTrack");
static_assert(offsetof(UMovieSceneNiagaraVectorParameterTrack, ChannelsUsed) == 0x0000C8, "Member 'UMovieSceneNiagaraVectorParameterTrack::ChannelsUsed' has a wrong offset!");

// Class Niagara.NiagaraActor
// 0x0010 (0x0230 - 0x0220)
class ANiagaraActor final : public AActor
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0220(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bDestroyOnSystemFinish : 1;                        // 0x0228(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNiagaraSystemFinished(class UNiagaraComponent* FinishedComponent);
	void SetDestroyOnSystemFinish(bool bShouldDestroyOnSystemFinish);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraActor">();
	}
	static class ANiagaraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraActor>();
	}
};
static_assert(alignof(ANiagaraActor) == 0x000008, "Wrong alignment on ANiagaraActor");
static_assert(sizeof(ANiagaraActor) == 0x000230, "Wrong size on ANiagaraActor");
static_assert(offsetof(ANiagaraActor, NiagaraComponent) == 0x000220, "Member 'ANiagaraActor::NiagaraComponent' has a wrong offset!");

// Class Niagara.NiagaraBakerSettings
// 0x00F0 (0x0118 - 0x0028)
class UNiagaraBakerSettings final : public UObject
{
public:
	float                                         StartSeconds;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationSeconds;                                   // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FramesPerSecond;                                   // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPreviewLooping : 1;                               // 0x0034(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              FramesPerDimension;                                // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraBakerTextureSettings>   OutputTextures;                                    // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ENiagaraBakerViewMode                         CameraViewportMode;                                // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CameraViewportLocation[0x7];                       // 0x0054(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraViewportRotation[0x7];                       // 0x00A8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         CameraOrbitDistance;                               // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraFOV;                                         // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraOrthoWidth;                                  // 0x0104(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseCameraAspectRatio : 1;                         // 0x0108(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraAspectRatio;                                 // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRenderComponentOnly : 1;                          // 0x0110(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraBakerSettings">();
	}
	static class UNiagaraBakerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraBakerSettings>();
	}
};
static_assert(alignof(UNiagaraBakerSettings) == 0x000008, "Wrong alignment on UNiagaraBakerSettings");
static_assert(sizeof(UNiagaraBakerSettings) == 0x000118, "Wrong size on UNiagaraBakerSettings");
static_assert(offsetof(UNiagaraBakerSettings, StartSeconds) == 0x000028, "Member 'UNiagaraBakerSettings::StartSeconds' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, DurationSeconds) == 0x00002C, "Member 'UNiagaraBakerSettings::DurationSeconds' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, FramesPerSecond) == 0x000030, "Member 'UNiagaraBakerSettings::FramesPerSecond' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, FramesPerDimension) == 0x000038, "Member 'UNiagaraBakerSettings::FramesPerDimension' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, OutputTextures) == 0x000040, "Member 'UNiagaraBakerSettings::OutputTextures' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraViewportMode) == 0x000050, "Member 'UNiagaraBakerSettings::CameraViewportMode' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraViewportLocation) == 0x000054, "Member 'UNiagaraBakerSettings::CameraViewportLocation' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraViewportRotation) == 0x0000A8, "Member 'UNiagaraBakerSettings::CameraViewportRotation' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraOrbitDistance) == 0x0000FC, "Member 'UNiagaraBakerSettings::CameraOrbitDistance' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraFOV) == 0x000100, "Member 'UNiagaraBakerSettings::CameraFOV' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraOrthoWidth) == 0x000104, "Member 'UNiagaraBakerSettings::CameraOrthoWidth' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraAspectRatio) == 0x00010C, "Member 'UNiagaraBakerSettings::CameraAspectRatio' has a wrong offset!");

// Class Niagara.NiagaraComponent
// 0x01B0 (0x0600 - 0x0450)
class UNiagaraComponent final : public UFXSystemComponent
{
public:
	class UNiagaraSystem*                         Asset;                                             // 0x0450(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraTickBehavior                          TickBehavior;                                      // 0x0458(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RandomSeedOffset;                                  // 0x045C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FNiagaraUserRedirectionParameterStore  OverrideParameters;                                // 0x0460(0x00C8)(NativeAccessSpecifierPrivate)
	uint8                                         bForceSolo : 1;                                    // 0x0528(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bEnableGpuComputeDebug : 1;                        // 0x0528(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         BitPad_528_2 : 6;                                  // 0x0528(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_529[0x2F];                                     // 0x0529(0x002F)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAutoDestroy : 1;                                  // 0x0558(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bRenderingEnabled : 1;                             // 0x0558(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bAutoManageAttachment : 1;                         // 0x0558(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutoAttachWeldSimulatedBodies : 1;                // 0x0558(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxTimeBeforeForceUpdateTransform;                 // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraMaterialOverride>       EmitterMaterials;                                  // 0x0560(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	uint8                                         Pad_570[0x8];                                      // 0x0570(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSystemFinished;                                  // 0x0578(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         AutoAttachParent;                                  // 0x0588(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AutoAttachSocketName;                              // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachLocationRule;                            // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachRotationRule;                            // 0x0599(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachScaleRule;                               // 0x059A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59B[0x65];                                     // 0x059B(0x0065)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AdvanceSimulation(int32 TickCount, float TickDeltaSeconds);
	void AdvanceSimulationByTime(float SimulateTime, float TickDeltaSeconds);
	class UNiagaraDataInterface* GetDataInterface(const class FString& Name_0);
	TArray<struct FVector> GetNiagaraParticlePositions_DebugOnly(const class FString& InEmitterName);
	TArray<float> GetNiagaraParticleValues_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	TArray<struct FVector> GetNiagaraParticleValueVec3_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	void InitForPerformanceBaseline();
	void ReinitializeSystem();
	void ResetSystem();
	void SeekToDesiredAge(float InDesiredAge);
	void SetAgeUpdateMode(ENiagaraAgeUpdateMode InAgeUpdateMode);
	void SetAllowScalability(bool bAllow);
	void SetAsset(class UNiagaraSystem* InAsset, bool bResetExistingOverrideParameters);
	void SetAutoDestroy(bool bInAutoDestroy);
	void SetCanRenderWhileSeeking(bool bInCanRenderWhileSeeking);
	void SetDesiredAge(float InDesiredAge);
	void SetForceSolo(bool bInForceSolo);
	void SetGpuComputeDebug(bool bEnableDebug);
	void SetLockDesiredAgeDeltaTimeToSeekDelta(bool bLock);
	void SetMaxSimTime(float InMaxTime);
	void SetNiagaraVariableActor(const class FString& InVariableName, class AActor* Actor);
	void SetNiagaraVariableBool(const class FString& InVariableName, bool InValue);
	void SetNiagaraVariableFloat(const class FString& InVariableName, float InValue);
	void SetNiagaraVariableInt(const class FString& InVariableName, int32 InValue);
	void SetNiagaraVariableLinearColor(const class FString& InVariableName, const struct FLinearColor& InValue);
	void SetNiagaraVariableObject(const class FString& InVariableName, class UObject* Object);
	void SetNiagaraVariableQuat(const class FString& InVariableName, const struct FQuat& InValue);
	void SetNiagaraVariableVec2(const class FString& InVariableName, const struct FVector2D& InValue);
	void SetNiagaraVariableVec3(const class FString& InVariableName, const struct FVector& InValue);
	void SetNiagaraVariableVec4(const class FString& InVariableName, const struct FVector4& InValue);
	void SetPaused(bool bInPaused);
	void SetPreviewLODDistance(bool bEnablePreviewLODDistance, float PreviewLODDistance);
	void SetRandomSeedOffset(int32 NewRandomSeedOffset);
	void SetRenderingEnabled(bool bInRenderingEnabled);
	void SetSeekDelta(float InSeekDelta);
	void SetTickBehavior(ENiagaraTickBehavior NewTickBehavior);
	void SetVariableActor(class FName InVariableName, class AActor* Actor);
	void SetVariableBool(class FName InVariableName, bool InValue);
	void SetVariableFloat(class FName InVariableName, float InValue);
	void SetVariableInt(class FName InVariableName, int32 InValue);
	void SetVariableLinearColor(class FName InVariableName, const struct FLinearColor& InValue);
	void SetVariableMaterial(class FName InVariableName, class UMaterialInterface* Object);
	void SetVariableObject(class FName InVariableName, class UObject* Object);
	void SetVariableQuat(class FName InVariableName, const struct FQuat& InValue);
	void SetVariableTextureRenderTarget(class FName InVariableName, class UTextureRenderTarget* TextureRenderTarget);
	void SetVariableVec2(class FName InVariableName, const struct FVector2D& InValue);
	void SetVariableVec3(class FName InVariableName, const struct FVector& InValue);
	void SetVariableVec4(class FName InVariableName, const struct FVector4& InValue);

	ENiagaraAgeUpdateMode GetAgeUpdateMode() const;
	class UNiagaraSystem* GetAsset() const;
	float GetDesiredAge() const;
	bool GetForceSolo() const;
	bool GetLockDesiredAgeDeltaTimeToSeekDelta() const;
	float GetMaxSimTime() const;
	float GetPreviewLODDistance() const;
	bool GetPreviewLODDistanceEnabled() const;
	int32 GetRandomSeedOffset() const;
	float GetSeekDelta() const;
	ENiagaraTickBehavior GetTickBehavior() const;
	bool IsPaused() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponent">();
	}
	static class UNiagaraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponent>();
	}
};
static_assert(alignof(UNiagaraComponent) == 0x000010, "Wrong alignment on UNiagaraComponent");
static_assert(sizeof(UNiagaraComponent) == 0x000600, "Wrong size on UNiagaraComponent");
static_assert(offsetof(UNiagaraComponent, Asset) == 0x000450, "Member 'UNiagaraComponent::Asset' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, TickBehavior) == 0x000458, "Member 'UNiagaraComponent::TickBehavior' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, RandomSeedOffset) == 0x00045C, "Member 'UNiagaraComponent::RandomSeedOffset' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, OverrideParameters) == 0x000460, "Member 'UNiagaraComponent::OverrideParameters' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, MaxTimeBeforeForceUpdateTransform) == 0x00055C, "Member 'UNiagaraComponent::MaxTimeBeforeForceUpdateTransform' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, EmitterMaterials) == 0x000560, "Member 'UNiagaraComponent::EmitterMaterials' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, OnSystemFinished) == 0x000578, "Member 'UNiagaraComponent::OnSystemFinished' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachParent) == 0x000588, "Member 'UNiagaraComponent::AutoAttachParent' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachSocketName) == 0x000590, "Member 'UNiagaraComponent::AutoAttachSocketName' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachLocationRule) == 0x000598, "Member 'UNiagaraComponent::AutoAttachLocationRule' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachRotationRule) == 0x000599, "Member 'UNiagaraComponent::AutoAttachRotationRule' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachScaleRule) == 0x00059A, "Member 'UNiagaraComponent::AutoAttachScaleRule' has a wrong offset!");

// Class Niagara.NiagaraComponentPool
// 0x0058 (0x0080 - 0x0028)
class UNiagaraComponentPool final : public UObject
{
public:
	TMap<class UNiagaraSystem*, struct FNCPool>   WorldParticleSystemPools;                          // 0x0028(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponentPool">();
	}
	static class UNiagaraComponentPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentPool>();
	}
};
static_assert(alignof(UNiagaraComponentPool) == 0x000008, "Wrong alignment on UNiagaraComponentPool");
static_assert(sizeof(UNiagaraComponentPool) == 0x000080, "Wrong size on UNiagaraComponentPool");
static_assert(offsetof(UNiagaraComponentPool, WorldParticleSystemPools) == 0x000028, "Member 'UNiagaraComponentPool::WorldParticleSystemPools' has a wrong offset!");

// Class Niagara.NiagaraRendererProperties
// 0x0050 (0x0078 - 0x0028)
class UNiagaraRendererProperties : public UNiagaraMergeable
{
public:
	struct FNiagaraPlatformSet                    Platforms;                                         // 0x0028(0x0030)(Edit, NativeAccessSpecifierPublic)
	int32                                         SortOrderHint;                                     // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRendererMotionVectorSetting           MotionVectorSetting;                               // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMotionBlurEnabled;                                // 0x0061(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_62[0x16];                                      // 0x0062(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraRendererProperties">();
	}
	static class UNiagaraRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRendererProperties>();
	}
};
static_assert(alignof(UNiagaraRendererProperties) == 0x000008, "Wrong alignment on UNiagaraRendererProperties");
static_assert(sizeof(UNiagaraRendererProperties) == 0x000078, "Wrong size on UNiagaraRendererProperties");
static_assert(offsetof(UNiagaraRendererProperties, Platforms) == 0x000028, "Member 'UNiagaraRendererProperties::Platforms' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, SortOrderHint) == 0x000058, "Member 'UNiagaraRendererProperties::SortOrderHint' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, MotionVectorSetting) == 0x00005C, "Member 'UNiagaraRendererProperties::MotionVectorSetting' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, bIsEnabled) == 0x000060, "Member 'UNiagaraRendererProperties::bIsEnabled' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, bMotionBlurEnabled) == 0x000061, "Member 'UNiagaraRendererProperties::bMotionBlurEnabled' has a wrong offset!");

// Class Niagara.NiagaraComponentRendererProperties
// 0x0138 (0x01B0 - 0x0078)
class UNiagaraComponentRendererProperties final : public UNiagaraRendererProperties
{
public:
	TSubclassOf<class USceneComponent>            ComponentType;                                     // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ComponentCountLimit;                               // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraVariableAttributeBinding       EnabledBinding;                                    // 0x0088(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RendererVisibilityTagBinding;                      // 0x00E0(0x0058)(Edit, NativeAccessSpecifierPublic)
	bool                                          bAssignComponentsOnParticleID;                     // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyCreateComponentsOnParticleSpawn;              // 0x0139(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RendererVisibility;                                // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        TemplateComponent;                                 // 0x0140(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraComponentPropertyBinding> PropertyBindings;                                  // 0x0148(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x58];                                     // 0x0158(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponentRendererProperties">();
	}
	static class UNiagaraComponentRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentRendererProperties>();
	}
};
static_assert(alignof(UNiagaraComponentRendererProperties) == 0x000008, "Wrong alignment on UNiagaraComponentRendererProperties");
static_assert(sizeof(UNiagaraComponentRendererProperties) == 0x0001B0, "Wrong size on UNiagaraComponentRendererProperties");
static_assert(offsetof(UNiagaraComponentRendererProperties, ComponentType) == 0x000078, "Member 'UNiagaraComponentRendererProperties::ComponentType' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentRendererProperties, ComponentCountLimit) == 0x000080, "Member 'UNiagaraComponentRendererProperties::ComponentCountLimit' has a wrong offset!");
