#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraExtends

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayCameras_classes.hpp"
#include "Niagara_structs.hpp"
#include "Niagara_classes.hpp"


namespace SDK
{

// Class NiagaraExtends.NiagaraDataInterfaceBillboardEffect
// 0x0028 (0x0060 - 0x0038)
class UNiagaraDataInterfaceBillboardEffect final : public UNiagaraDataInterface
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LockAxis;                                          // 0x003C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceBillboardEffect">();
	}
	static class UNiagaraDataInterfaceBillboardEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceBillboardEffect>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceBillboardEffect) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceBillboardEffect");
static_assert(sizeof(UNiagaraDataInterfaceBillboardEffect) == 0x000060, "Wrong size on UNiagaraDataInterfaceBillboardEffect");
static_assert(offsetof(UNiagaraDataInterfaceBillboardEffect, PlayerControllerIndex) == 0x000038, "Member 'UNiagaraDataInterfaceBillboardEffect::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceBillboardEffect, LockAxis) == 0x00003C, "Member 'UNiagaraDataInterfaceBillboardEffect::LockAxis' has a wrong offset!");

// Class NiagaraExtends.AnimNotify_PlayNiagaraEffectEx
// 0x0058 (0x0090 - 0x0038)
class alignas(0x10) UAnimNotify_PlayNiagaraEffectEx final : public UAnimNotify
{
public:
	class UNiagaraSystem*                         Template;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationOffset;                                    // 0x0040(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x004C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0058(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteLocation;                                 // 0x0064(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteRotation;                                 // 0x0065(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteScale;                                    // 0x0066(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLoopEffect;                                     // 0x0067(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x18];                                      // 0x0068(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         Attached : 1;                                      // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x0084(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UNiagaraComponent* GetSpawnedEffect() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_PlayNiagaraEffectEx">();
	}
	static class UAnimNotify_PlayNiagaraEffectEx* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlayNiagaraEffectEx>();
	}
};
static_assert(alignof(UAnimNotify_PlayNiagaraEffectEx) == 0x000010, "Wrong alignment on UAnimNotify_PlayNiagaraEffectEx");
static_assert(sizeof(UAnimNotify_PlayNiagaraEffectEx) == 0x000090, "Wrong size on UAnimNotify_PlayNiagaraEffectEx");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffectEx, Template) == 0x000038, "Member 'UAnimNotify_PlayNiagaraEffectEx::Template' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffectEx, LocationOffset) == 0x000040, "Member 'UAnimNotify_PlayNiagaraEffectEx::LocationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffectEx, RotationOffset) == 0x00004C, "Member 'UAnimNotify_PlayNiagaraEffectEx::RotationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffectEx, Scale) == 0x000058, "Member 'UAnimNotify_PlayNiagaraEffectEx::Scale' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffectEx, bAbsoluteLocation) == 0x000064, "Member 'UAnimNotify_PlayNiagaraEffectEx::bAbsoluteLocation' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffectEx, bAbsoluteRotation) == 0x000065, "Member 'UAnimNotify_PlayNiagaraEffectEx::bAbsoluteRotation' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffectEx, bAbsoluteScale) == 0x000066, "Member 'UAnimNotify_PlayNiagaraEffectEx::bAbsoluteScale' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffectEx, bIsLoopEffect) == 0x000067, "Member 'UAnimNotify_PlayNiagaraEffectEx::bIsLoopEffect' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayNiagaraEffectEx, SocketName) == 0x000084, "Member 'UAnimNotify_PlayNiagaraEffectEx::SocketName' has a wrong offset!");

// Class NiagaraExtends.NiagaraDataInterfaceBillboardEffect2
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceBillboardEffect2 final : public UNiagaraDataInterface
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LockAxis;                                          // 0x003C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceBillboardEffect2">();
	}
	static class UNiagaraDataInterfaceBillboardEffect2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceBillboardEffect2>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceBillboardEffect2) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceBillboardEffect2");
static_assert(sizeof(UNiagaraDataInterfaceBillboardEffect2) == 0x000048, "Wrong size on UNiagaraDataInterfaceBillboardEffect2");
static_assert(offsetof(UNiagaraDataInterfaceBillboardEffect2, PlayerControllerIndex) == 0x000038, "Member 'UNiagaraDataInterfaceBillboardEffect2::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceBillboardEffect2, LockAxis) == 0x00003C, "Member 'UNiagaraDataInterfaceBillboardEffect2::LockAxis' has a wrong offset!");

// Class NiagaraExtends.AnimNotifyState_NiagaraTrail
// 0x0040 (0x0070 - 0x0030)
class UAnimNotifyState_NiagaraTrail final : public UAnimNotifyState
{
public:
	class UNiagaraSystem*                         Template;                                          // 0x0030(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FirstSocketName;                                   // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SecondSocketName;                                  // 0x0040(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationOffset;                                    // 0x0048(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0054(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bDestroyAtEnd;                                     // 0x0060(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteLocation;                                 // 0x0061(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteRotation;                                 // 0x0062(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteScale;                                    // 0x0063(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_NiagaraTrail">();
	}
	static class UAnimNotifyState_NiagaraTrail* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_NiagaraTrail>();
	}
};
static_assert(alignof(UAnimNotifyState_NiagaraTrail) == 0x000008, "Wrong alignment on UAnimNotifyState_NiagaraTrail");
static_assert(sizeof(UAnimNotifyState_NiagaraTrail) == 0x000070, "Wrong size on UAnimNotifyState_NiagaraTrail");
static_assert(offsetof(UAnimNotifyState_NiagaraTrail, Template) == 0x000030, "Member 'UAnimNotifyState_NiagaraTrail::Template' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_NiagaraTrail, FirstSocketName) == 0x000038, "Member 'UAnimNotifyState_NiagaraTrail::FirstSocketName' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_NiagaraTrail, SecondSocketName) == 0x000040, "Member 'UAnimNotifyState_NiagaraTrail::SecondSocketName' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_NiagaraTrail, LocationOffset) == 0x000048, "Member 'UAnimNotifyState_NiagaraTrail::LocationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_NiagaraTrail, RotationOffset) == 0x000054, "Member 'UAnimNotifyState_NiagaraTrail::RotationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_NiagaraTrail, bDestroyAtEnd) == 0x000060, "Member 'UAnimNotifyState_NiagaraTrail::bDestroyAtEnd' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_NiagaraTrail, bAbsoluteLocation) == 0x000061, "Member 'UAnimNotifyState_NiagaraTrail::bAbsoluteLocation' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_NiagaraTrail, bAbsoluteRotation) == 0x000062, "Member 'UAnimNotifyState_NiagaraTrail::bAbsoluteRotation' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_NiagaraTrail, bAbsoluteScale) == 0x000063, "Member 'UAnimNotifyState_NiagaraTrail::bAbsoluteScale' has a wrong offset!");

// Class NiagaraExtends.NiagaraDataInterfaceCameraShake
// 0x0020 (0x0058 - 0x0038)
class UNiagaraDataInterfaceCameraShake final : public UNiagaraDataInterface
{
public:
	TSubclassOf<class UNiagaraCameraShake>        NiagaraCameraShake;                                // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint32>                                ShakingEffects;                                    // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCameraShake">();
	}
	static class UNiagaraDataInterfaceCameraShake* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCameraShake>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceCameraShake) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceCameraShake");
static_assert(sizeof(UNiagaraDataInterfaceCameraShake) == 0x000058, "Wrong size on UNiagaraDataInterfaceCameraShake");
static_assert(offsetof(UNiagaraDataInterfaceCameraShake, NiagaraCameraShake) == 0x000038, "Member 'UNiagaraDataInterfaceCameraShake::NiagaraCameraShake' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceCameraShake, ShakingEffects) == 0x000048, "Member 'UNiagaraDataInterfaceCameraShake::ShakingEffects' has a wrong offset!");

// Class NiagaraExtends.AnimNotifyState_TimedNiagaraEffectEx
// 0x0038 (0x0068 - 0x0030)
class UAnimNotifyState_TimedNiagaraEffectEx final : public UAnimNotifyState
{
public:
	class UNiagaraSystem*                         Template;                                          // 0x0030(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationOffset;                                    // 0x0040(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x004C(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteLocation;                                 // 0x0058(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteRotation;                                 // 0x0059(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteScale;                                    // 0x005A(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOffsetRootLocation;                            // 0x005B(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOffsetRootRotation;                            // 0x005C(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOffsetRootScale;                               // 0x005D(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyAtEnd;                                     // 0x005E(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     Component;                                         // 0x0060(0x0008)(ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_TimedNiagaraEffectEx">();
	}
	static class UAnimNotifyState_TimedNiagaraEffectEx* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_TimedNiagaraEffectEx>();
	}
};
static_assert(alignof(UAnimNotifyState_TimedNiagaraEffectEx) == 0x000008, "Wrong alignment on UAnimNotifyState_TimedNiagaraEffectEx");
static_assert(sizeof(UAnimNotifyState_TimedNiagaraEffectEx) == 0x000068, "Wrong size on UAnimNotifyState_TimedNiagaraEffectEx");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, Template) == 0x000030, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::Template' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, SocketName) == 0x000038, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::SocketName' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, LocationOffset) == 0x000040, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::LocationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, RotationOffset) == 0x00004C, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::RotationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, bAbsoluteLocation) == 0x000058, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::bAbsoluteLocation' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, bAbsoluteRotation) == 0x000059, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::bAbsoluteRotation' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, bAbsoluteScale) == 0x00005A, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::bAbsoluteScale' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, bUseOffsetRootLocation) == 0x00005B, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::bUseOffsetRootLocation' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, bUseOffsetRootRotation) == 0x00005C, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::bUseOffsetRootRotation' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, bUseOffsetRootScale) == 0x00005D, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::bUseOffsetRootScale' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, bDestroyAtEnd) == 0x00005E, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::bDestroyAtEnd' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedNiagaraEffectEx, Component) == 0x000060, "Member 'UAnimNotifyState_TimedNiagaraEffectEx::Component' has a wrong offset!");

// Class NiagaraExtends.NiagaraActorExtends
// 0x0038 (0x0258 - 0x0220)
class ANiagaraActorExtends final : public AActor
{
public:
	FMulticastInlineDelegateProperty_             NiagaraCompleteDispather;                          // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UNiagaraParameterCollection*            ParameterCollection;                               // 0x0230(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPause;                                          // 0x0238(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bISBillboard;                                      // 0x0239(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23A[0x2];                                      // 0x023A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_240[0x8];                                      // 0x0240(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0248(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_250[0x8];                                      // 0x0250(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ANiagaraActorExtends* CreateNiagaraActorExtends(class APlayerController* InPC, class UNiagaraSystem* InAsset, float InSpeed);

	class UNiagaraParameterCollectionInstance* GetParameterCollectionInstance();
	void OnComplete(class UNiagaraComponent* PSystem);
	void RestertEffect();
	void SetDesiredAge(float InDeltTime);
	void SetVisibleDebugArrow_DebugOnly(bool InVisible);
	void SpawnNiagaraSystem(class UNiagaraSystem* InAsset, float InSpeed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraActorExtends">();
	}
	static class ANiagaraActorExtends* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraActorExtends>();
	}
};
static_assert(alignof(ANiagaraActorExtends) == 0x000008, "Wrong alignment on ANiagaraActorExtends");
static_assert(sizeof(ANiagaraActorExtends) == 0x000258, "Wrong size on ANiagaraActorExtends");
static_assert(offsetof(ANiagaraActorExtends, NiagaraCompleteDispather) == 0x000220, "Member 'ANiagaraActorExtends::NiagaraCompleteDispather' has a wrong offset!");
static_assert(offsetof(ANiagaraActorExtends, ParameterCollection) == 0x000230, "Member 'ANiagaraActorExtends::ParameterCollection' has a wrong offset!");
static_assert(offsetof(ANiagaraActorExtends, bIsPause) == 0x000238, "Member 'ANiagaraActorExtends::bIsPause' has a wrong offset!");
static_assert(offsetof(ANiagaraActorExtends, bISBillboard) == 0x000239, "Member 'ANiagaraActorExtends::bISBillboard' has a wrong offset!");
static_assert(offsetof(ANiagaraActorExtends, PlaybackSpeed) == 0x00023C, "Member 'ANiagaraActorExtends::PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(ANiagaraActorExtends, NiagaraComponent) == 0x000248, "Member 'ANiagaraActorExtends::NiagaraComponent' has a wrong offset!");

// Class NiagaraExtends.NiagaraCameraShake
// 0x0000 (0x01B0 - 0x01B0)
class UNiagaraCameraShake final : public UMatineeCameraShake
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraCameraShake">();
	}
	static class UNiagaraCameraShake* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraCameraShake>();
	}
};
static_assert(alignof(UNiagaraCameraShake) == 0x000010, "Wrong alignment on UNiagaraCameraShake");
static_assert(sizeof(UNiagaraCameraShake) == 0x0001B0, "Wrong size on UNiagaraCameraShake");

// Class NiagaraExtends.NiagaraDataInterfacePostProcess
// 0x0AF8 (0x0B30 - 0x0038)
class alignas(0x10) UNiagaraDataInterfacePostProcess final : public UNiagaraDataInterface
{
public:
	bool                                          CreatePostProcessComponent;                        // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendables                    PostProcessMaterials;                              // 0x0040(0x0010)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0xAD0];                                     // 0x0050(0x0AD0)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialParameterCollectionInstance*   NiagaraPostProcessParameter;                       // 0x0B20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B28[0x8];                                      // 0x0B28(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfacePostProcess">();
	}
	static class UNiagaraDataInterfacePostProcess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfacePostProcess>();
	}
};
static_assert(alignof(UNiagaraDataInterfacePostProcess) == 0x000010, "Wrong alignment on UNiagaraDataInterfacePostProcess");
static_assert(sizeof(UNiagaraDataInterfacePostProcess) == 0x000B30, "Wrong size on UNiagaraDataInterfacePostProcess");
static_assert(offsetof(UNiagaraDataInterfacePostProcess, CreatePostProcessComponent) == 0x000038, "Member 'UNiagaraDataInterfacePostProcess::CreatePostProcessComponent' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfacePostProcess, PostProcessMaterials) == 0x000040, "Member 'UNiagaraDataInterfacePostProcess::PostProcessMaterials' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfacePostProcess, NiagaraPostProcessParameter) == 0x000B20, "Member 'UNiagaraDataInterfacePostProcess::NiagaraPostProcessParameter' has a wrong offset!");

// Class NiagaraExtends.NiagaraDataInterfaceSetCustomStencil
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterfaceSetCustomStencil final : public UNiagaraDataInterface
{
public:
	int32                                         CustomStencilValue;                                // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceSetCustomStencil">();
	}
	static class UNiagaraDataInterfaceSetCustomStencil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceSetCustomStencil>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceSetCustomStencil) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceSetCustomStencil");
static_assert(sizeof(UNiagaraDataInterfaceSetCustomStencil) == 0x000040, "Wrong size on UNiagaraDataInterfaceSetCustomStencil");
static_assert(offsetof(UNiagaraDataInterfaceSetCustomStencil, CustomStencilValue) == 0x000038, "Member 'UNiagaraDataInterfaceSetCustomStencil::CustomStencilValue' has a wrong offset!");

// Class NiagaraExtends.NiagaraDataInterfaceSyncActorPause
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterfaceSyncActorPause final : public UNiagaraDataInterface
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceSyncActorPause">();
	}
	static class UNiagaraDataInterfaceSyncActorPause* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceSyncActorPause>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceSyncActorPause) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceSyncActorPause");
static_assert(sizeof(UNiagaraDataInterfaceSyncActorPause) == 0x000040, "Wrong size on UNiagaraDataInterfaceSyncActorPause");

// Class NiagaraExtends.NiagaraExtendsFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UNiagaraExtendsFunctionLibrary final : public UObject
{
public:
	static TArray<class FString> GetEmitterNames(class UNiagaraComponent* NiagaraComponent);
	static struct FPostProcessSettings GetFinalPostProcessSettings(class UWorld* World);
