#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PakFileManager

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class PakFileManager.PakFile
// 0x0040 (0x0068 - 0x0028)
class UPakFile final : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool SyncReadFile();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PakFile">();
	}
	static class UPakFile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPakFile>();
	}
};
static_assert(alignof(UPakFile) == 0x000008, "Wrong alignment on UPakFile");
static_assert(sizeof(UPakFile) == 0x000068, "Wrong size on UPakFile");

// Class PakFileManager.PakFileManagerControl
// 0x0010 (0x0038 - 0x0028)
class UPakFileManagerControl final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPakFile* RequestReadFile(const class FString& Filename);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PakFileManagerControl">();
	}
	static class UPakFileManagerControl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPakFileManagerControl>();
	}
};
static_assert(alignof(UPakFileManagerControl) == 0x000008, "Wrong alignment on UPakFileManagerControl");
static_assert(sizeof(UPakFileManagerControl) == 0x000038, "Wrong size on UPakFileManagerControl");

// Class PakFileManager.PakFiledManagerGameInstanceSubSystem
// 0x0008 (0x0038 - 0x0030)
class UPakFiledManagerGameInstanceSubSystem final : public UGameInstanceSubsystem
{
public:
	class UPakFileManagerControl*                 FileManagerControl;                                // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UPakFileManagerControl* GetFileManagerControl();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PakFiledManagerGameInstanceSubSystem">();
	}
	static class UPakFiledManagerGameInstanceSubSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPakFiledManagerGameInstanceSubSystem>();
	}
};
static_assert(alignof(UPakFiledManagerGameInstanceSubSystem) == 0x000008, "Wrong alignment on UPakFiledManagerGameInstanceSubSystem");
static_assert(sizeof(UPakFiledManagerGameInstanceSubSystem) == 0x000038, "Wrong size on UPakFiledManagerGameInstanceSubSystem");
static_assert(offsetof(UPakFiledManagerGameInstanceSubSystem, FileManagerControl) == 0x000030, "Member 'UPakFiledManagerGameInstanceSubSystem::FileManagerControl' has a wrong offset!");

}

