#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RotateInPlace_Asset

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct RotateInPlace_Asset.RotateInPlace_Asset
// 0x0020 (0x0020 - 0x0000)
struct FRotateInPlace_Asset final
{
public:
	class UAnimSequenceBase*                      Animation_2_7BA2980D4E85CC9E320EB98B57C73B3A;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SlotName_5_73864C9E40AE26D9F294038C7099722B;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlowTurnRate_9_47A596764C9AFE145D75C49448F776A8;   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FastTurnRate_17_566E906643D9AD8B150F87B98BBF88BB;  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlowPlayRate_16_1F78888146721190E66721BAA545F229;  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FastPlayRate_18_730EF8A04D92C6D5D014CFBF34A93F2A;  // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FRotateInPlace_Asset) == 0x000008, "Wrong alignment on FRotateInPlace_Asset");
static_assert(sizeof(FRotateInPlace_Asset) == 0x000020, "Wrong size on FRotateInPlace_Asset");
static_assert(offsetof(FRotateInPlace_Asset, Animation_2_7BA2980D4E85CC9E320EB98B57C73B3A) == 0x000000, "Member 'FRotateInPlace_Asset::Animation_2_7BA2980D4E85CC9E320EB98B57C73B3A' has a wrong offset!");
static_assert(offsetof(FRotateInPlace_Asset, SlotName_5_73864C9E40AE26D9F294038C7099722B) == 0x000008, "Member 'FRotateInPlace_Asset::SlotName_5_73864C9E40AE26D9F294038C7099722B' has a wrong offset!");
static_assert(offsetof(FRotateInPlace_Asset, SlowTurnRate_9_47A596764C9AFE145D75C49448F776A8) == 0x000010, "Member 'FRotateInPlace_Asset::SlowTurnRate_9_47A596764C9AFE145D75C49448F776A8' has a wrong offset!");
static_assert(offsetof(FRotateInPlace_Asset, FastTurnRate_17_566E906643D9AD8B150F87B98BBF88BB) == 0x000014, "Member 'FRotateInPlace_Asset::FastTurnRate_17_566E906643D9AD8B150F87B98BBF88BB' has a wrong offset!");
static_assert(offsetof(FRotateInPlace_Asset, SlowPlayRate_16_1F78888146721190E66721BAA545F229) == 0x000018, "Member 'FRotateInPlace_Asset::SlowPlayRate_16_1F78888146721190E66721BAA545F229' has a wrong offset!");
static_assert(offsetof(FRotateInPlace_Asset, FastPlayRate_18_730EF8A04D92C6D5D014CFBF34A93F2A) == 0x00001C, "Member 'FRotateInPlace_Asset::FastPlayRate_18_730EF8A04D92C6D5D014CFBF34A93F2A' has a wrong offset!");

}

