#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StaticMeshDescription

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct StaticMeshDescription.UVMapSettings
// 0x0038 (0x0038 - 0x0000)
struct FUVMapSettings final
{
public:
	struct FVector                                Size;                                              // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UVTile;                                            // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x002C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUVMapSettings) == 0x000004, "Wrong alignment on FUVMapSettings");
static_assert(sizeof(FUVMapSettings) == 0x000038, "Wrong size on FUVMapSettings");
static_assert(offsetof(FUVMapSettings, Size) == 0x000000, "Member 'FUVMapSettings::Size' has a wrong offset!");
static_assert(offsetof(FUVMapSettings, UVTile) == 0x00000C, "Member 'FUVMapSettings::UVTile' has a wrong offset!");
static_assert(offsetof(FUVMapSettings, Position) == 0x000014, "Member 'FUVMapSettings::Position' has a wrong offset!");
static_assert(offsetof(FUVMapSettings, Rotation) == 0x000020, "Member 'FUVMapSettings::Rotation' has a wrong offset!");
static_assert(offsetof(FUVMapSettings, Scale) == 0x00002C, "Member 'FUVMapSettings::Scale' has a wrong offset!");

}

