#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TurnInPlace_Asset

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct TurnInPlace_Asset.TurnInPlace_Asset
// 0x0020 (0x0020 - 0x0000)
struct FTurnInPlace_Asset final
{
public:
	class UAnimSequenceBase*                      Animation_2_7BA2980D4E85CC9E320EB98B57C73B3A;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimatedAngle_11_0BE5A89E455AEBE851DAA49A1FCA81A5; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SlotName_5_73864C9E40AE26D9F294038C7099722B;       // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayRate_8_47A596764C9AFE145D75C49448F776A8;       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ScaleTurnAngle_14_ED8450744340CD92E19052A9E8766866; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FTurnInPlace_Asset) == 0x000008, "Wrong alignment on FTurnInPlace_Asset");
static_assert(sizeof(FTurnInPlace_Asset) == 0x000020, "Wrong size on FTurnInPlace_Asset");
static_assert(offsetof(FTurnInPlace_Asset, Animation_2_7BA2980D4E85CC9E320EB98B57C73B3A) == 0x000000, "Member 'FTurnInPlace_Asset::Animation_2_7BA2980D4E85CC9E320EB98B57C73B3A' has a wrong offset!");
static_assert(offsetof(FTurnInPlace_Asset, AnimatedAngle_11_0BE5A89E455AEBE851DAA49A1FCA81A5) == 0x000008, "Member 'FTurnInPlace_Asset::AnimatedAngle_11_0BE5A89E455AEBE851DAA49A1FCA81A5' has a wrong offset!");
static_assert(offsetof(FTurnInPlace_Asset, SlotName_5_73864C9E40AE26D9F294038C7099722B) == 0x00000C, "Member 'FTurnInPlace_Asset::SlotName_5_73864C9E40AE26D9F294038C7099722B' has a wrong offset!");
static_assert(offsetof(FTurnInPlace_Asset, PlayRate_8_47A596764C9AFE145D75C49448F776A8) == 0x000014, "Member 'FTurnInPlace_Asset::PlayRate_8_47A596764C9AFE145D75C49448F776A8' has a wrong offset!");
static_assert(offsetof(FTurnInPlace_Asset, ScaleTurnAngle_14_ED8450744340CD92E19052A9E8766866) == 0x000018, "Member 'FTurnInPlace_Asset::ScaleTurnAngle_14_ED8450744340CD92E19052A9E8766866' has a wrong offset!");

}

