#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UiLayoutAssetPlugin

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct UiLayoutAssetPlugin.UIColor
// 0x0010 (0x0018 - 0x0008)
struct FUIColor final : public FTableRowBase
{
public:
	float                                         R;                                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         G;                                                 // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         B;                                                 // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         A;                                                 // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUIColor) == 0x000008, "Wrong alignment on FUIColor");
static_assert(sizeof(FUIColor) == 0x000018, "Wrong size on FUIColor");
static_assert(offsetof(FUIColor, R) == 0x000008, "Member 'FUIColor::R' has a wrong offset!");
static_assert(offsetof(FUIColor, G) == 0x00000C, "Member 'FUIColor::G' has a wrong offset!");
static_assert(offsetof(FUIColor, B) == 0x000010, "Member 'FUIColor::B' has a wrong offset!");
static_assert(offsetof(FUIColor, A) == 0x000014, "Member 'FUIColor::A' has a wrong offset!");

// ScriptStruct UiLayoutAssetPlugin.UILayout
// 0x0010 (0x0018 - 0x0008)
struct FUILayout final : public FTableRowBase
{
public:
	float                                         X;                                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUILayout) == 0x000008, "Wrong alignment on FUILayout");
static_assert(sizeof(FUILayout) == 0x000018, "Wrong size on FUILayout");
static_assert(offsetof(FUILayout, X) == 0x000008, "Member 'FUILayout::X' has a wrong offset!");
static_assert(offsetof(FUILayout, Y) == 0x00000C, "Member 'FUILayout::Y' has a wrong offset!");
static_assert(offsetof(FUILayout, Angle) == 0x000010, "Member 'FUILayout::Angle' has a wrong offset!");
static_assert(offsetof(FUILayout, Scale) == 0x000014, "Member 'FUILayout::Scale' has a wrong offset!");

// ScriptStruct UiLayoutAssetPlugin.UITriangularCursor
// 0x0018 (0x0020 - 0x0008)
struct FUITriangularCursor final : public FTableRowBase
{
public:
	float                                         X0;                                                // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y0;                                                // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         X1;                                                // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y1;                                                // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         X2;                                                // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y2;                                                // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUITriangularCursor) == 0x000008, "Wrong alignment on FUITriangularCursor");
static_assert(sizeof(FUITriangularCursor) == 0x000020, "Wrong size on FUITriangularCursor");
static_assert(offsetof(FUITriangularCursor, X0) == 0x000008, "Member 'FUITriangularCursor::X0' has a wrong offset!");
static_assert(offsetof(FUITriangularCursor, Y0) == 0x00000C, "Member 'FUITriangularCursor::Y0' has a wrong offset!");
static_assert(offsetof(FUITriangularCursor, X1) == 0x000010, "Member 'FUITriangularCursor::X1' has a wrong offset!");
static_assert(offsetof(FUITriangularCursor, Y1) == 0x000014, "Member 'FUITriangularCursor::Y1' has a wrong offset!");
static_assert(offsetof(FUITriangularCursor, X2) == 0x000018, "Member 'FUITriangularCursor::X2' has a wrong offset!");
static_assert(offsetof(FUITriangularCursor, Y2) == 0x00001C, "Member 'FUITriangularCursor::Y2' has a wrong offset!");

}

