#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VelocityBlend

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct VelocityBlend.VelocityBlend
// 0x0010 (0x0010 - 0x0000)
struct FVelocityBlend final
{
public:
	float                                         F_3_2154ABAD4BD15DAC904154B63D704219;              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         B_5_0A0855774CB13BB3E4B0A6847E7154F6;              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_8_DFEBB8584D28F158D2562CA60EB07B6D;              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         R_9_79E6E09B4A52B442B9FE6DB7192CFBEE;              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FVelocityBlend) == 0x000004, "Wrong alignment on FVelocityBlend");
static_assert(sizeof(FVelocityBlend) == 0x000010, "Wrong size on FVelocityBlend");
static_assert(offsetof(FVelocityBlend, F_3_2154ABAD4BD15DAC904154B63D704219) == 0x000000, "Member 'FVelocityBlend::F_3_2154ABAD4BD15DAC904154B63D704219' has a wrong offset!");
static_assert(offsetof(FVelocityBlend, B_5_0A0855774CB13BB3E4B0A6847E7154F6) == 0x000004, "Member 'FVelocityBlend::B_5_0A0855774CB13BB3E4B0A6847E7154F6' has a wrong offset!");
static_assert(offsetof(FVelocityBlend, L_8_DFEBB8584D28F158D2562CA60EB07B6D) == 0x000008, "Member 'FVelocityBlend::L_8_DFEBB8584D28F158D2562CA60EB07B6D' has a wrong offset!");
static_assert(offsetof(FVelocityBlend, R_9_79E6E09B4A52B442B9FE6DB7192CFBEE) == 0x00000C, "Member 'FVelocityBlend::R_9_79E6E09B4A52B442B9FE6DB7192CFBEE' has a wrong offset!");

}

