#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BtlCatinUI_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BtlCatinUI_00.WBP_BtlCatinUI_00_C
// 0x0018 (0x0278 - 0x0260)
class UWBP_BtlCatinUI_00_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StartAnimation;                                    // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_335;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_BtlCatinUI_00(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BtlCatinUI_00_C">();
	}
	static class UWBP_BtlCatinUI_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BtlCatinUI_00_C>();
	}
};
static_assert(alignof(UWBP_BtlCatinUI_00_C) == 0x000008, "Wrong alignment on UWBP_BtlCatinUI_00_C");
static_assert(sizeof(UWBP_BtlCatinUI_00_C) == 0x000278, "Wrong size on UWBP_BtlCatinUI_00_C");
static_assert(offsetof(UWBP_BtlCatinUI_00_C, UberGraphFrame) == 0x000260, "Member 'UWBP_BtlCatinUI_00_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BtlCatinUI_00_C, StartAnimation) == 0x000268, "Member 'UWBP_BtlCatinUI_00_C::StartAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_BtlCatinUI_00_C, Image_335) == 0x000270, "Member 'UWBP_BtlCatinUI_00_C::Image_335' has a wrong offset!");

}

