#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Xrd777

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Xrd777_structs.hpp"
#include "AnimGraphRuntime_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CriWareRuntime_classes.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"
#include "Niagara_structs.hpp"
#include "CharacterBase_classes.hpp"
#include "AIModule_classes.hpp"
#include "InputManagerPlugin_classes.hpp"
#include "DebugMenuPlugin_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "OffscreenRendering_classes.hpp"


namespace SDK
{

// Class xrd777.AppActor
// 0x0058 (0x0278 - 0x0220)
class AAppActor : public AActor
{
public:
	uint8                                         Pad_220[0x10];                                     // 0x0220(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EAppPauseObjectFlag                           AppPauseFlags;                                     // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             PauseFrontEvent;                                   // 0x0238(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             PauseBackEvent;                                    // 0x0248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             UnPauseFrontEvent;                                 // 0x0258(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             UnPauseBackEvent;                                  // 0x0268(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	class AActor* AsAActor();
	class UObject* AsUObject();
	void BeginPlay();
	void EndPlay(const EEndPlayReason EndPlayReason);

	EAppPauseObjectFlag GetAppPauseFlags() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppActor">();
	}
	static class AAppActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppActor>();
	}
};
static_assert(alignof(AAppActor) == 0x000008, "Wrong alignment on AAppActor");
static_assert(sizeof(AAppActor) == 0x000278, "Wrong size on AAppActor");
static_assert(offsetof(AAppActor, AppPauseFlags) == 0x000230, "Member 'AAppActor::AppPauseFlags' has a wrong offset!");
static_assert(offsetof(AAppActor, PauseFrontEvent) == 0x000238, "Member 'AAppActor::PauseFrontEvent' has a wrong offset!");
static_assert(offsetof(AAppActor, PauseBackEvent) == 0x000248, "Member 'AAppActor::PauseBackEvent' has a wrong offset!");
static_assert(offsetof(AAppActor, UnPauseFrontEvent) == 0x000258, "Member 'AAppActor::UnPauseFrontEvent' has a wrong offset!");
static_assert(offsetof(AAppActor, UnPauseBackEvent) == 0x000268, "Member 'AAppActor::UnPauseBackEvent' has a wrong offset!");

// Class xrd777.AssistTest
// 0x0010 (0x0288 - 0x0278)
class AAssistTest final : public AAppActor
{
public:
	class UAssetLoader*                           Loader_;                                           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBmdAsset*                              BmdAsset_;                                         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssistTest">();
	}
	static class AAssistTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAssistTest>();
	}
};
static_assert(alignof(AAssistTest) == 0x000008, "Wrong alignment on AAssistTest");
static_assert(sizeof(AAssistTest) == 0x000288, "Wrong size on AAssistTest");
static_assert(offsetof(AAssistTest, Loader_) == 0x000278, "Member 'AAssistTest::Loader_' has a wrong offset!");
static_assert(offsetof(AAssistTest, BmdAsset_) == 0x000280, "Member 'AAssistTest::BmdAsset_' has a wrong offset!");

// Class xrd777.TitleLogoActor
// 0x0070 (0x0290 - 0x0220)
class ATitleLogoActor : public AActor
{
public:
	int32                                         FadeInFrame;                                       // 0x0220(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FadeOutFrame;                                      // 0x0224(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0x68];                                     // 0x0228(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetAlpha();
	bool IsGameClear();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TitleLogoActor">();
	}
	static class ATitleLogoActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATitleLogoActor>();
	}
};
static_assert(alignof(ATitleLogoActor) == 0x000008, "Wrong alignment on ATitleLogoActor");
static_assert(sizeof(ATitleLogoActor) == 0x000290, "Wrong size on ATitleLogoActor");
static_assert(offsetof(ATitleLogoActor, FadeInFrame) == 0x000220, "Member 'ATitleLogoActor::FadeInFrame' has a wrong offset!");
static_assert(offsetof(ATitleLogoActor, FadeOutFrame) == 0x000224, "Member 'ATitleLogoActor::FadeOutFrame' has a wrong offset!");

// Class xrd777.BtlBoss
// 0x0008 (0x0030 - 0x0028)
class UBtlBoss : public UObject
{
public:
	class UDataTable*                             CameraTable;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BtlBoss">();
	}
	static class UBtlBoss* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBtlBoss>();
	}
};
static_assert(alignof(UBtlBoss) == 0x000008, "Wrong alignment on UBtlBoss");
static_assert(sizeof(UBtlBoss) == 0x000030, "Wrong size on UBtlBoss");
static_assert(offsetof(UBtlBoss, CameraTable) == 0x000028, "Member 'UBtlBoss::CameraTable' has a wrong offset!");

// Class xrd777.AppMultiDataAsset
// 0x0000 (0x0030 - 0x0030)
class UAppMultiDataAsset : public UDataAsset
{
public:
	void Import();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppMultiDataAsset">();
	}
	static class UAppMultiDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppMultiDataAsset>();
	}
};
static_assert(alignof(UAppMultiDataAsset) == 0x000008, "Wrong alignment on UAppMultiDataAsset");
static_assert(sizeof(UAppMultiDataAsset) == 0x000030, "Wrong size on UAppMultiDataAsset");

// Class xrd777.AntiqueShopLineUpListTable
// 0x0030 (0x0060 - 0x0030)
class UAntiqueShopLineUpListTable final : public UAppMultiDataAsset
{
public:
	TArray<struct FAntiqueShopLineUpList>         TradeData;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAntiqueShopEquipCombineSource> CombineSources;                                    // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAntiqueShopEquipCombineResult> CombineResults;                                    // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AntiqueShopLineUpListTable">();
	}
	static class UAntiqueShopLineUpListTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAntiqueShopLineUpListTable>();
	}
};
static_assert(alignof(UAntiqueShopLineUpListTable) == 0x000008, "Wrong alignment on UAntiqueShopLineUpListTable");
static_assert(sizeof(UAntiqueShopLineUpListTable) == 0x000060, "Wrong size on UAntiqueShopLineUpListTable");
static_assert(offsetof(UAntiqueShopLineUpListTable, TradeData) == 0x000030, "Member 'UAntiqueShopLineUpListTable::TradeData' has a wrong offset!");
static_assert(offsetof(UAntiqueShopLineUpListTable, CombineSources) == 0x000040, "Member 'UAntiqueShopLineUpListTable::CombineSources' has a wrong offset!");
static_assert(offsetof(UAntiqueShopLineUpListTable, CombineResults) == 0x000050, "Member 'UAntiqueShopLineUpListTable::CombineResults' has a wrong offset!");

// Class xrd777.AppDataAsset
// 0x0000 (0x0030 - 0x0030)
class UAppDataAsset : public UDataAsset
{
public:
	void Import();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppDataAsset">();
	}
	static class UAppDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppDataAsset>();
	}
};
static_assert(alignof(UAppDataAsset) == 0x000008, "Wrong alignment on UAppDataAsset");
static_assert(sizeof(UAppDataAsset) == 0x000030, "Wrong size on UAppDataAsset");

// Class xrd777.HeroParameterDataAsset
// 0x0010 (0x0040 - 0x0030)
class UHeroParameterDataAsset final : public UAppMultiDataAsset
{
public:
	TArray<struct FHeroParameterTable>            Tables;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HeroParameterDataAsset">();
	}
	static class UHeroParameterDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeroParameterDataAsset>();
	}
};
static_assert(alignof(UHeroParameterDataAsset) == 0x000008, "Wrong alignment on UHeroParameterDataAsset");
static_assert(sizeof(UHeroParameterDataAsset) == 0x000040, "Wrong size on UHeroParameterDataAsset");
static_assert(offsetof(UHeroParameterDataAsset, Tables) == 0x000030, "Member 'UHeroParameterDataAsset::Tables' has a wrong offset!");

// Class xrd777.AssetLoader
// 0x0040 (0x0068 - 0x0028)
class UAssetLoader final : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetLoader">();
	}
	static class UAssetLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetLoader>();
	}
};
static_assert(alignof(UAssetLoader) == 0x000008, "Wrong alignment on UAssetLoader");
static_assert(sizeof(UAssetLoader) == 0x000068, "Wrong size on UAssetLoader");

// Class xrd777.ActivityDataAsset
// 0x0010 (0x0040 - 0x0030)
class UActivityDataAsset final : public UAppDataAsset
{
public:
	TArray<struct FActivityData>                  Data;                                              // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivityDataAsset">();
	}
	static class UActivityDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityDataAsset>();
	}
};
static_assert(alignof(UActivityDataAsset) == 0x000008, "Wrong alignment on UActivityDataAsset");
static_assert(sizeof(UActivityDataAsset) == 0x000040, "Wrong size on UActivityDataAsset");
static_assert(offsetof(UActivityDataAsset, Data) == 0x000030, "Member 'UActivityDataAsset::Data' has a wrong offset!");

// Class xrd777.AppPropsAnimPackAsset
// 0x0058 (0x0088 - 0x0030)
class UAppPropsAnimPackAsset final : public UDataAsset
{
public:
	EAppPropsAnimPackType                         PackType;                                          // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UAnimSequenceBase*>         Anims;                                             // 0x0038(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppPropsAnimPackAsset">();
	}
	static class UAppPropsAnimPackAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppPropsAnimPackAsset>();
	}
};
static_assert(alignof(UAppPropsAnimPackAsset) == 0x000008, "Wrong alignment on UAppPropsAnimPackAsset");
static_assert(sizeof(UAppPropsAnimPackAsset) == 0x000088, "Wrong size on UAppPropsAnimPackAsset");
static_assert(offsetof(UAppPropsAnimPackAsset, PackType) == 0x000030, "Member 'UAppPropsAnimPackAsset::PackType' has a wrong offset!");
static_assert(offsetof(UAppPropsAnimPackAsset, Anims) == 0x000038, "Member 'UAppPropsAnimPackAsset::Anims' has a wrong offset!");

// Class xrd777.SelItem
// 0x0088 (0x00B0 - 0x0028)
class USelItem : public UObject
{
public:
	uint8                                         Pad_28[0x78];                                      // 0x0028(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class UMsgProcWindow_Select*                  MpSelProcWindow;                                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SelItem">();
	}
	static class USelItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelItem>();
	}
};
static_assert(alignof(USelItem) == 0x000008, "Wrong alignment on USelItem");
static_assert(sizeof(USelItem) == 0x0000B0, "Wrong size on USelItem");
static_assert(offsetof(USelItem, MpSelProcWindow) == 0x0000A0, "Member 'USelItem::MpSelProcWindow' has a wrong offset!");

// Class xrd777.SelAEventTypeA
// 0x0070 (0x0120 - 0x00B0)
class USelAEventTypeA final : public USelItem
{
public:
	uint8                                         Pad_B0[0x28];                                      // 0x00B0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class USprAsset*                              PSprAsset;                                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAssetLoader*                           PAssetLoader;                                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             LayoutData;                                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUILayoutDataTable*                     LayoutDataTable;                                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x28];                                      // 0x00F8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SelAEventTypeA">();
	}
	static class USelAEventTypeA* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelAEventTypeA>();
	}
};
static_assert(alignof(USelAEventTypeA) == 0x000008, "Wrong alignment on USelAEventTypeA");
static_assert(sizeof(USelAEventTypeA) == 0x000120, "Wrong size on USelAEventTypeA");
static_assert(offsetof(USelAEventTypeA, PSprAsset) == 0x0000D8, "Member 'USelAEventTypeA::PSprAsset' has a wrong offset!");
static_assert(offsetof(USelAEventTypeA, PAssetLoader) == 0x0000E0, "Member 'USelAEventTypeA::PAssetLoader' has a wrong offset!");
static_assert(offsetof(USelAEventTypeA, LayoutData) == 0x0000E8, "Member 'USelAEventTypeA::LayoutData' has a wrong offset!");
static_assert(offsetof(USelAEventTypeA, LayoutDataTable) == 0x0000F0, "Member 'USelAEventTypeA::LayoutDataTable' has a wrong offset!");

// Class xrd777.TaskActor
// 0x0028 (0x0248 - 0x0220)
class ATaskActor final : public AActor
{
public:
	uint8                                         Pad_220[0x28];                                     // 0x0220(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TaskActor">();
	}
	static class ATaskActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATaskActor>();
	}
};
static_assert(alignof(ATaskActor) == 0x000008, "Wrong alignment on ATaskActor");
static_assert(sizeof(ATaskActor) == 0x000248, "Wrong size on ATaskActor");

// Class xrd777.BtlAI
// 0x08E0 (0x0B58 - 0x0278)
class ABtlAI : public AAppActor
{
public:
	uint8                                         Pad_278[0x868];                                    // 0x0278(0x0868)(Fixing Size After Last Property [ Dumper-7 ])
	class ABtlActor*                              Character;                                         // 0x0AE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBtlCoreComponent*                      Core;                                              // 0x0AE8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBtlCommandType                               ActionType;                                        // 0x0AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBtlCommandType                               PrevActionType;                                    // 0x0AF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AF2[0x2];                                      // 0x0AF2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        ActionID;                                          // 0x0AF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        ActionSkillID;                                     // 0x0AF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        ActionItemID;                                      // 0x0AFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        PrevActionID;                                      // 0x0B00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint16                                        MinorParam;                                        // 0x0B04(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBtlDataAttr                                  ReceiveSkillAttr;                                  // 0x0B06(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B07[0x1];                                      // 0x0B07(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABtlActor*>                      ActionTargets;                                     // 0x0B08(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ABtlActor*>                      PrevActionTargets;                                 // 0x0B18(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B28[0x30];                                     // 0x0B28(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static int32 GetPrevUseActionIDForActor(class ABtlActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BtlAI">();
	}
	static class ABtlAI* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABtlAI>();
	}
};
static_assert(alignof(ABtlAI) == 0x000008, "Wrong alignment on ABtlAI");
static_assert(sizeof(ABtlAI) == 0x000B58, "Wrong size on ABtlAI");
static_assert(offsetof(ABtlAI, Character) == 0x000AE0, "Member 'ABtlAI::Character' has a wrong offset!");
static_assert(offsetof(ABtlAI, Core) == 0x000AE8, "Member 'ABtlAI::Core' has a wrong offset!");
static_assert(offsetof(ABtlAI, ActionType) == 0x000AF0, "Member 'ABtlAI::ActionType' has a wrong offset!");
static_assert(offsetof(ABtlAI, PrevActionType) == 0x000AF1, "Member 'ABtlAI::PrevActionType' has a wrong offset!");
static_assert(offsetof(ABtlAI, ActionID) == 0x000AF4, "Member 'ABtlAI::ActionID' has a wrong offset!");
static_assert(offsetof(ABtlAI, ActionSkillID) == 0x000AF8, "Member 'ABtlAI::ActionSkillID' has a wrong offset!");
static_assert(offsetof(ABtlAI, ActionItemID) == 0x000AFC, "Member 'ABtlAI::ActionItemID' has a wrong offset!");
static_assert(offsetof(ABtlAI, PrevActionID) == 0x000B00, "Member 'ABtlAI::PrevActionID' has a wrong offset!");
static_assert(offsetof(ABtlAI, MinorParam) == 0x000B04, "Member 'ABtlAI::MinorParam' has a wrong offset!");
static_assert(offsetof(ABtlAI, ReceiveSkillAttr) == 0x000B06, "Member 'ABtlAI::ReceiveSkillAttr' has a wrong offset!");
static_assert(offsetof(ABtlAI, ActionTargets) == 0x000B08, "Member 'ABtlAI::ActionTargets' has a wrong offset!");
static_assert(offsetof(ABtlAI, PrevActionTargets) == 0x000B18, "Member 'ABtlAI::PrevActionTargets' has a wrong offset!");

// Class xrd777.UIDrawBaseActor
// 0x0040 (0x02B8 - 0x0278)
class AUIDrawBaseActor : public AAppActor
{
public:
	uint8                                         Pad_278[0x18];                                     // 0x0278(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAssetLoader*                           PAssetLoader;                                      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIDataAsset*                           ResourceDataAsset;                                 // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             SyncEndEvent;                                      // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UTextureRenderTarget2D* BPUICommand_GetRenderTarget(const int32 CanvasIndex);

	void AddLoadAsset(const TSoftObjectPtr<class UObject> SoftAsset);
	void BPUICommand_AtlUIBlendState(const EUIBLEND_STATE_TYPE BlendType);
	class UPlgAsset* BPUICommand_CastPlgAsset(class UObject* Asset);
	class USprAsset* BPUICommand_CastSprAsset(class UObject* Asset);
	void BPUICommand_DrawMaterial(const float X, const float Y, const float Z, const float Width, const float Height, const float Angle, const class UObject* PMaterial);
	void BPUICommand_DrawPlg(const float X, const float Y, const float Z, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const int32 PlgID, const float ScaleX, const float ScaleY, const float Angle, const class UPlgAsset* PlgHandle);
	void BPUICommand_DrawRect(const float X, const float Y, const float Z, const float Width, const float Height, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float ScaleX, const float ScaleY, const float Angle, const float Antialiasing, const EUI_DRAW_POINT DrawPoint);
	void BPUICommand_DrawRectV4(const float X, const float Y, const float Z, const float VX0, const float VY0, const float VX1, const float VY1, const float VX2, const float VY2, const float VX3, const float VY3, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float ScaleX, const float ScaleY, const float Angle, const float Antialiasing, const EUI_DRAW_POINT DrawPoint);
	void BPUICommand_DrawRoundRect(const float X, const float Y, const float Z, const float Width, const float Height, const int32 Round, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float ScaleX, const float ScaleY, const float Angle, const float Antialiasing, const EUI_DRAW_POINT DrawPoint);
	void BPUICommand_DrawScrollbar(const float X, const float Y, const float Z, const float Width, const float Height, const float ScrollRange, const int32 ScrollPos, const int32 DrawListNum, const int32 MaxListNum, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float ScaleX, const float ScaleY, const float Angle, const float Antialiasing, const EUI_DRAW_POINT DrawPoint);
	void BPUICommand_DrawSircle(const float X, const float Y, const float Z, const float Radius, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float Antialiasing);
	void BPUICommand_DrawSpr(const float X, const float Y, const float Z, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const int32 SprNo, const float ScaleX, const float ScaleY, const float Angle, const class USprAsset* SprHandle, const EUI_DRAW_POINT DrawPoint);
	void BPUICommand_DrawTexture(const float X, const float Y, const float Z, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float ScaleX, const float ScaleY, const float Angle, const float U0, const float V0, const float U1, const float V1, const class UTexture* TextureHandle, const EUI_DRAW_POINT DrawPoint);
	void BPUICommand_DrawTriangle(const float X, const float Y, const float Z, const float VX0, const float VY0, const float VX1, const float VY1, const float VX2, const float VY2, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float ScaleX, const float ScaleY, const float Angle, const float Antialiasing);
	void BPUICommand_DrawVerticalGradationRect(const float X, const float Y, const float Width, const float Height, const struct FColor& TopColor, const struct FColor& BottomColor);
	void BPUICommand_FontDraw(const float X, const float Y, const float Z, const class FString& String, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float Scale, const float Angle, const EUI_DRAW_POINT DrawPoint, const EUIFontStyle Style);
	void BPUICommand_FontDrawEx(const float X, const float Y, const float Z, const class FString& String, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float Scale, const float Angle, const float AnglePointX, const float AnglePointY, const EUIFontStyle Style);
	void BPUICommand_FontDrawExFromFName(const float X, const float Y, const float Z, const class FName& String, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float Scale, const float Angle, const float AnglePointX, const float AnglePointY, const EUIFontStyle Style);
	void BPUICommand_FontDrawFromFName(const float X, const float Y, const float Z, const class FName& String, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float Scale, const float Angle, const EUI_DRAW_POINT DrawPoint, const EUIFontStyle Style);
	void BPUICommand_ItalicFontDraw(const float X, const float Y, const class FString& String, const struct FColor& Color, const float Scale, const float Angle, const EUI_DRAW_POINT DrawPoint, const EUIFontStyle Style);
	void BPUICommand_ScalingFontDraw(const float X, const float Y, const float Z, const class FString& String, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float SizeX, const float SizeY, const float Scale, const float Angle, const bool ScalingOnlyX, const EUI_DRAW_POINT DrawPoint, const EUIFontStyle Style, const bool IsScaling);
	void BPUICommand_ScalingItalicFontDraw(const float X, const float Y, const class FString& String, const struct FColor& Color, const float SizeX, const float SizeY, const float Scale, const float Angle, const bool ScalingOnlyX, const EUI_DRAW_POINT DrawPoint, const EUIFontStyle Style);
	void BPUICommand_SetBlendState(const EUIBlendOperation OpColor, const EUIBlendFactor SrcColor, const EUIBlendFactor DstColor, const EUIBlendOperation OpAlpha, const EUIBlendFactor SrcAlpha, const EUIBlendFactor DstAlpha);
	void BPUICommand_SetPresetBlendState(const EUIOTPRESET_BLEND_TYPE BlendType);
	void BPUICommand_SetRenderTarget(const int32 CanvasIndex);
	void BPUIDebugCommand_DrawMaterial(const float X, const float Y, const float Z, const float Width, const float Height, const float Angle, const class UMaterialInstance* PMaterialInstance);
	void BPUIDebugCommand_DrawRect(const float X, const float Y, const float Z, const float Width, const float Height, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float ScaleX, const float ScaleY, const float Angle, const float Antialiasing);
	void BPUIDebugCommand_DrawRectV4(const float X, const float Y, const float Z, const float VX0, const float VY0, const float VX1, const float VY1, const float VX2, const float VY2, const float VX3, const float VY3, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float ScaleX, const float ScaleY, const float Angle, const float Antialiasing);
	void BPUIDebugCommand_DrawSpr(const float X, const float Y, const float Z, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const int32 SprNo, const float ScaleX, const float ScaleY, const float Angle, const class USprAsset* SprHandle);
	void BPUIDebugCommand_DrawTexture(const float X, const float Y, const float Z, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float ScaleX, const float ScaleY, const float Angle, const float U0, const float V0, const float U1, const float V1, const class UTexture* TextureHandle);
	void BPUIDebugCommand_DrawTriangle(const float VX0, const float VY0, const float VX1, const float VY1, const float VX2, const float VY2, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const float ScaleX, const float ScaleY, const float Angle, const float Antialiasing);
	class UObject* GetResourceData(const int32 Index_0);
	void LoadStart();
	bool Sync();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIDrawBaseActor">();
	}
	static class AUIDrawBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUIDrawBaseActor>();
	}
};
static_assert(alignof(AUIDrawBaseActor) == 0x000008, "Wrong alignment on AUIDrawBaseActor");
static_assert(sizeof(AUIDrawBaseActor) == 0x0002B8, "Wrong size on AUIDrawBaseActor");
static_assert(offsetof(AUIDrawBaseActor, PAssetLoader) == 0x000290, "Member 'AUIDrawBaseActor::PAssetLoader' has a wrong offset!");
static_assert(offsetof(AUIDrawBaseActor, ResourceDataAsset) == 0x000298, "Member 'AUIDrawBaseActor::ResourceDataAsset' has a wrong offset!");
static_assert(offsetof(AUIDrawBaseActor, SyncEndEvent) == 0x0002A0, "Member 'AUIDrawBaseActor::SyncEndEvent' has a wrong offset!");

// Class xrd777.UIConfigurationDraw
// 0x03D8 (0x0690 - 0x02B8)
class AUIConfigurationDraw : public AUIDrawBaseActor
{
public:
	uint8                                         Pad_2B8[0x40];                                     // 0x02B8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ItemDrawOffset;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x1E];                                     // 0x0300(0x001E)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsTerminationClose;                               // 0x031E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31F[0x21];                                     // 0x031F(0x0021)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDrawBGMParam>                  BgmParams;                                         // 0x0340(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	class USprAsset*                              PKeySpr;                                           // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              ConfigInSilhouetteOffset;                          // 0x0358(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_360[0x310];                                    // 0x0360(0x0310)(Fixing Size After Last Property [ Dumper-7 ])
	class UUILayoutDataTable*                     LayoutDataTable;                                   // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUILayoutDataTable*                     HelpLayoutDataTable;                               // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUILayoutDataTable*                     ConfigTextLayoutDataTable;                         // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_688[0x8];                                      // 0x0688(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BGMAlphaCalculation(float InTimer, float InSrcValue, float InDstValue, int32 InWaitFrame, int32 InNextWaitFrame, int32 InMoveFrame, int32 InNextMoveFrame, EAppCalculationType InAnimType);
	void BGMInAnimFinished();
	struct FVector2D BGMMoveCalculation(float InTimer, const struct FVector2D& InSrcValue, const struct FVector2D& InDstValue, int32 InWaitFrame, int32 InMoveFrame, EAppCalculationType InAnimType);
	float BGMScaleCalculation(float InTimer, float InSrcValue, float InDstValue, int32 InWaitFrame, int32 InMoveFrame, EAppCalculationType InAnimType);
	void BgmSetAnimFinished();
	void BPUICommand_DrawSpr_Ex(const float X, const float Y, const float Z, const uint8 R, const uint8 G, const uint8 B, const uint8 A, const int32 SprNo, const float ScaleX, const float ScaleY, const float PipodX, const float PipodY, const float Angle, const class USprAsset* SprHandle);
	void Closed();
	void ConfigInAnimFinished();
	float ConvFrameToTime(int32 InFrame);
	void DrawAudioDeviceChange(float baseX, float baseY, float TextX, float TextY, uint8 TextColorR, uint8 TextColorG, uint8 TextColorB, uint8 TextColorA, float SizeX, float SizeY, const struct FDrawConfigParam& DrawConfigParam, const class USprAsset* SprHandle);
	void DrawBgmSelectText(float baseX, float baseY, float TextX, float TextY, uint8 TextColorR, uint8 TextColorG, uint8 TextColorB, uint8 TextColorA, float SizeX, float SizeY, const struct FDrawConfigParam& DrawConfigParam, struct FDrawBGMParam& DrawBGMParam, const class USprAsset* SprHandle);
	void DrawCloseWipe();
	void DrawCommonBg1();
	void DrawCommonBg2(bool IsTitle);
	void DrawGlowCore(const struct FVector2D& Offset, const struct FColor& Color, float Scale, const struct FVector2D& PlusOffset, const class USprAsset* SprHandle);
	void DrawHeroSilhouette(const struct FVector2D& Offset);
	void DrawHeroTexture(class UTexture* InTexture);
	void DrawInWipe();
	void DrawKeyConfigButtonSpr(float X, float Y, const struct FDrawConfigParam& DrawConfigParam, const struct FColor& RGBA, const class USprAsset* SprHandle);
	void DrawKeyConfigSwitcher(float X, float Y);
	void DrawNami();
	void DrawUim(class UObject* InUimAsset, float InFrame, bool* bIsMaxFrame, const class UTexture* InTexture);
	class UMaterialInterface* Get_BgMaterial();
	void GetAdjustedConfigPos(ECmpLayoutConfig InType, const struct FVector2D& Default, struct FVector2D* OutSize);
	void GetAdjustedConfigTextCol(ECmpLayoutConfigText InType, struct FVector2D* OutSize);
	bool GetAdjustedHelpBarOffset(bool InIsBGMMode, struct FVector2D* OutPosition);
	bool GetAdjustedHelpRootPosition(bool InIsBGMMode, struct FVector2D* OutPosition);
	int32 GetBgmCursorIndex();
	int32 GetBgmListTopIndex();
	int32 GetBgmSetID();
	class FString GetBGMText(int32 InSelect);
	struct FColor GetBlueBoardColor();
	class FString GetButtonLayoutText(int32 InSelect);
	class FString GetConfigTypeText(int32 InSelect);
	int32 GetCurrentIndex();
	int32 GetCursorIndex();
	class FString GetDifficultyText(int32 InSelect);
	struct FDrawConfigParam GetDrawConfigParam(int32 InMenuID);
	struct FColor GetGradation1BottomColour();
	struct FColor GetGradation1TopColour();
	struct FColor GetGradation2BottomColour();
	struct FColor GetGradation2TopColour();
	struct FDrawConfigParam GetIndexedDrawConfigParam(int32 InIndex);
	bool GetIsFisrt();
	int32 GetListNum();
	int32 GetListTopIndex();
	class FString GetOffText();
	class FString GetOnText();
	int32 GetPlayingIndex();
	class FString GetSelLangText(int32 InSelect);
	class FString GetSoundOutputText(int32 InSelect);
	bool IsBaseDiffLuna();
	bool IsBGMMode();
	bool IsConfigTypeMode();
	bool IsKeyConfig();
	bool IsScrollDrawBgmSelectText();
	bool IsTitleOpend();
	bool IsWindowShow();
	bool On_BgmSetIndexChanged(int32 InSetIndex);
	bool On_CursorIndexChanged(int32 InCursorIndex, int32 InListTopIndex);
	bool On_CursorIndexChanged_BGM(int32 InCursorIndex, int32 InListTopIndex);
	bool On_PlayingIndexChanged(int32 InPlayingIndex);
	bool On_ValueChanged(int32 InMenueID, bool InFlag, int32 InValue);
	void ProcessCompleted__DelegateSignature();
	void SetScrollBarTouchCollision(float X, float Y, float Width, float Height, float ScrollRange, int32 DrawListNum, int32 MaxListNum, int32 ScrollPosY, int32 AddLayer, EUI_DRAW_POINT DrawPoint);
	void SetScrollPos(const struct FVector2D& InPos, float Height, float ScrollRange, int32 DrawListNum, int32 MaxListNum, int32 ScrollPosY);
	void SetScrollSize(const struct FVector2D& InSize);
	void SetScrollTouchCollision(float X, float Y, float Width, float Height, int32 AddLayer, EUI_DRAW_POINT DrawPoint);
	void SetSliderPos(int32 InMenuID, const struct FVector2D& InSliderPos);
	void SetTouchCollision(int32 Index_0, float X, float Y, float Width, float Height, int32 AddLayer, EUI_DRAW_POINT DrawPoint);
	void SetValueGaugeTouchCollision(const struct FDrawConfigParam& DrawParam, float GaugeX, float GaugeY, float GaugeWidth, float GaugeHeight, float SliderX, float SliderY);
	bool Start_CloseAnim();
	bool Start_InAnim();
	bool Start_MenuChangeAnim();
	bool Start_ToBGMAnim();
	bool Start_ToConfAnim();
	void StartCloseWipe();
	void StartInWipe(bool IsTitle);
	bool StateBGMDraw_In();
	bool StateDraw_BG();
	bool StateDraw_BGMSelect();
	bool StateDraw_Close();
	bool StateDraw_IN();
	bool StateDraw_ListItem(int32 InMenueID, int32 InListIndex);
	bool StateDraw_Main();
	bool StateDraw_Update(float DeltaTime);
	bool StateDraw_UpdateOnlyCursor(float DeltaTime);
	bool TimeWithinRangeFrame(float NowTime, int32 StartFrame, int32 EndFrame);
	void UpdateAnim(float DeltaTime);
	void UpdateCloseWipe(float InDeltaTime);
	void UpdateInWipe(float InDeltaTime);

	float GetUipParameter(const class FString& Key) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIConfigurationDraw">();
	}
	static class AUIConfigurationDraw* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUIConfigurationDraw>();
	}
};
static_assert(alignof(AUIConfigurationDraw) == 0x000008, "Wrong alignment on AUIConfigurationDraw");
static_assert(sizeof(AUIConfigurationDraw) == 0x000690, "Wrong size on AUIConfigurationDraw");
static_assert(offsetof(AUIConfigurationDraw, ItemDrawOffset) == 0x0002F8, "Member 'AUIConfigurationDraw::ItemDrawOffset' has a wrong offset!");
static_assert(offsetof(AUIConfigurationDraw, bIsTerminationClose) == 0x00031E, "Member 'AUIConfigurationDraw::bIsTerminationClose' has a wrong offset!");
static_assert(offsetof(AUIConfigurationDraw, BgmParams) == 0x000340, "Member 'AUIConfigurationDraw::BgmParams' has a wrong offset!");
static_assert(offsetof(AUIConfigurationDraw, PKeySpr) == 0x000350, "Member 'AUIConfigurationDraw::PKeySpr' has a wrong offset!");
static_assert(offsetof(AUIConfigurationDraw, ConfigInSilhouetteOffset) == 0x000358, "Member 'AUIConfigurationDraw::ConfigInSilhouetteOffset' has a wrong offset!");
static_assert(offsetof(AUIConfigurationDraw, LayoutDataTable) == 0x000670, "Member 'AUIConfigurationDraw::LayoutDataTable' has a wrong offset!");
static_assert(offsetof(AUIConfigurationDraw, HelpLayoutDataTable) == 0x000678, "Member 'AUIConfigurationDraw::HelpLayoutDataTable' has a wrong offset!");
static_assert(offsetof(AUIConfigurationDraw, ConfigTextLayoutDataTable) == 0x000680, "Member 'AUIConfigurationDraw::ConfigTextLayoutDataTable' has a wrong offset!");

// Class xrd777.FldDungeonEventTransActor
// 0x0020 (0x0298 - 0x0278)
class AFldDungeonEventTransActor final : public AAppActor
{
public:
	EDungeonEventTransOriginType                  TransOriginType;                                   // 0x0278(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WithinTypeID;                                      // 0x027C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AFldDungeonLayoutStartActor*>    M_LayoutPos;                                       // 0x0280(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetPartyTransform();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FldDungeonEventTransActor">();
	}
	static class AFldDungeonEventTransActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFldDungeonEventTransActor>();
	}
};
static_assert(alignof(AFldDungeonEventTransActor) == 0x000008, "Wrong alignment on AFldDungeonEventTransActor");
static_assert(sizeof(AFldDungeonEventTransActor) == 0x000298, "Wrong size on AFldDungeonEventTransActor");
static_assert(offsetof(AFldDungeonEventTransActor, TransOriginType) == 0x000278, "Member 'AFldDungeonEventTransActor::TransOriginType' has a wrong offset!");
static_assert(offsetof(AFldDungeonEventTransActor, WithinTypeID) == 0x00027C, "Member 'AFldDungeonEventTransActor::WithinTypeID' has a wrong offset!");
static_assert(offsetof(AFldDungeonEventTransActor, M_LayoutPos) == 0x000280, "Member 'AFldDungeonEventTransActor::M_LayoutPos' has a wrong offset!");

// Class xrd777.ActivityTest
// 0x0010 (0x0288 - 0x0278)
class AActivityTest final : public AAppActor
{
public:
	class UDebugMenu*                             DebugMenu_;                                        // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivityTest">();
	}
	static class AActivityTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<AActivityTest>();
	}
};
static_assert(alignof(AActivityTest) == 0x000008, "Wrong alignment on AActivityTest");
static_assert(sizeof(AActivityTest) == 0x000288, "Wrong size on AActivityTest");
static_assert(offsetof(AActivityTest, DebugMenu_) == 0x000278, "Member 'AActivityTest::DebugMenu_' has a wrong offset!");

// Class xrd777.CommunityRankDataAsset
// 0x0010 (0x0040 - 0x0030)
class UCommunityRankDataAsset final : public UAppDataAsset
{
public:
	TArray<struct FCommunityRankItem>             Data;                                              // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommunityRankDataAsset">();
	}
	static class UCommunityRankDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommunityRankDataAsset>();
	}
};
static_assert(alignof(UCommunityRankDataAsset) == 0x000008, "Wrong alignment on UCommunityRankDataAsset");
static_assert(sizeof(UCommunityRankDataAsset) == 0x000040, "Wrong size on UCommunityRankDataAsset");
static_assert(offsetof(UCommunityRankDataAsset, Data) == 0x000030, "Member 'UCommunityRankDataAsset::Data' has a wrong offset!");

// Class xrd777.AppLevelManager
// 0x0068 (0x0098 - 0x0030)
class UAppLevelManager final : public UGameInstanceSubsystem
{
public:
	TMap<class FName, struct FAppLevelData>       MLevelTable_;                                      // 0x0030(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<class AAppLvMngUnloadMonitorActor*>    MMonitors_;                                        // 0x0080(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppLevelManager">();
	}
	static class UAppLevelManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppLevelManager>();
	}
};
static_assert(alignof(UAppLevelManager) == 0x000008, "Wrong alignment on UAppLevelManager");
static_assert(sizeof(UAppLevelManager) == 0x000098, "Wrong size on UAppLevelManager");
static_assert(offsetof(UAppLevelManager, MLevelTable_) == 0x000030, "Member 'UAppLevelManager::MLevelTable_' has a wrong offset!");
static_assert(offsetof(UAppLevelManager, MMonitors_) == 0x000080, "Member 'UAppLevelManager::MMonitors_' has a wrong offset!");

// Class xrd777.UIBaseActor
// 0x0028 (0x02A0 - 0x0278)
class AUIBaseActor : public AAppActor
{
public:
	uint8                                         Pad_278[0x28];                                     // 0x0278(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIBaseActor">();
	}
	static class AUIBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUIBaseActor>();
	}
};
static_assert(alignof(AUIBaseActor) == 0x000008, "Wrong alignment on AUIBaseActor");
static_assert(sizeof(AUIBaseActor) == 0x0002A0, "Wrong size on AUIBaseActor");

// Class xrd777.UIMissingPersonActor
// 0x0000 (0x02A0 - 0x02A0)
class AUIMissingPersonActor final : public AUIBaseActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIMissingPersonActor">();
	}
	static class AUIMissingPersonActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUIMissingPersonActor>();
	}
};
static_assert(alignof(AUIMissingPersonActor) == 0x000008, "Wrong alignment on AUIMissingPersonActor");
static_assert(sizeof(AUIMissingPersonActor) == 0x0002A0, "Wrong size on AUIMissingPersonActor");

// Class xrd777.BPExtensionsFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBPExtensionsFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AttachMeshComponent(class UMeshComponent* Target, class FName SocketName, class UMeshComponent* AttachComponent);
	static class UMeshComponent* AttachSkeletalMesh(class UMeshComponent* Target, class FName SocketName, class USkeletalMesh* AttachSKMesh);
	static class UMeshComponent* AttachStaticMesh(class UMeshComponent* Target, class FName SocketName, class UStaticMesh* AttachSTMesh);
	static void ChangeSkeletalMesh(class USkeletalMeshComponent* TargetMesh, class USkeletalMesh* ChangeMesh);
	static void CommitConsoleLog(const class FString& InString);
	static void DetachSocketAttachment(class UMeshComponent* Target, class FName SocketName);
	static TArray<struct FLinearColor> GetInverseMatrix(const struct FTransform& Transform);
	static int32 GetScreenPercentage(class UPlanarReflectionComponent* InComponent);
	static void RemoveRenderMesh(class USkeletalMeshComponent* TargetMesh);
	static void SetScreenPercentage(class UPlanarReflectionComponent* InComponent, int32 InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BPExtensionsFunctionLibrary">();
	}
	static class UBPExtensionsFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPExtensionsFunctionLibrary>();
	}
};
static_assert(alignof(UBPExtensionsFunctionLibrary) == 0x000008, "Wrong alignment on UBPExtensionsFunctionLibrary");
static_assert(sizeof(UBPExtensionsFunctionLibrary) == 0x000028, "Wrong size on UBPExtensionsFunctionLibrary");

// Class xrd777.AddContent
// 0x0030 (0x0058 - 0x0028)
class UAddContent final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class ADLCManager*                            MDlcManager;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AAddContentDialog*                      MAdcDialog;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<bool>                                  GuardUnlockedContent;                              // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddContent">();
	}
	static class UAddContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddContent>();
	}
};
static_assert(alignof(UAddContent) == 0x000008, "Wrong alignment on UAddContent");
static_assert(sizeof(UAddContent) == 0x000058, "Wrong size on UAddContent");
static_assert(offsetof(UAddContent, MDlcManager) == 0x000038, "Member 'UAddContent::MDlcManager' has a wrong offset!");
static_assert(offsetof(UAddContent, MAdcDialog) == 0x000040, "Member 'UAddContent::MAdcDialog' has a wrong offset!");
static_assert(offsetof(UAddContent, GuardUnlockedContent) == 0x000048, "Member 'UAddContent::GuardUnlockedContent' has a wrong offset!");

// Class xrd777.AddContentDialog
// 0x0178 (0x03F0 - 0x0278)
class AAddContentDialog final : public AAppActor
{
public:
	uint8                                         Pad_278[0x160];                                    // 0x0278(0x0160)(Fixing Size After Last Property [ Dumper-7 ])
	class ADLCManager*                            MDlcManager;                                       // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AUIProgressBarDraw*                     MProgressBar;                                      // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddContentDialog">();
	}
	static class AAddContentDialog* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAddContentDialog>();
	}
};
static_assert(alignof(AAddContentDialog) == 0x000008, "Wrong alignment on AAddContentDialog");
static_assert(sizeof(AAddContentDialog) == 0x0003F0, "Wrong size on AAddContentDialog");
static_assert(offsetof(AAddContentDialog, MDlcManager) == 0x0003D8, "Member 'AAddContentDialog::MDlcManager' has a wrong offset!");
static_assert(offsetof(AAddContentDialog, MProgressBar) == 0x0003E0, "Member 'AAddContentDialog::MProgressBar' has a wrong offset!");

// Class xrd777.UICombineCalc
// 0x0098 (0x00C0 - 0x0028)
class UUICombineCalc final : public UObject
{
public:
	class UAssetLoader*                           Loader_;                                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNormalSpreadDataAsset*                 NormalSpread_;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpecialSpreadDataAsset*                SpecialSpread_;                                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPersonaLiftDataAsset*                  PersonaLift_;                                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkillAffinityDataAsset*                SkillAffinity_;                                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkillLimitDataAsset*                   SkillLimit_;                                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPersonaConfigDataAsset*                PersonaConfig_;                                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommunityRankDataAsset*                CommunityRank_;                                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMoonAgeProbabilityDataAsset*           MoonAgeProbability_;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCombineCounterDataAsset*               CombineCounter_;                                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkillChangeDataAsset*                  SkillChange_;                                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkillPackDataAsset*                    SkillPack_;                                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkillPowerUpDataAsset*                 SkillPowerUp_;                                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCombineMiscDataAsset*                  CombineMisc_;                                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                                BPCombineCalc_;                                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUICombineCalcFunction*                 CombineCalcFunction_;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDLCPersonaCombineBirthDataAsset*       DLCPersonaCombineBirth_;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWordSortDataAsset*                     WordSortDataAsset_;                                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UICombineCalc">();
	}
	static class UUICombineCalc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUICombineCalc>();
	}
};
static_assert(alignof(UUICombineCalc) == 0x000008, "Wrong alignment on UUICombineCalc");
static_assert(sizeof(UUICombineCalc) == 0x0000C0, "Wrong size on UUICombineCalc");
static_assert(offsetof(UUICombineCalc, Loader_) == 0x000028, "Member 'UUICombineCalc::Loader_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, NormalSpread_) == 0x000030, "Member 'UUICombineCalc::NormalSpread_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, SpecialSpread_) == 0x000038, "Member 'UUICombineCalc::SpecialSpread_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, PersonaLift_) == 0x000040, "Member 'UUICombineCalc::PersonaLift_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, SkillAffinity_) == 0x000048, "Member 'UUICombineCalc::SkillAffinity_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, SkillLimit_) == 0x000050, "Member 'UUICombineCalc::SkillLimit_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, PersonaConfig_) == 0x000058, "Member 'UUICombineCalc::PersonaConfig_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, CommunityRank_) == 0x000060, "Member 'UUICombineCalc::CommunityRank_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, MoonAgeProbability_) == 0x000068, "Member 'UUICombineCalc::MoonAgeProbability_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, CombineCounter_) == 0x000070, "Member 'UUICombineCalc::CombineCounter_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, SkillChange_) == 0x000078, "Member 'UUICombineCalc::SkillChange_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, SkillPack_) == 0x000080, "Member 'UUICombineCalc::SkillPack_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, SkillPowerUp_) == 0x000088, "Member 'UUICombineCalc::SkillPowerUp_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, CombineMisc_) == 0x000090, "Member 'UUICombineCalc::CombineMisc_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, BPCombineCalc_) == 0x000098, "Member 'UUICombineCalc::BPCombineCalc_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, CombineCalcFunction_) == 0x0000A0, "Member 'UUICombineCalc::CombineCalcFunction_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, DLCPersonaCombineBirth_) == 0x0000A8, "Member 'UUICombineCalc::DLCPersonaCombineBirth_' has a wrong offset!");
static_assert(offsetof(UUICombineCalc, WordSortDataAsset_) == 0x0000B0, "Member 'UUICombineCalc::WordSortDataAsset_' has a wrong offset!");

// Class xrd777.AssetHolder
// 0x0070 (0x0098 - 0x0028)
class UAssetHolder final : public UObject
{
public:
	TArray<struct FSoftObjectPath>                HoldAssets;                                        // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
