#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Xrd777

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Xrd777_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "Niagara_structs.hpp"
#include "MovieScene_structs.hpp"
#include "CriWareAdxLipSync_structs.hpp"


namespace SDK::Params
{

// Function xrd777.AppActor.AsAActor
// 0x0008 (0x0008 - 0x0000)
struct AppActor_AsAActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppActor_AsAActor) == 0x000008, "Wrong alignment on AppActor_AsAActor");
static_assert(sizeof(AppActor_AsAActor) == 0x000008, "Wrong size on AppActor_AsAActor");
static_assert(offsetof(AppActor_AsAActor, ReturnValue) == 0x000000, "Member 'AppActor_AsAActor::ReturnValue' has a wrong offset!");

// Function xrd777.AppActor.AsUObject
// 0x0008 (0x0008 - 0x0000)
struct AppActor_AsUObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppActor_AsUObject) == 0x000008, "Wrong alignment on AppActor_AsUObject");
static_assert(sizeof(AppActor_AsUObject) == 0x000008, "Wrong size on AppActor_AsUObject");
static_assert(offsetof(AppActor_AsUObject, ReturnValue) == 0x000000, "Member 'AppActor_AsUObject::ReturnValue' has a wrong offset!");

// Function xrd777.AppActor.EndPlay
// 0x0001 (0x0001 - 0x0000)
struct AppActor_EndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppActor_EndPlay) == 0x000001, "Wrong alignment on AppActor_EndPlay");
static_assert(sizeof(AppActor_EndPlay) == 0x000001, "Wrong size on AppActor_EndPlay");
static_assert(offsetof(AppActor_EndPlay, EndPlayReason) == 0x000000, "Member 'AppActor_EndPlay::EndPlayReason' has a wrong offset!");

// Function xrd777.AppActor.GetAppPauseFlags
// 0x0001 (0x0001 - 0x0000)
struct AppActor_GetAppPauseFlags final
{
public:
	EAppPauseObjectFlag                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppActor_GetAppPauseFlags) == 0x000001, "Wrong alignment on AppActor_GetAppPauseFlags");
static_assert(sizeof(AppActor_GetAppPauseFlags) == 0x000001, "Wrong size on AppActor_GetAppPauseFlags");
static_assert(offsetof(AppActor_GetAppPauseFlags, ReturnValue) == 0x000000, "Member 'AppActor_GetAppPauseFlags::ReturnValue' has a wrong offset!");

// Function xrd777.TitleLogoActor.GetAlpha
// 0x0004 (0x0004 - 0x0000)
struct TitleLogoActor_GetAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TitleLogoActor_GetAlpha) == 0x000004, "Wrong alignment on TitleLogoActor_GetAlpha");
static_assert(sizeof(TitleLogoActor_GetAlpha) == 0x000004, "Wrong size on TitleLogoActor_GetAlpha");
static_assert(offsetof(TitleLogoActor_GetAlpha, ReturnValue) == 0x000000, "Member 'TitleLogoActor_GetAlpha::ReturnValue' has a wrong offset!");

// Function xrd777.TitleLogoActor.IsGameClear
// 0x0001 (0x0001 - 0x0000)
struct TitleLogoActor_IsGameClear final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TitleLogoActor_IsGameClear) == 0x000001, "Wrong alignment on TitleLogoActor_IsGameClear");
static_assert(sizeof(TitleLogoActor_IsGameClear) == 0x000001, "Wrong size on TitleLogoActor_IsGameClear");
static_assert(offsetof(TitleLogoActor_IsGameClear, ReturnValue) == 0x000000, "Member 'TitleLogoActor_IsGameClear::ReturnValue' has a wrong offset!");

// Function xrd777.BtlAI.GetPrevUseActionIDForActor
// 0x0010 (0x0010 - 0x0000)
struct BtlAI_GetPrevUseActionIDForActor final
{
public:
	class ABtlActor*                              Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BtlAI_GetPrevUseActionIDForActor) == 0x000008, "Wrong alignment on BtlAI_GetPrevUseActionIDForActor");
static_assert(sizeof(BtlAI_GetPrevUseActionIDForActor) == 0x000010, "Wrong size on BtlAI_GetPrevUseActionIDForActor");
static_assert(offsetof(BtlAI_GetPrevUseActionIDForActor, Actor) == 0x000000, "Member 'BtlAI_GetPrevUseActionIDForActor::Actor' has a wrong offset!");
static_assert(offsetof(BtlAI_GetPrevUseActionIDForActor, ReturnValue) == 0x000008, "Member 'BtlAI_GetPrevUseActionIDForActor::ReturnValue' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_GetRenderTarget
// 0x0010 (0x0010 - 0x0000)
struct UIDrawBaseActor_BPUICommand_GetRenderTarget final
{
public:
	int32                                         CanvasIndex;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_GetRenderTarget) == 0x000008, "Wrong alignment on UIDrawBaseActor_BPUICommand_GetRenderTarget");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_GetRenderTarget) == 0x000010, "Wrong size on UIDrawBaseActor_BPUICommand_GetRenderTarget");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_GetRenderTarget, CanvasIndex) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_GetRenderTarget::CanvasIndex' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_GetRenderTarget, ReturnValue) == 0x000008, "Member 'UIDrawBaseActor_BPUICommand_GetRenderTarget::ReturnValue' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.AddLoadAsset
// 0x0028 (0x0028 - 0x0000)
struct UIDrawBaseActor_AddLoadAsset final
{
public:
	TSoftObjectPtr<class UObject>                 SoftAsset;                                         // 0x0000(0x0028)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIDrawBaseActor_AddLoadAsset) == 0x000008, "Wrong alignment on UIDrawBaseActor_AddLoadAsset");
static_assert(sizeof(UIDrawBaseActor_AddLoadAsset) == 0x000028, "Wrong size on UIDrawBaseActor_AddLoadAsset");
static_assert(offsetof(UIDrawBaseActor_AddLoadAsset, SoftAsset) == 0x000000, "Member 'UIDrawBaseActor_AddLoadAsset::SoftAsset' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_AtlUIBlendState
// 0x0001 (0x0001 - 0x0000)
struct UIDrawBaseActor_BPUICommand_AtlUIBlendState final
{
public:
	EUIBLEND_STATE_TYPE                           BlendType;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_AtlUIBlendState) == 0x000001, "Wrong alignment on UIDrawBaseActor_BPUICommand_AtlUIBlendState");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_AtlUIBlendState) == 0x000001, "Wrong size on UIDrawBaseActor_BPUICommand_AtlUIBlendState");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_AtlUIBlendState, BlendType) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_AtlUIBlendState::BlendType' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_CastPlgAsset
// 0x0010 (0x0010 - 0x0000)
struct UIDrawBaseActor_BPUICommand_CastPlgAsset final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlgAsset*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_CastPlgAsset) == 0x000008, "Wrong alignment on UIDrawBaseActor_BPUICommand_CastPlgAsset");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_CastPlgAsset) == 0x000010, "Wrong size on UIDrawBaseActor_BPUICommand_CastPlgAsset");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_CastPlgAsset, Asset) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_CastPlgAsset::Asset' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_CastPlgAsset, ReturnValue) == 0x000008, "Member 'UIDrawBaseActor_BPUICommand_CastPlgAsset::ReturnValue' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_CastSprAsset
// 0x0010 (0x0010 - 0x0000)
struct UIDrawBaseActor_BPUICommand_CastSprAsset final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USprAsset*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_CastSprAsset) == 0x000008, "Wrong alignment on UIDrawBaseActor_BPUICommand_CastSprAsset");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_CastSprAsset) == 0x000010, "Wrong size on UIDrawBaseActor_BPUICommand_CastSprAsset");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_CastSprAsset, Asset) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_CastSprAsset::Asset' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_CastSprAsset, ReturnValue) == 0x000008, "Member 'UIDrawBaseActor_BPUICommand_CastSprAsset::ReturnValue' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_DrawMaterial
// 0x0020 (0x0020 - 0x0000)
struct UIDrawBaseActor_BPUICommand_DrawMaterial final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          PMaterial;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_DrawMaterial) == 0x000008, "Wrong alignment on UIDrawBaseActor_BPUICommand_DrawMaterial");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_DrawMaterial) == 0x000020, "Wrong size on UIDrawBaseActor_BPUICommand_DrawMaterial");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawMaterial, X) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_DrawMaterial::X' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawMaterial, Y) == 0x000004, "Member 'UIDrawBaseActor_BPUICommand_DrawMaterial::Y' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawMaterial, Z) == 0x000008, "Member 'UIDrawBaseActor_BPUICommand_DrawMaterial::Z' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawMaterial, Width) == 0x00000C, "Member 'UIDrawBaseActor_BPUICommand_DrawMaterial::Width' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawMaterial, Height) == 0x000010, "Member 'UIDrawBaseActor_BPUICommand_DrawMaterial::Height' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawMaterial, Angle) == 0x000014, "Member 'UIDrawBaseActor_BPUICommand_DrawMaterial::Angle' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawMaterial, PMaterial) == 0x000018, "Member 'UIDrawBaseActor_BPUICommand_DrawMaterial::PMaterial' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_DrawPlg
// 0x0028 (0x0028 - 0x0000)
struct UIDrawBaseActor_BPUICommand_DrawPlg final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         R;                                                 // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         G;                                                 // 0x000D(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         B;                                                 // 0x000E(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         A;                                                 // 0x000F(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlgID;                                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleX;                                            // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleY;                                            // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UPlgAsset*                        PlgHandle;                                         // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_DrawPlg) == 0x000008, "Wrong alignment on UIDrawBaseActor_BPUICommand_DrawPlg");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_DrawPlg) == 0x000028, "Wrong size on UIDrawBaseActor_BPUICommand_DrawPlg");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, X) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::X' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, Y) == 0x000004, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::Y' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, Z) == 0x000008, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::Z' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, R) == 0x00000C, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::R' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, G) == 0x00000D, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::G' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, B) == 0x00000E, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::B' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, A) == 0x00000F, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::A' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, PlgID) == 0x000010, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::PlgID' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, ScaleX) == 0x000014, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::ScaleX' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, ScaleY) == 0x000018, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::ScaleY' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, Angle) == 0x00001C, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::Angle' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawPlg, PlgHandle) == 0x000020, "Member 'UIDrawBaseActor_BPUICommand_DrawPlg::PlgHandle' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_DrawRect
// 0x002C (0x002C - 0x0000)
struct UIDrawBaseActor_BPUICommand_DrawRect final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         R;                                                 // 0x0014(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         G;                                                 // 0x0015(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         B;                                                 // 0x0016(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         A;                                                 // 0x0017(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleX;                                            // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleY;                                            // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Antialiasing;                                      // 0x0024(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUI_DRAW_POINT                                DrawPoint;                                         // 0x0028(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_DrawRect) == 0x000004, "Wrong alignment on UIDrawBaseActor_BPUICommand_DrawRect");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_DrawRect) == 0x00002C, "Wrong size on UIDrawBaseActor_BPUICommand_DrawRect");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, X) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::X' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, Y) == 0x000004, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::Y' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, Z) == 0x000008, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::Z' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, Width) == 0x00000C, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::Width' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, Height) == 0x000010, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::Height' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, R) == 0x000014, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::R' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, G) == 0x000015, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::G' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, B) == 0x000016, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::B' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, A) == 0x000017, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::A' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, ScaleX) == 0x000018, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::ScaleX' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, ScaleY) == 0x00001C, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::ScaleY' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, Angle) == 0x000020, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::Angle' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, Antialiasing) == 0x000024, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::Antialiasing' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRect, DrawPoint) == 0x000028, "Member 'UIDrawBaseActor_BPUICommand_DrawRect::DrawPoint' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_DrawRectV4
// 0x0044 (0x0044 - 0x0000)
struct UIDrawBaseActor_BPUICommand_DrawRectV4 final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VX0;                                               // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VY0;                                               // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VX1;                                               // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VY1;                                               // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VX2;                                               // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VY2;                                               // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VX3;                                               // 0x0024(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VY3;                                               // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         R;                                                 // 0x002C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         G;                                                 // 0x002D(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         B;                                                 // 0x002E(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         A;                                                 // 0x002F(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleX;                                            // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleY;                                            // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0038(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Antialiasing;                                      // 0x003C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUI_DRAW_POINT                                DrawPoint;                                         // 0x0040(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_DrawRectV4) == 0x000004, "Wrong alignment on UIDrawBaseActor_BPUICommand_DrawRectV4");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_DrawRectV4) == 0x000044, "Wrong size on UIDrawBaseActor_BPUICommand_DrawRectV4");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, X) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::X' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, Y) == 0x000004, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::Y' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, Z) == 0x000008, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::Z' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, VX0) == 0x00000C, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::VX0' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, VY0) == 0x000010, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::VY0' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, VX1) == 0x000014, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::VX1' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, VY1) == 0x000018, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::VY1' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, VX2) == 0x00001C, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::VX2' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, VY2) == 0x000020, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::VY2' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, VX3) == 0x000024, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::VX3' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, VY3) == 0x000028, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::VY3' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, R) == 0x00002C, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::R' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, G) == 0x00002D, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::G' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, B) == 0x00002E, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::B' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, A) == 0x00002F, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::A' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, ScaleX) == 0x000030, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::ScaleX' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, ScaleY) == 0x000034, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::ScaleY' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, Angle) == 0x000038, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::Angle' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, Antialiasing) == 0x00003C, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::Antialiasing' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRectV4, DrawPoint) == 0x000040, "Member 'UIDrawBaseActor_BPUICommand_DrawRectV4::DrawPoint' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_DrawRoundRect
// 0x0030 (0x0030 - 0x0000)
struct UIDrawBaseActor_BPUICommand_DrawRoundRect final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Round;                                             // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         R;                                                 // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         G;                                                 // 0x0019(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         B;                                                 // 0x001A(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         A;                                                 // 0x001B(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleX;                                            // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleY;                                            // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0024(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Antialiasing;                                      // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUI_DRAW_POINT                                DrawPoint;                                         // 0x002C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_DrawRoundRect) == 0x000004, "Wrong alignment on UIDrawBaseActor_BPUICommand_DrawRoundRect");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_DrawRoundRect) == 0x000030, "Wrong size on UIDrawBaseActor_BPUICommand_DrawRoundRect");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, X) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::X' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, Y) == 0x000004, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::Y' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, Z) == 0x000008, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::Z' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, Width) == 0x00000C, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::Width' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, Height) == 0x000010, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::Height' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, Round) == 0x000014, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::Round' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, R) == 0x000018, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::R' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, G) == 0x000019, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::G' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, B) == 0x00001A, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::B' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, A) == 0x00001B, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::A' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, ScaleX) == 0x00001C, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::ScaleX' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, ScaleY) == 0x000020, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::ScaleY' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, Angle) == 0x000024, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::Angle' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, Antialiasing) == 0x000028, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::Antialiasing' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawRoundRect, DrawPoint) == 0x00002C, "Member 'UIDrawBaseActor_BPUICommand_DrawRoundRect::DrawPoint' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_DrawScrollbar
// 0x003C (0x003C - 0x0000)
struct UIDrawBaseActor_BPUICommand_DrawScrollbar final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScrollRange;                                       // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ScrollPos;                                         // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DrawListNum;                                       // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxListNum;                                        // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         R;                                                 // 0x0024(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         G;                                                 // 0x0025(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         B;                                                 // 0x0026(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         A;                                                 // 0x0027(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleX;                                            // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleY;                                            // 0x002C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Antialiasing;                                      // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUI_DRAW_POINT                                DrawPoint;                                         // 0x0038(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_DrawScrollbar) == 0x000004, "Wrong alignment on UIDrawBaseActor_BPUICommand_DrawScrollbar");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_DrawScrollbar) == 0x00003C, "Wrong size on UIDrawBaseActor_BPUICommand_DrawScrollbar");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, X) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::X' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, Y) == 0x000004, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::Y' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, Z) == 0x000008, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::Z' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, Width) == 0x00000C, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::Width' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, Height) == 0x000010, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::Height' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, ScrollRange) == 0x000014, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::ScrollRange' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, ScrollPos) == 0x000018, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::ScrollPos' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, DrawListNum) == 0x00001C, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::DrawListNum' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, MaxListNum) == 0x000020, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::MaxListNum' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, R) == 0x000024, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::R' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, G) == 0x000025, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::G' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, B) == 0x000026, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::B' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, A) == 0x000027, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::A' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, ScaleX) == 0x000028, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::ScaleX' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, ScaleY) == 0x00002C, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::ScaleY' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, Angle) == 0x000030, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::Angle' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, Antialiasing) == 0x000034, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::Antialiasing' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawScrollbar, DrawPoint) == 0x000038, "Member 'UIDrawBaseActor_BPUICommand_DrawScrollbar::DrawPoint' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_DrawSircle
// 0x0018 (0x0018 - 0x0000)
struct UIDrawBaseActor_BPUICommand_DrawSircle final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         R;                                                 // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         G;                                                 // 0x0011(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         B;                                                 // 0x0012(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         A;                                                 // 0x0013(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Antialiasing;                                      // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_DrawSircle) == 0x000004, "Wrong alignment on UIDrawBaseActor_BPUICommand_DrawSircle");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_DrawSircle) == 0x000018, "Wrong size on UIDrawBaseActor_BPUICommand_DrawSircle");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSircle, X) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_DrawSircle::X' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSircle, Y) == 0x000004, "Member 'UIDrawBaseActor_BPUICommand_DrawSircle::Y' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSircle, Z) == 0x000008, "Member 'UIDrawBaseActor_BPUICommand_DrawSircle::Z' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSircle, Radius) == 0x00000C, "Member 'UIDrawBaseActor_BPUICommand_DrawSircle::Radius' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSircle, R) == 0x000010, "Member 'UIDrawBaseActor_BPUICommand_DrawSircle::R' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSircle, G) == 0x000011, "Member 'UIDrawBaseActor_BPUICommand_DrawSircle::G' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSircle, B) == 0x000012, "Member 'UIDrawBaseActor_BPUICommand_DrawSircle::B' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSircle, A) == 0x000013, "Member 'UIDrawBaseActor_BPUICommand_DrawSircle::A' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSircle, Antialiasing) == 0x000014, "Member 'UIDrawBaseActor_BPUICommand_DrawSircle::Antialiasing' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_DrawSpr
// 0x0030 (0x0030 - 0x0000)
struct UIDrawBaseActor_BPUICommand_DrawSpr final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         R;                                                 // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         G;                                                 // 0x000D(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         B;                                                 // 0x000E(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         A;                                                 // 0x000F(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SprNo;                                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleX;                                            // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleY;                                            // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class USprAsset*                        SprHandle;                                         // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUI_DRAW_POINT                                DrawPoint;                                         // 0x0028(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIDrawBaseActor_BPUICommand_DrawSpr) == 0x000008, "Wrong alignment on UIDrawBaseActor_BPUICommand_DrawSpr");
static_assert(sizeof(UIDrawBaseActor_BPUICommand_DrawSpr) == 0x000030, "Wrong size on UIDrawBaseActor_BPUICommand_DrawSpr");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, X) == 0x000000, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::X' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, Y) == 0x000004, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::Y' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, Z) == 0x000008, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::Z' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, R) == 0x00000C, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::R' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, G) == 0x00000D, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::G' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, B) == 0x00000E, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::B' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, A) == 0x00000F, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::A' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, SprNo) == 0x000010, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::SprNo' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, ScaleX) == 0x000014, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::ScaleX' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, ScaleY) == 0x000018, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::ScaleY' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, Angle) == 0x00001C, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::Angle' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, SprHandle) == 0x000020, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::SprHandle' has a wrong offset!");
static_assert(offsetof(UIDrawBaseActor_BPUICommand_DrawSpr, DrawPoint) == 0x000028, "Member 'UIDrawBaseActor_BPUICommand_DrawSpr::DrawPoint' has a wrong offset!");

// Function xrd777.UIDrawBaseActor.BPUICommand_DrawTexture
// 0x0040 (0x0040 - 0x0000)
struct UIDrawBaseActor_BPUICommand_DrawTexture final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         R;                                                 // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         G;                                                 // 0x000D(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         B;                                                 // 0x000E(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         A;                                                 // 0x000F(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleX;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleY;                                            // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
